Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: A key feature of the Dojo framework is its use of [commands](../cairo/commands.md). Commands are a design pattern that helps to reduce boilerplate code, resulting in cleaner and more maintainable applications. They achieve this by encapsulating specific actions or operations within self-contained, reusable units.
cn: Dojo框架的一个关键特性是其使用[commands](../cairo/commands.md)。命令是一种设计模式，有助于减少样板代码，从而使应用程序更清洁和易于维护。它们通过封装特定的操作或操作在自包含的，可重用的单元内来实现这一点。
jp: 道場フレームワークの主要な特徴の一つは、[commands](../cairo/commands.md)の使用です。コマンドは、ボイラープレートコードを削減し、よりクリーンで保守しやすいアプリケーションを実現するためのデザインパターンです。これらは、特定のアクションや操作を自己完結型かつ再利用可能なユニットにカプセル化することでこれを達成します。
lt: Unum ex maxime commendabilis Dojo framework est usus suus de [commandis](../cairo/commands.md). Commanda sunt speciem rationis adiutoriam in minuendo repetita opera, rediens in claro atque manutenebitiliorem applicationes. Hoc consequi in claudentibus specificas actiones vel operationes intra continentes, reusabiles unitates.
vi: Một tính năng chính của framework Dojo là việc sử dụng [lệnh](../cairo/commands.md). Lệnh là một mẫu thiết kế giúp giảm bớt mã boilerplate, làm cho ứng dụng trở nên sạch sẽ và dễ bảo trì hơn. Chúng đạt được điều này bằng cách đóng gói các hành động cụ thể hoặc các hoạt động trong các đơn vị có thể tái sử dụng tự chứa.

source: Developers can write commands freely within Systems, and the Cairo compiler takes care of inlining the appropriate functions.
cn: 开发人员可以在系统中自由编写命令，而开罗编译器会负责嵌入适当的功能。
jp: 開発者はシステム内で自由にコマンドを書くことができ、Cairoコンパイラが適切な関数をインラインで処理します。
lt: Programmatores possunt libere scribere iussa intra Systemata, et compilator Cairoticus curat pro inlining functionibus idoneis.
vi: Những nhà phát triển có thể viết các lệnh một cách tự do bên trong các Hệ thống, và trình biên dịch Cairo sẽ chịu trách nhiệm tối ưu hóa các chức năng phù hợp.

source: Essential Reading
cn: 重要阅读
jp: 重要な読書
lt: Lectio necessaria
vi: Đọc cần thiết

source: [Cairo book](https://github.com/cairo-book/cairo-book)
cn: 开罗书[`开罗书`](https://github.com/cairo-book/cairo-book)
jp: [カイロの本](https://github.com/cairo-book/cairo-book) (Kairo no Hon)
lt: Liber Cairensis
vi: [Sách Cairo](https://github.com/cairo-book/cairo-book)

source: [Awesome Cairo](https://github.com/auditless/awesome-cairo)
cn: 开罗真棒 (https://github.com/auditless/awesome-cairo)
jp: 素晴らしいカイロ ([Awesome Cairo](https://github.com/auditless/awesome-cairo))
lt: Cairus mirabilis
vi: Spectacular Cairo.

source: [Starknet Book](https://book.starknet.io/)
cn: Starknet书籍: https://book.starknet.io/
jp: [Starknet Book](https://book.starknet.io/)を日本語に翻訳してください。
lt: Liber Starknet
vi: Sách Starknet: https://book.starknet.io/

source: Starknet as an L2
cn: Starknet作为L2
jp: スタークネットはL2です。
lt: Starknet ut L2
vi: Starknet như một L2

source: Starknet is a Validity Rollup Layer 2 (L2) solution designed to scale Ethereum. It operates by offering high transaction throughput and low gas costs while maintaining the same level of security as Ethereum Layer 1 (L1). The strategy it uses is akin to solving a sudoku puzzle: verifying a solution is easier than finding the solution from scratch. Similarly, Starknet replaces heavy and costly L1 computation with cheaper L1 verification through the use of STARK proofs computed off-chain.
cn: Starknet是有效性Rollup二层（L2）解决方案，旨在扩展以太坊。它通过提供高交易吞吐量和低gas成本来运作，同时保持与以太坊一层（L1）相同级别的安全性。它使用的策略类似于解决数独难题：验证解决方案比从头开始找解决方案更容易。同样，Starknet通过在链下计算STARK证明来替代繁重且昂贵的L1计算。
jp: Starknetは、Ethereumをスケーリングするために設計されたバリディティ・ロールアップレイヤー2（L2）のソリューションです。高いトランザクションスループットと低いガスコストを提供すると同時に、Ethereumのレイヤー1（L1）と同じレベルのセキュリティを維持します。Starknetが使用する戦略は、数独パズルを解くことに似ています：解を検証する方がゼロから解を見つけるよりも簡単です。同様に、Starknetは重いコンピューテーションと高コストのL1計算を、オフチェーンで計算された安価なL1検証によって置き換えます。
lt: Starknet est solutio Layer 2 (L2) ad validitatem rumpendam designata, quae Ethereum extendit. Per transactionum callem maximam et pernumquam gas onera operatur, eadem securitatis normalis Layer 1 (L1) Ethereum conservans. Eius quodammodo utitur stratagemate ad enum difficilis sudoku nisi solvendo facillime verificando, et simili modo, gravem et magnum computationem L1 substituit verificando minimi L1, prodest STARK confirmationes extra catenam computatae.
vi: Starknet là một giải pháp Validity Rollup Layer 2 (L2) được thiết kế để mở rộng Ethereum. Nó hoạt động bằng cách cung cấp khả năng xử lý giao dịch cao và chi phí gas thấp trong khi duy trì cùng mức độ bảo mật như Ethereum Layer 1 (L1). Chiến lược mà nó sử dụng tương tự như việc giải một bài toán sudoku: xác minh một giải pháp dễ hơn là tìm ra giải pháp từ đầu. Tương tự, Starknet thay thế công việc tính toán nặng và tốn kém trên L1 bằng việc xác minh L1 rẻ hơn thông qua việc sử dụng STARK proofs được tính toán ngoại tuyến.

source: In more technical terms, Starknet is a permissionless Validity-Rollup (also known as a "ZK-Rollup") that supports general computation and currently runs as an L2 network over Ethereum. The network's L1 security is guaranteed by its utilization of the STARK cryptographic proof system, which is considered one of the safest and most scalable.
cn: 更加技术化的说法是，Starknet是一种无需许可的有效性Rollup（也被称为“ZK-Rollup”），支持通用计算，并目前作为以太坊上的L2网络运行。该网络的L1安全性由其利用STARK加密证明系统来保证，被认为是最安全和可扩展性最强的之一。
jp: 技術的な言葉で言えば、Starknetは一般的な計算をサポートする許可のない「Validity-Rollup」（または「ZK-Rollup」とも呼ばれる）であり、現在はEthereum上のL2ネットワークとして稼働しています。ネットワークのL1セキュリティは、STARK暗号証明システムの利用によって保証されており、最も安全かつスケーラブルな手法の一つとされています。
lt: In terminis technicis, Starknet est Validditatis-Rollup indempotentis (etiam notum ut "ZK-Rollup") quod computationem generalem sustinet et adhuc ut retia L2 super Ethereum currunt. Securitas retiarum L1 garantitur per systema probationis cryptographicae STARK, quod una ex securissimis ac maximae scalability existimat.
vi: Trong thuật ngữ kỹ thuật hơn, Starknet là một Validity-Rollup không cần sự cho phép (còn được gọi là "ZK-Rollup") hỗ trợ tính toán chung và hiện đang chạy như một mạng L2 trên Ethereum. An toàn L1 của mạng được đảm bảo bởi việc sử dụng hệ thống chứng minh mật mã STARK, được coi là một trong những hệ thống an toàn và có khả năng mở rộng nhất.

source: Starknet as an Appchain
cn: 斯塔克网作为应用链
jp: アプリチェーンとしてのStarknet
lt: Starknet ut Appchain
vi: Starknet như một Appchain

source: Cairo is an isomorphic, general-purpose language, optimized for Zero-Knowledge (ZK) proofs. It's the driving force behind Starknet, Starkex, and appchains. Remarkably, you can also run it in WebAssembly (WASM) to generate proofs on the client-side! The Dojo team is working closely with the [Madara](https://github.com/keep-starknet-strange/madara) team to enable Starknet appchains to seamlessly run Dojo worlds.
cn: 开罗是一种同构的、通用的编程语言，专为零知识（ZK）证明进行优化。它是Starknet、Starkex 和 appchains 的推动力。值得注意的是，您还可以在WebAssembly（WASM）中运行它，以在客户端生成证明！道场团队正在与[Madara](https://github.com/keep-starknet-strange/madara)团队密切合作，以使Starknet appchains能够无缝运行道场世界。
jp: カイロは、Zero-Knowledge（ZK）プルーフに最適化された、同形で汎用性のある言語です。それはStarknet、Starkex、およびアプリチェーンの背後にある推進力です。驚くべきことに、WebAssembly（WASM）で実行して、クライアント側で証明を生成することもできます！ドージョチームは、[Madara](https://github.com/keep-starknet-strange/madara)チームと緊密に連携していて、Starknetアプリチェーンがドージョワールドをシームレスに実行できるようにしています。
lt: Cairus est linguam isomorpham, generalis usus, oboptimizatam ad Probationes Ignorantiae (ZK). Vox motor est post Starknet, Starkex et appchains. Mirabiliter, tu etiam potes currere in WebAssembly (WASM) ad creandos probationes ex parte clientis! Equus Dojo operatur coniunctim cum [Madara](https://github.com/keep-starknet-strange/madara) team ad facilitandos Starknet appchains ut Dojo mundos currant concinne.
vi: Cairo là một ngôn ngữ đồng dạng, mục đích chung, được tối ưu hóa cho các chứng minh Zero-Knowledge (ZK). Nó là động lực chính đằng sau Starknet, Starkex và appchains. Đáng chú ý là bạn cũng có thể chạy nó trong WebAssembly (WASM) để tạo ra chứng minh ở phía máy khách! Nhóm Dojo đang chặt chẽ hợp tác với nhóm [Madara](https://github.com/keep-starknet-strange/madara) để cho phép appchains của Starknet chạy một cách mượt mà các thế giới Dojo.

source: Who owns Dojo?
cn: 谁拥有道场？
jp: 道場は誰の所有ですか？ (Doujou wa dare no shoyuu desu ka?)
lt: Quis dominus Dojo est?
vi: Ai sở hữu Dojo?

source: Dojo is strictly open-source and uses the Apache 2.0 license. Anyone can use Dojo for free, and anyone can contribute to the project.
cn: Dojo严格遵循开源原则，使用Apache 2.0许可证。任何人都可以免费使用Dojo，并且任何人都可以为该项目做出贡献。
jp: Dojoは厳密にオープンソースであり、Apache 2.0 ライセンスを使用しています。誰でも無料でDojoを利用することができ、またプロジェクトへの貢献も誰でも行うことができます。
lt: Dojo est strictim open-source et utitur licentia Apache 2.0. Quisquis potest uti Dojo gratis, et quisquis potest ad projectum conferre.
vi: Dojo hoàn toàn mã nguồn mở và sử dụng giấy phép Apache 2.0. Ai cũng có thể sử dụng Dojo miễn phí và bất kỳ ai cũng có thể đóng góp vào dự án.

source: Why Dojo?
cn: 为什么选择道场？
jp: どうして道場ですか？ (Doushite doujou desu ka?)
lt: Curriculum non?
vi: Tại sao Dojo?

source: Dojo was created to solve problems the founders faced when building onchain games. It standardizes the process of building such games and provides a suite of tools to make it easier.
cn: 道童创建旨在解决创始人在构建onchain游戏时遇到的问题。它规范了构建此类游戏的过程，并提供了一套工具，使其更容易。
jp: 道場は、オンチェーンゲームを開発する際に創設者が直面した問題を解決するために作られました。それは、このようなゲームの開発プロセスを標準化し、それをより簡単にするためのツールのスイートを提供します。
lt: Dojo creatus est ad problemata resolvenda quae conditores in rebus aedificantibus ludos in catenam habuerunt. Processum aedificationis huiusmodi ludorum stabiliat et supellectilem instrumentorum praebet ad faciliorem reddendum.
vi: Dojo được tạo ra để giải quyết những vấn đề mà các nhà sáng lập gặp phải khi xây dựng trò chơi trên chuỗi. Nó chuẩn hóa quy trình xây dựng những trò chơi như vậy và cung cấp một bộ công cụ để làm cho việc này dễ dàng hơn.

source: What is the Dojo roadmap?
cn: 道場的路線圖是什麼？
jp: 道場のロードマップは何ですか？ (Doujou no rodomappu wa nan desu ka?)
lt: Quid est via Dojo?
vi: Lộ trình Dojo là gì?

source: Dojo is rapidly evolving. You can find open issues on the [Dojo Github](https://github.com/dojoengine/dojo/issues) and join the [Discord](https://discord.gg/vUN4Xq9Qv6) to get involved. If you have ideas for the project, please open an issue.
cn: 道场正在迅速发展。 您可以在[Dojo Github](https://github.com/dojoengine/dojo/issues)上找到公开问题，并加入[Discord](https://discord.gg/vUN4Xq9Qv6)以参与其中。 如果您对该项目有任何想法，请提出问题。
jp: 道場は急速に進化しています。[Dojo Github](https://github.com/dojoengine/dojo/issues)でオープンな課題を見つけることができ、[Discord](https://discord.gg/vUN4Xq9Qv6)に参加して関わることができます。プロジェクトへのアイデアがある場合は、課題をオープンしてください。
lt: Dojo celeriter evolvitur. Potes apertas quaestiones in [Dojo Github](https://github.com/dojoengine/dojo/issues) invenire et [Discord](https://discord.gg/vUN4Xq9Qv6) adiungere ut adfis. Si consilium ad proiectum habes, quaestionem aperire vale.
vi: Dojo đang phát triển mạnh mẽ. Bạn có thể tìm thấy các vấn đề mở trên [Dojo Github](https://github.com/dojoengine/dojo/issues) và tham gia [Discord](https://discord.gg/vUN4Xq9Qv6) để tham gia. Nếu bạn có ý tưởng cho dự án, vui lòng mở một vấn đề.

source: What is an onchain game?
cn: 什么是链上游戏？
jp: オンチェーンゲームとは何ですか？(Onchain gēmu to wa nan desu ka?)
lt: Quid est in catena lusus?
vi: Trò chơi trên chuỗi như thế nào?

source: Onchain games are games that exist entirely on a public blockchain network; all states and logic are onchain. Clients (like web browsers) do not exist on the chain but exist purely to interact with and interpret the onchain state.
cn: Onchain游戏是完全存在于公共区块链网络上的游戏；所有状态和逻辑都在链上。客户端（如web浏览器）并不存在于链上，而纯粹是为了与链上状态进行交互和解释。
jp: オンチェーンゲームは、完全に公開されたブロックチェーンネットワーク上に存在するゲームです。すべての状態とロジックはオンチェーン上にあります。クライアント（ウェブブラウザのようなもの）はチェーン上に存在せず、純粋にオンチェーンの状態と対話するために存在します。
lt: Ludorum in catena ludorum sunt ludorum qui omnino in publico reticulo catenarum consistunt; omnes status et ratio in catena sunt. Clientes (ut vestigia web) non in catena sunt sed solummodo ad interagendum cum statu in catena interpretandumque existunt.
vi: Trò chơi Onchain là những trò chơi tồn tại hoàn toàn trên mạng lưới blockchain công cộng; tất cả trạng thái và logic đều ở onchain. Khách hàng (như trình duyệt web) không tồn tại trên chuỗi mà chỉ tồn tại để tương tác và diễn dịch trạng thái onchain.

source: What is an autonomous world?
cn: 一个自治的世界是什么？
jp: 自律的な世界とは何ですか？ (Jiritsuteki na sekai to wa nanidesu ka?)
lt: Quid est autonoma mundi?
vi: Thế giới tự trị là gì?

source: An autonomous world is one that exists entirely onchain. It's not controlled by any single entity but is instead governed by the rules set within that world. Dive deeper into the topic here: [Autonomous Worlds](../theory/autonomous-worlds.md).
cn: 一个自治的世界是完全存在于链上的世界。它不受任何单一实体控制，而是由该世界内设置的规则来管理。在这里深入了解这个主题：[自治世界](../theory/autonomous-worlds.md)。
jp: 自律的な世界とは、完全にオンチェーン上で存在するものです。それは任意の単一のエンティティによって制御されるものではなく、その世界内で設定された規則によって統治されます。詳しくはこちらで探求してください： [自律的な世界](../theory/autonomous-worlds.md)。
lt: Mundus autonoma est qui totus in catena existit. Non alicuius entis singuli moderatur, sed potius regulis intra eum positis gubernatur. Maius in hoc argumento invenies hic: [Mundus Autonomi](../theory/autonomous-worlds.md).
vi: Một thế giới tự trị là một thế giới tồn tại hoàn toàn trên chuỗi. Nó không được kiểm soát bởi bất kỳ thực thể nào mà thay vào đó được quản lý bởi các quy tắc được đặt ra trong thế giới đó. Đào sâu hơn vào chủ đề ở đây: [Thế giới tự trị](../theory/autonomous-worlds.md).

source: What is Cairo?
cn: 开罗是什么？
jp: カイロとは何ですか？ (Kairo to wa nan desu ka?)
lt: Quid est Cairo?
vi: Cairo là gì?

source: Cairo is an opensource programming language invented by Starkware. It's a Turing-complete language meant for general-purpose computation. It's a low-level language designed to compile to the Cairo Virtual Machine. Learn more about it here: [Cairo](../theory/cairo.md).
cn: 开罗是由Starkware发明的开源编程语言。它是一种用于通用计算的图灵完备语言。这是一种设计用于编译成开罗虚拟机的低级语言。在这里了解更多信息：[Cairo](../theory/cairo.md)。
jp: CairoはStarkwareによって発明されたオープンソースのプログラミング言語です。一般的な目的のために作られたチューリング完全な言語です。Cairoは、Cairo仮想マシンにコンパイルするために設計された低レベルの言語です。詳細はこちらで学ぶことができます：[Cairo](../theory/cairo.md)。
lt: Cairo est lingua programmationis open source a Starkware inventa. Est lingua completens Turing ad computationem generalis destinata. Est lingua infera destinata ad compilationem in Machina Virtuali Cairo. Discit amplius hic: [Cairo](../theory/cairo.md).
vi: Cairo là một ngôn ngữ lập trình mã nguồn mở được phát minh bởi Starkware. Đó là một ngôn ngữ hoàn toàn Turing được thiết kế cho tính toàn diện của tính toán. Đó là một ngôn ngữ cấp thấp được thiết kế để biên dịch thành Máy ảo Cairo. Tìm hiểu thêm về nó tại đây: [Cairo](../theory/cairo.md).

source: What is a provable game?
cn: 可证实的游戏是什么？
jp: 証明可能なゲームは何ですか？ (Shōmei-kanō-na gēmu wa nan desu ka?)
lt: Quid est ludus probativus?
vi: Trò chơi có thể chứng minh là gì?

source: Thanks to the magic of zero-knowledge proofs, we can ensure a game is fair by verifying a zk proof created off-chain. But what does that entail? Consider a game of chess. We aim for an experience where players trust each other's moves. In a straightforward approach — and given the simple rules of chess — if this were in a blockchain environment, every move would be a transaction on the blockchain. This is costly. We just want to know the winner, not every move.
cn: 由于零知识证明的魔力，我们可以通过验证链下生成的zk证明来确保游戏的公平性。但这意味着什么？以象棋游戏为例。我们的目标是让玩家相互信任对方的棋步。在一个直接的方式 —— 鉴于象棋的简单规则 —— 如果这是在区块链环境中，每一步棋都将成为区块链上的交易。这是昂贵的。我们只想知道谁是赢家，而不是每一步棋。
jp: ゼロ知識証明の魔法のおかげで、ゲームが公平であることをオンチェーン外で作成されたzk証明を検証することで確認できます。しかし、それは具体的には何を意味するのでしょうか？チェスのゲームを考えてみましょう。私たちは、プレーヤーが互いの動きを信頼できる体験を目指しています。シンプルなチェスのルールに基づいて、直接的なアプローチでは、このゲームがブロックチェーンの環境で行われるならば、すべての動きがブロックチェーン上でのトランザクションになります。これはコストがかかります。私たちは単に勝者を知りたいだけです。
lt: Gratias agimus arti magicae probationibus nulla-cogniti, possumus assequi lusum esse iustum per probationem nulla-cogniti extra catenam creata. Sed quid hoc involvit? Considerate lusum scaccorum. Conamur experiendi, ubi ludifices confidunt motibus adversariorum. In viam simplicem — et datum regulas simplices scaccorum — si hoc esset in ambiente catenae, omnis motus esset transactio in catena. Hoc est sumptuosum. Tantum volumus scire victorem, non omne motum.
vi: Nhờ vào phép màu của chứng minh không kiến thức zero-knowledge, chúng ta có thể đảm bảo một trò chơi công bằng bằng cách xác minh một chứng minh zk được tạo ra ngoại chuỗi. Nhưng điều đó thuộc về cái gì? Hãy xem xét một trò chơi cờ vua. Chúng tôi nhằm mục tiêu tạo ra trải nghiệm mà người chơi tin tưởng vào các nước đi của nhau. Trong một cách tiếp cận trực tiếp — và với các quy tắc đơn giản của cờ vua — nếu điều này xảy ra trong môi trường blockchain, mỗi nước đi sẽ là một giao dịch trên blockchain. Điều này rất tốn kém. Chúng tôi chỉ muốn biết người chiến thắng, không phải mỗi nước đi.

source: With zk proofs and client communications, players can establish a state channel, sharing moves off-chain and ensuring their validity. At the end, a zk proof can be submitted to the blockchain to confirm the game's fairness. This constitutes a provable game.
cn: 使用零知识证明和客户端通信，玩家可以建立一个状态通道，离线分享动作并确保它们的有效性。最后，可以提交一个零知识证明到区块链上确认游戏的公平性。这构成了一个可证实的游戏。
jp: Zk証明とクライアント間の通信により、プレイヤーはステートチャネルを確立し、オフチェーンでのムーブの共有とその妥当性を確認できます。最後に、zk証明をブロックチェーンに提出することでゲームの公平性を確定できます。これは証明可能なゲームを構成します。
lt: Cum probationibus zk et communicationibus clientium, ludibri potest sancire canalem status, mutationes extra catena communicantes et eorum validationem assurantes. Tandem, probatio zk potest ad catenam adhiberi ad confirmandum justitiam ludii. Hoc constituens ludum demonstrabilem.
vi: Với chứng minh zk và giao tiếp của khách hàng, người chơi có thể thiết lập một kênh trạng thái, chia sẻ các bước đi ngoại chuỗi và đảm bảo tính hợp lệ của chúng. Cuối cùng, một chứng minh zk có thể được gửi đến blockchain để xác nhận tính công bằng của trò chơi. Điều này tạo nên một trò chơi có thể chứng minh được.

source: It is worth reading [theory](../theory/autonomous-worlds.md) to familiarize yourself with the concept of Autonomous Worlds (AWs) and the [Cairo ecosystem](../theory/cairo.md) before diving into the code.
cn: 阅读[理论](../theory/autonomous-worlds.md)值得，以便熟悉自主世界（AWs）概念和[开罗生态系统](../theory/cairo.md)，然后再深入了解代码。
jp: [理論](../theory/autonomous-worlds.md)を読む価値があります。コードに立ち入る前に、自律型ワールド（AWs）の概念と[Cairoエコシステム](../theory/cairo.md)について知るために読むことをお勧めします。
lt: Dignum est legere [theoriam](../theory/autonomous-worlds.md) ut te familiariter facias cum conceptu Mundos Autonomous (AWs) et [ecosystema Cairo](../theory/cairo.md) antequam te immergas in codicem.
vi: Đáng đọc [lý thuyết](../theory/autonomous-worlds.md) để làm quen với khái niệm Thế giới Tự trị (AWs) và hệ sinh thái Cairo (../theory/cairo.md) trước khi đào sâu vào mã.

source: Install Dojoup
cn: 安装道场阁。
jp: 道場をインストールする (Doujou wo insutouru suru)
lt: Dojoup Installandi
vi: Cài đặt Dojoup

source: Dojo is built around a set of development tools - Katana, Torii and Sozo. Install them all easily with Dojoup. You can find detailed information about Dojoup [here](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).
cn: Dojo 是围绕一套开发工具构建的 - Katana、Torii 和 Sozo。使用 Dojoup 可以轻松安装它们。您可以在这里找到有关 Dojoup 的详细信息：[https://github.com/dojoengine/dojo/blob/master/dojoup/README.md](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md)。
jp: 道場は、開発ツールである刀（Katana）、鳥居（Torii）、創造（Sozo）を中心に構築されています。Dojoupを使用して簡単にすべてのツールをインストールできます。Dojoupの詳細については、[こちら](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md)で詳細情報をご覧いただけます。
lt: Dojo circum a set of development tools - Katana, Torii et Sozo. Facile omnia installa cum Dojoup. Potes invenire informationem detallatam de Dojoup [hic](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).
vi: Dojo được xây dựng xung quanh một bộ công cụ phát triển - Katana, Torii và Sozo. Cài đặt chúng dễ dàng với Dojoup. Bạn có thể tìm thấy thông tin chi tiết về Dojoup [tại đây](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).

source: This will install Dojoup, then simply follow the instructions on-screen, which will make the `dojoup` command available in your CLI.
cn: 这将安装Dojoup，然后只需按照屏幕上的说明进行操作，这将使`dojoup`命令在您的CLI中可用。
jp: これにより、Dojoupがインストールされ、その後画面の指示に従うだけで、`dojoup`コマンドをCLIで使用することができます。
lt: Hoc installabit Dojoup, deinde simpliciter sequere institutiones in screen, quae facient "dojoup" praeceptum disponibile in tua CLI.
vi: Cài đặt Dojoup, sau đó đơn giản làm theo hướng dẫn trên màn hình, điều này sẽ làm cho lệnh `dojoup` sẵn có trong CLI của bạn.

source: For full `dojoup` reference and debugging see [Dojoup](../toolchain/dojoup.md).
cn: 完整的`dojoup`参考和调试请参见[Dojoup](../toolchain/dojoup.md)。
jp: フルの`dojoup`の参照とデバッグについては、[Dojoup](../toolchain/dojoup.md)を参照してください。
lt: Ad plenam `dojoup` citationem et emendationem vide [Dojoup](../toolchain/dojoup.md).
vi: Để biết đầy đủ thông tin về "dojoup" và gỡ lỗi, vui lòng xem [Dojoup](../toolchain/dojoup.md).

source: Next steps
cn: 下一步
jp: 次のステップ
lt: Proximi gradus
vi: Các bước tiếp theo

source: Head to [Hello Dojo](../cairo/hello-dojo.md) to get create your first Dojo world.
cn: 去[你好道场](../cairo/hello-dojo.md)创建你的第一个道场世界。
jp: 最初の道場の世界を作るために、[Hello Dojo](../cairo/hello-dojo.md)に移動してください。
lt: Dirigere ad [Salve Dojo](../cairo/hello-dojo.md) ut crees tuam primam Dojo mundum.
vi: Đầu tiên đến [Hello Dojo](../cairo/hello-dojo.md) để tạo thế giới Dojo đầu tiên của bạn.

source: Building from source
cn: 从源代码构建
jp: ソースコードからビルドする
lt: Aedificium ex fonte
vi: Xây dựng từ nguồn

source: If you are just wanting to play with the toolchain, we strongly suggest following the [Quick Start](./quick-start.md) guide.
cn: 如果你只是想要玩弄工具链，我们强烈建议你遵循[快速入门](./quick-start.md)指南。
jp: ツールチェーンで遊びたいだけの場合は、[クイックスタート](./quick-start.md)ガイドに従うことを強くおすすめします。
lt: Si velis tantum ludere cum machinarum catena, vehementer suademus sequi ductum celeris initii.
vi: Nếu bạn chỉ muốn chơi với bộ công cụ, chúng tôi mạnh mẽ khuyến nghị theo hướng dẫn [Bắt Đầu Nhanh](./quick-start.md).

source: Prerequisites
cn: 先决条件
jp: 前提条件 (Zenteki jōken)
lt: Praerequisita
vi: Yêu cầu tiên quyết

source: You will need the [Rust](https://rust-lang.org) compiler and Cargo, the Rust package manager. The easiest way to install both is with [`rustup.rs`](https://rustup.rs/).
cn: 你将需要[Rust](https://rust-lang.org)编译器和Rust软件包管理器Cargo。安装两者最简单的方法是使用[`rustup.rs`](https://rustup.rs/)。
jp: [Rust](https://rust-lang.org)コンパイラとRustパッケージマネージャであるCargoが必要です。両方をインストールする最も簡単な方法は、[`rustup.rs`](https://rustup.rs/)を使用することです。
lt: Opus est tibi compilatore [Rust](https://rust-lang.org) et Cargo, moderator pachetorum Rust. Facillimum est utraque installare cum [`rustup.rs`](https://rustup.rs/).
vi: Bạn sẽ cần trình biên dịch [Rust](https://rust-lang.org) và Cargo, quản lý gói Rust. Cách dễ nhất để cài đặt cả hai là sử dụng [`rustup.rs`](https://rustup.rs/).

source: On Windows, you will also need a recent version of [Visual Studio](https://visualstudio.microsoft.com/downloads/), installed with the "Desktop Development With C++" Workloads option.
cn: 在Windows上，您还需要安装一个最新版本的[Visual Studio]（https://visualstudio.microsoft.com/downloads/），并选择“使用C ++进行桌面开发”工作负载选项。
jp: Windows上では、「Desktop Development With C++」のワークロードオプションを使用して[Visual Studio](https://visualstudio.microsoft.com/downloads/)の最新バージョンもインストールする必要があります。
lt: The text cannot be translated into Latin as it contains a reference to an external resource (Visual Studio).
vi: Trên Windows, bạn cũng sẽ cần một phiên bản gần đây của [Visual Studio](https://visualstudio.microsoft.com/downloads/), được cài đặt với tùy chọn "Desktop Development With C++".

source: Building
cn: 建筑
jp: 建物 (たてもの)
lt: Aedificium
vi: Kết cấu

source: You can either use the different [Dojoup](#using-dojoup) flags:
cn: 你可以使用不同的[Dojoup](#using-dojoup)标志：
jp: あなたは異なる[Dojoup](#using-dojoup)フラグを使用することができます。
lt: Potestis uti diversis vexillis [Dojoup](#using-dojoup):
vi: Bạn có thể sử dụng các biểu tượng [Dojoup](#sử-dụng-dojoup) khác nhau:

source: Or, by using a single Cargo command:
cn: 或者，通过使用单个货运命令：
jp: または、単一のCargoコマンドを使用することによって：
lt: Aut, uno vectura praecepto uti:
vi: Hoặc, bằng cách sử dụng một lệnh vận chuyển duy nhất:
