Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: Within your systems, emitting custom events can be highly beneficial. Fortunately, there's a handy `emit!` macro that lets you release events directly from your world. These events are indexed by [torii](../toolchain/torii/overview.md)
cn: 在你的系统中，发出自定义事件可能会带来很大的益处。幸运的是，有一个方便的 `emit!` 宏，可以让你直接从你的世界释放事件。这些事件由 [torii](../toolchain/torii/overview.md) 索引。
jp: システム内でカスタムイベントを発生させることは非常に有益です。幸いなことに、便利な `emit!` マクロがあり、ワールドから直接イベントを発行することができます。これらのイベントは、[torii](../toolchain/torii/overview.md)によってインデックスされます。
lt: Intra systematis tui, emittere eventus consuetos valde fructuosum potest esse. Feliciter, est macros commodus `emitte!` quod sinet te eventus directe ex tuo mundo dimittere. Hi eventus ab [torii](../toolchain/torii/overview.md) indexantur.
vi: Trong hệ thống của bạn, phát ra các sự kiện tùy chỉnh có thể rất có lợi. May mắn thay, có một macro `emit!` tiện lợi cho phép bạn phát ra các sự kiện trực tiếp từ thế giới của bạn. Những sự kiện này được lập chỉ mục bởi [torii](../toolchain/torii/overview.md)

source: Use it like so:
cn: 使用方法如下：
jp: 次のように使ってください。
lt: Utere eo ita:
vi: Sử dụng nó như vậy:

source: Include this in your system and it will emit an event with the following structure:
cn: 将此内容包含在您的系统中，它将会触发一个带有以下结构的事件：
jp: システムにこれを含めると、次の構造のイベントが発生します。
lt: Inclūde hōc in tuō systēmā et id ēmittet eventum cum structūrā sequente:
vi: Bao gồm điều này trong hệ thống của bạn và nó sẽ phát ra một sự kiện với cấu trúc sau:

source: Now a full example using a custom event:
cn: 现在我们来看一些使用自定义事件的完整示例：
jp: 今、カスタムイベントを使用した具体的な例を紹介します。 (Ima, kasutamu ibento o shiyo shita gutaiteki na rei o shōkai shimasu.)
lt: Nunc plena exempli usu consueti eventus:
vi: Bây giờ là một ví dụ hoàn chỉnh sử dụng một sự kiện tùy chỉnh:

source: Note: Read about the `get!` and `set!` macros in [Commands](./commands.md).
cn: 注意：请阅读有关 [Commands](./commands.md) 中 `get!` 和 `set!` 宏的内容。
jp: 注意：[Commands](./commands.md)の`get!`と`set!`マクロについて読んでください。
lt: Nota: Legere de macrobus `get!` et `set!` in [Commandis](./commands.md).
vi: Chú ý: Đọc về các macro `get!` và `set!` trong [Lệnh](./commands.md).

source: Authorization is crucial to a world, just like how authorization is crucial to any smart contract.
cn: 授权对世界至关重要，就像授权对任何智能合约都至关重要一样。
jp: 認証は世界にとって重要であり、同様に認証はどんなスマートコントラクトにとっても重要です。 (Ninshō wa sekai ni totte jūyō de ari, dōyō ni ninshō wa donna sumātokontorakuto ni totte mo jūyō desu.)
lt: Auctoritas est cruciālis ad mundum, velut auctoritas cruciālis est ulla transactione intellegenti.
vi: Quyền ủy quyền rất quan trọng đối với một thế giới, cũng giống như quyền ủy quyền quan trọng đối với bất kỳ hợp đồng thông minh nào.

source: As discussed in the [World](./world.md) chapter, Autonomous Worlds (AWs) function as sovereign chains nested within a public blockchain. These Worlds are also open to the public. This structure allows anyone to enhance a World by deploying models or systems. However, this openness also introduces security considerations. Similar to Ethereum, interacting with a model's state within a System requires the appropriate authorization from the model owner.
cn: 根据《世界》章节讨论，自治世界（AWs）作为套在公共区块链内的主权链来运行。这些世界也向公众开放。这种结构允许任何人通过部署模型或系统来增强一个世界。然而，这种开放性也引入了安全考虑。与以太坊类似，在系统内与模型状态进行交互需要来自模型所有者的适当授权。
jp: [World](./world.md) 章で話し合われたように、自治ワールド（AWs）は公開ブロックチェーン内に入れ子になった主権チェーンとして機能します。これらのワールドも一般の人々に開放されています。この構造により、誰でもモデルやシステムを展開することでワールドを拡張することができます。しかし、このオープン性はセキュリティ上の考慮事項も導入します。Ethereumと同様に、システム内のモデルの状態に対して操作するためには、適切な権限をモデルの所有者から許可される必要があります。
lt: Sicut in capitulo [Mundi](./world.md) tractatum est, Mundi Autonomous (AWs) in catenis suveranis funt quae in catena publica blockchain interius nidificant. Hi Mundi etiam aperti sunt publico. Huius structura permitit cuique mundum augere per deploymenta modelorum aut systematum. Attamen, haec apertura etiam considerationes securitatis introducit. Similiter ad Ethereum, interagere cum statu modeli intra Systema idoneam authorizationem a domino modeli requiret.
vi: Như đã thảo luận trong chương [Thế giới](./world.md), Thế giới Tự trị (AWs) hoạt động như chuỗi chủ quyền lồng ghép trong một blockchain công cộng. Những Thế giới này cũng mở cửa cho công chúng. Cấu trúc này cho phép bất kỳ ai cải thiện một Thế giới bằng cách triển khai các mô hình hoặc hệ thống. Tuy nhiên, sự mở cửa này cũng đưa ra các yếu tố an ninh cần xem xét. Tương tự như Ethereum, tương tác với trạng thái của một mô hình bên trong một Hệ thống yêu cầu sự ủy quyền thích hợp từ chủ sở hữu mô hình.

source: Auth Architecture
cn: 权威架构
jp: 認証アーキテクチャ
lt: Auctor Architectura
vi: Kiến trúc xác thực

source: Every time a `set!` is called in a `System`, the world checks if the `System` has authorization to update the model state. Only when the `System` possesses the necessary authorization, the `set!` is executed. The following diagram illustrates the authorization architecture.
cn: 每次在“系统”中调用“set！”时，世界都会检查“系统”是否有权限更新模型状态。只有当“系统”拥有必要的授权时，“set！”才会被执行。下图说明了授权架构。
jp: 「システム」で「set!」が呼び出されるたびに、世界は「システム」がモデルの状態を更新するための権限を持っているかどうかをチェックします。必要な権限を持っている場合にのみ、「set!」が実行されます。以下の図は権限のアーキテクチャを示しています。
lt: Omni momento `set!` vocatur in sistema, mundus cogitat si vere possidet systema auctoritatem ut statum modello mutet. Tantummodo cum systema requistam auctoritatem possidet, `set!` egitur. Sequens diagramma auctoritatem architecturam demonstrat.
vi: Mỗi khi một `set!` được gọi trong một `System`, thế giới kiểm tra xem `System` có quyền cập nhật trạng thái mô hình hay không. Chỉ khi `System` sở hữu quyền được cần thiết, `set!` mới được thực hiện. Sơ đồ sau minh họa kiến trúc phân quyền.

source: ![Authorization Architecture](../images/dojo-auth.png)
cn: 授权架构
jp: この画像のタイトルは「![Authorization Architecture](../images/dojo-auth.png)」です。
lt: Architector autem authorizationem
vi: Kiến trúc Ủy quyền

source: Providing Authorization
cn: 提供授权
jp: 認証の提供
lt: Dantes licentiam
vi: Cung cấp ủy quyền

source: The deployer of the model is its initial owner. A model owner is able to grant the `owner` and `writer` roles. Only owners can grant a System the `writer` role which allows it to update the model.
cn: 模型的部署者是其最初的所有者。模型所有者能够授予“所有者”和“写入者”角色。只有所有者才能授予系统“写入者”角色，从而使其能够更新模型。
jp: モデルのデプロイヤーは、その初期所有者です。モデルの所有者は、`owner`および`writer`の役割を付与することができます。システムに`writer`の役割を付与してモデルを更新することができるのは所有者のみです。
lt: Deponens modello est eius dominus primus. Dominus modello potest concedere 'dominus' et 'scriptor' munera. Tantum dominus potest concedere Systema 'scriptor' munus, quod permittit ut modello renovet.
vi: Người triển khai mô hình là chủ sở hữu ban đầu của nó. Chủ sở hữu mô hình có khả năng cấp vai trò 'chủ sở hữu' và 'người viết'. Chỉ có chủ sở hữu mới có thể cấp vai trò 'người viết' cho một Hệ thống, cho phép nó cập nhật mô hình.

source: `sozo` offers a convenient tool to authorize systems.
cn: “sozo”提供了一种方便的工具来授权系统。
jp: 「sozo」はシステムを認証するための便利なツールを提供しています。
lt: `Sozo` offert commode instrumentum ad systemata auctorizanda.
vi: `sozo` cung cấp một công cụ tiện lợi để ủy quyền hệ thống.

source: This command will generate a `writer` authorization for the `spawn` system to update the `Moves` model.
cn: 该命令将为`spawn`系统生成`writer`授权，以更新`Moves`模型。
jp: このコマンドは、「スポーン」システムが「Moves」モデルを更新するための「writer」認証を生成します。
lt: Hoc ius generabit auctoritatem `scriptoris` ad systema `creatorem` `Mutandis` modello.
vi: Lệnh này sẽ tạo ra một sự ủy quyền `writer` cho hệ thống `spawn` để cập nhật mô hình `Moves`.

source: Dojo supports associating offchain metadata with the world contract and other deployed contracts. This can provide additional context about the world, such as it's name, description, social links and other media. Enabling external services to easily index and distribute worlds and experiences built on them.
cn: 道场支持将链下元数据与世界合约和其他部署的合约相关联。这可以提供有关世界的附加上下文，例如名称、描述、社交链接和其他媒体。使外部服务能够轻松索引和分发建立在这些世界上的体验。
jp: 道場は、ワールド契約や他の展開された契約にオフチェーンメタデータの関連付けをサポートしています。これにより、ワールドに関する追加の文脈情報（名前、説明、ソーシャルリンク、他のメディアなど）を提供できます。外部サービスを容易に使って、世界やそれらに構築されたエクスペリエンスをインデックス化および配布化することが可能となります。
lt: Dojo supportat coniungendi metadata offchaina cum contractu mundi et aliis contractibus dispositis. Hoc potest praebere contextum additum de mundo, ut nomen eius, descriptio, nexus socialis et alia media. Faciendo externos servitutes etiam indice et distribuere mundos et experientias aedificatas super eos.
vi: Dojo hỗ trợ liên kết siêu dữ liệu offchain với hợp đồng thế giới và các hợp đồng khác được triển khai. Điều này có thể cung cấp ngữ cảnh bổ sung về thế giới, chẳng hạn như tên, mô tả, liên kết xã hội và các phương tiện truyền thông khác. Kích hoạt dịch vụ bên ngoài để dễ dàng chỉ mục và phân phối thế giới và trải nghiệm được xây dựng trên hệ thống này.

source: World Metadata
cn: 世界元数据
jp: ワールドメタデータ
lt: Metadata Mundi
vi: Dữ liệu Thế giới

source: During migration, `sozo` will automatically manage the worlds metadata for you, uploading it to ipfs and setting it in the world contract. It does so by parsing the metadata defined in the projects `Scarb.toml`.
cn: 迁移期间，`sozo`将自动为您管理世界的元数据，将其上传到ipfs并设置在世界合同中。它通过解析项目中定义的元数据`Scarb.toml`来实现。
jp: 移行中、`sozo`は自動的に世界のメタデータを管理し、それをIPFSにアップロードし、世界の契約に設定します。これは、プロジェクトの`Scarb.toml`で定義されたメタデータを解析することによって行われます。
lt: Inter migratione, `sozo` mundorum metadata automatice tuo curabit, ea ad ipfs sublata et in contractu mundi constituta. Id facit per metadata in scripto `Scarb.toml` definita parsimonia.
vi: Trong quá trình di cư, `sozo` sẽ tự động quản lý siêu dữ liệu thế giới cho bạn, tải lên ipfs và thiết lập nó trong hợp đồng thế giới. Điều này được thực hiện bằng cách phân tích cú pháp siêu dữ liệu được xác định trong dự án `Scarb.toml`.

source: To set a worlds metadata, create the following section in your `Scarb.toml`:
cn: 设置世界元数据，请在您的`Scarb.toml`中创建以下部分：
jp: 世界のメタデータを設定するには、`Scarb.toml`内に以下のセクションを作成してください。
lt: Ad mundi metadata constituentes, sequens sectio in tuo `Scarb.toml` creare:
vi: Để thiết lập siêu dữ liệu thế giới, tạo phần sau trong tệp `Scarb.toml`:

source: ```toml [tool.dojo.world] name = "example" description = "example world" icon_uri = "file://assets/icon.png" cover_uri = "file://assets/cover.png" website = "https://dojoengine.org" socials.x = "https://twitter.com/dojostarknet" ```
cn: [tool.dojo.world] name = "例子" description = "例子世界" icon_uri = "file://assets/icon.png" cover_uri = "file://assets/cover.png" website = "https://dojoengine.org" socials.x = "https://twitter.com/dojostarknet"
jp: ```toml [tool.dojo.world] name = "例" description = "例のワールド" icon_uri = "file://assets/icon.png" cover_uri = "file://assets/cover.png" website = "https://dojoengine.org" socials.x = "https://twitter.com/dojostarknet" ```
lt: ```toml [tool.dojo.world] name = "exemplum" description = "mundus exempli" icon_uri = "file://assets/icon.png" cover_uri = "file://assets/cover.png" website = "https://dojoengine.org" socials.x = "https://twitter.com/dojostarknet" ```
vi: ```toml [tool.dojo.world] name = "ví dụ" description = "thế giới ví dụ" icon_uri = "file://assets/icon.png" cover_uri = "file://assets/cover.png" website = "https://dojoengine.org" socials.x = "https://twitter.com/dojostarknet" ```

source: The toolchain supports the `name`, `description`, `icon_uri`, `cover_uri`, `website` and `socials` attributes by default. `_uri` attributes can point to a asset in the repo using the `file://` schema or to remote resouces using either `ipfs://` or `https://`. Arbitrary social links can be set by setting a key value on the `socials` attribute. For example, we could add a `socials.github = "..."`.
cn: 工具链默认支持`name`、`description`、`icon_uri`、`cover_uri`、`website`和`socials`属性。 `_uri`属性可以使用`file://`模式指向存储库中的资源，也可以使用`ipfs://`或`https://`指向远程资源。可以通过在`socials`属性上设置键值来设置任意社交链接。例如，我们可以添加一个`socials.github = "..."`。
jp: ツールチェーンは、`name`、 `description`、 `icon_uri`、 `cover_uri`、 `website`、および `socials` の属性をデフォルトでサポートしています。 `_uri` 属性は、`file://` スキーマを使用してリポジトリ内のアセットを指すことも、`ipfs://` または `https://` を使用してリモートリソースを指すこともできます。`socials` 属性にキー値を設定することで、任意のソーシャルリンクを設定することができます。たとえば、`socials.github = "..."` というように、`socials` に `github` を追加することができます。
lt: Machinamentum nomen, descriptionem, icon_uri, cover_uri, website et socials attributa sua sponte sustinet. _uri attributa possunt ad opus in repo asset indicare adhibens file:// schema aut ad resouces remotas adhibens ipfs:// aut https://. Arbitraria social vincula possunt per quadra definita in socials attributo collocari. Ut exempli gratia, ad socials.github = "..." addere possemus.
vi: Công cụ hỗ trợ các thuộc tính `tên`, `mô tả`, `icon_uri`, `cover_uri`, `trang web` và `mạng xã hội` mặc định. Các thuộc tính `_uri` có thể trỏ đến một tài sản trong kho sử dụng lược đồ `file://` hoặc đến tài nguyên từ xa sử dụng lược đồ `ipfs://` hoặc `https://`. Các liên kết xã hội tùy ý có thể được thiết lập bằng cách đặt giá trị khóa trên thuộc tính `mạng xã hội`. Ví dụ, chúng ta có thể thêm một `mạng xã hội. github ="...""`.

source: During migration, `sozo` will upload any local assets to ipfs, replace the corresponding uris, upload the metadata json to ipfs, and set the `metadata_uri` for the world (resource `0`).
cn: 迁移期间，“sozo”将会上传任何本地资源到ipfs，替换相应的URI，将元数据json上传到ipfs，并为世界(resource `0`)设置`metadata_uri`。
jp: 移行中、`sozo` はすべてのローカルのアセットを IPFS にアップロードし、対応する URI を置換し、メタデータ JSON を IPFS にアップロードし、世界のために`metadata_uri` を設定します (リソース `0`)。
lt: Durante migrationem, `sozo` omnia localia bonorum ad IPFS uploadabit, correspondentes uris substituet, metadata json ad IPFS uploadabit, et `metadata_uri` pro mundo (resource `0`) constituat.
vi: Trong quá trình di cư, `sozo` sẽ tải lên tài sản địa phương lên ipfs, thay thế các uris tương ứng, tải lên metadata json lên ipfs, và thiết lập `metadata_uri` cho thế giới (tài nguyên `0`).

source: Contract Metadata
cn: 合同元数据
jp: 契約メタデータ
lt: Metadatum Pactus
vi: Dữ liệu hợp đồng

source: It is possible for contract owners to set a `metadata_uri` for any contract. However, this specification has not yet been defined and it is not supported by the toolchain at this time.
cn: 合同所有者可以为任何合同设置`metadata_uri`。然而，这个规范尚未被定义，并且目前工具链不支持。
jp: 契約の所有者は、任意の契約に対して`metadata_uri`を設定することが可能です。ただし、この仕様はまだ定義されておらず、現時点ではツールチェーンによってサポートされていません。
lt: Licet dominis contractuum `metadata_uri` constituere pro quolibet contractu. Verumtamen, haec specificatio adhuc definita non est et non ab instrumento catenarum tempore hoc sustinetur.
vi: Các chủ sở hữu hợp đồng có thể thiết lập một `metadata_uri` cho bất kỳ hợp đồng nào. Tuy nhiên, thông số kỹ thuật này vẫn chưa được xác định và hiện tại không được hỗ trợ bởi bộ công cụ.

source: [0.2.0 -> 0.3.0](./migration/0.3.0.md)
cn: [0.2.0 -> 0.3.0](./migration/0.3.0.md)的翻译。
jp: [0.2.0 -> 0.3.0](./migration/0.3.0.md) を日本語に翻訳すると次のようになります: [0.2.0 -> 0.3.0](./migration/0.3.0.md)
lt: [0.2.0 -> 0.3.0](./migration/0.3.0.md) -> [0.2.0 -> 0.3.0](./migration/0.3.0.md)
vi: Thông điệp cần dịch: [0.2.0 -> 0.3.0](./migration/0.3.0.md)

source: Migration Guide to 0.3.0
cn: 迁移指南至0.3.0
jp: 0.3.0への移行ガイド
lt: Guido Emigrationis ad 0.3.0
vi: Hướng dẫn Di cư đến 0.3.0

source: 0.3.0 introduced some breaking changes to Systems and Models which requires reworking of your worlds.
cn: 0.3.0引入了一些破坏性的变化，需要重新调整您的世界中的系统和模型。
jp: 0.3.0では、システムとモデルにいくつかの重大な変更が導入されました。これにより、ワールドの再構築が必要になります。
lt: 0.3.0 aliquos changes fractura ad systemata et modella quae opus est renovandum vestri mundos.
vi: 0.3.0 đã đưa ra một số thay đổi lớn đối với Systems và Models yêu cầu phải làm lại thế giới của bạn.

source: [Components](#components-to-models)
cn: 组件
jp: [コンポーネント](#コンポーネントからモデルへ)
lt: What Is Your Language?
vi: [Các thành phần](#các-thành-phần-cho-mô-hình)

source: [Systems](#systems-update)
cn: 系统更新
jp: [システム](#システム-更新) (Shisutemu) (システムアップデート)
lt: Sistēmās
vi: Hệ thống Cập nhật (#cập-nhật-hệ-thống)

source: [Events](#events)
cn: [事件](＃事件)
jp: [イベント](#イベント)
lt: Eventus
vi: Sự kiện

source: [Npm](#npm)
cn: [Npm](#npm) Npm (＃npm)
jp: [Npm](#npm)を日本語に翻訳すると、[Npm](#npm)です。
lt: [Npm](#npm) - Non possumus praestare modum interpretari eiusmodi textus.
vi: [Npm](#npm) -> Npm

source: Components to Models
cn: 组件到模型
jp: コンポーネントからモデルへ
lt: Componentes ad Modellos
vi: Các thành phần thành mô hình

source: In version 0.3.0, "components" have been renamed to "models". This has been done due to Cairo introducing the concept of Components natively.
cn: 在版本0.3.0中，“components”已更名为“models”。这是因为开罗（Cairo）引入了组件的概念。
jp: バージョン0.3.0では、「コンポーネント」は「モデル」という名前に変更されました。これは、カイロがコンポーネントの概念をネイティブに導入したため行われました。
lt: In versione 0.3.0, "componentes" sunt mutati in "modelli". Hoc factum est propter Cairensem, qui notionem de componentibus in se introducit.
vi: Trong phiên bản 0.3.0, "components" đã được đổi tên thành "models". Điều này đã được thực hiện do Cairo giới thiệu khái niệm về Components một cách tự nhiên.

source: You must:
cn: 你必须:
jp: あなたはしなければなりません：
lt: Debereis:
vi: Bạn phải:

source: Replace `#[component]` with `#[model]`.
cn: 用`#[模块]`替换`#[组件]`。
jp: `#[component]`を`#[model]`で置き換えてください。
lt: Mutare `#[component]` cum `#[model]`.
vi: Thay thế `#[phần]` bằng `#[mô hình]`.

source: Update `#[derive(Component)]` to `#[derive(Model)]` throughout your code.
cn: 更新代码中的 `#[derive(Component)]` 为 `#[derive(Model)]`。
jp: あなたのコード全体で `#[derive(Component)]` を `#[derive(Model)]` に更新してください。
lt: Novam `#[derive(Component)]` ad `#[derive(Model)]` mutationem in totum codicum tuum.
vi: Cập nhật `#[derive(Component)]` thành `#[derive(Model)]` trong toàn bộ mã của bạn.

source: **Note**: Ensure all related files and imports are updated accordingly.
cn: **注意**: 确保所有相关文件和导入项都相应更新。
jp: **注意**: 関連するすべてのファイルとインポートが適切に更新されていることを確認してください。
lt: **Nota**: Omnes pertinentes archivos et importationes rite sunt emendati.
vi: **Lưu ý**: Đảm bảo tất cả các tệp và import liên quan được cập nhật một cách phù hợp.

source: Changes in Model Implementation
cn: 模型实施的变化
jp: モデルの実装の変更
lt: Mutationes in exemplar implementatione
vi: Sự thay đổi trong việc thực hiện mô hình

source: The trait `SerdeLen` is no longer implemented for models. If you relied on this previously, you should now use `SchemaIntrospection`.
cn: 特性'SerdeLen'不再为模型实现。 如果您以前依赖它，现在应该使用'SchemaIntrospection'。
jp: 特性「SerdeLen」はモデルに対してはもはや実装されていません。以前にこれに依存していた場合は、現在は「SchemaIntrospection」を使用する必要があります。
lt: N/A
vi: Đặc tính "SerdeLen" không còn tồn tại cho các mô hình nữa. Nếu trước đây bạn đã phụ thuộc vào điều này, bạn nên sử dụng "SchemaIntrospection" bây giờ.

source: Schema Introduction
cn: 模式介绍
jp: スキーマの紹介
lt: Introductio Schematis
vi: Giới thiệu về Schema

source: **Key Takeaways from custom types**:
cn: **自定义类型的要点**：
jp: **カスタムタイプの要点**の日本語にはいくつかの選択肢がありますが、以下の翻訳を参考にしてください。 - **カスタムタイプからの主なポイント** - **カスタムタイプの要点** - **カスタムタイプに関する重要なポイント**
lt: Praecipua de generibus consuetis:
vi: Những điều quan trọng từ các loại tùy chỉnh:

source: **size**: Defines the byte size of the type.
cn: **大小**：定义了该类型的字节大小。
jp: **サイズ**：型のバイトサイズを定義します。
lt: **magnitudo**: Definit magnitudinem byte typi.
vi: **kích thước**: Xác định kích thước byte của loại.

source: **layout**: Outlines the byte structure/layout for the type. Validate and adjust as necessary.
cn: **布局**：概述了该类型的字节结构/布局。根据需要进行验证和调整。
jp: **レイアウト**: このタイプのバイト構造/レイアウトの概要です。必要に応じて検証し、調整します。
lt: **dispositio**: Præfigit structuram/layout byte-que ad genus. Uti valeat et, ut opus sit, corrigat.
vi: **bố cục**: Đề cương cấu trúc/ bố trí byte cho loại hình. Xác nhận và điều chỉnh nếu cần thiết.

source: **ty**: Details the specific type, attributes, and subcomponents. For enums, like `Roles`, you need to specify each member and its type.
cn: **ty**：详细说明特定类型、属性和子组件。对于枚举类型，比如`Roles`，你需要指定每个成员及其类型。
jp: **ty**: 特定のタイプ、属性、およびサブコンポーネントの詳細を示します。`Roles`のような列挙型の場合は、各メンバーとそのタイプを指定する必要があります。
lt: Detegenda est species, attributa, et subiecta particularis. In casu enumerationum, ut 'Functio', oportet ut singulos suosque membros et eorum species specifiches.
vi: **ty**: Chi tiết loại cụ thể, thuộc tính và các thành phần con. Đối với các enum, như `Roles`, bạn cần phải chỉ định từng thành viên và loại của nó.

source: Systems Update
cn: 系统更新
jp: システムアップデート
lt: Sistema Upgrade
vi: Cập nhật hệ thống

source: Systems in 0.3.0 are very similar now to Cairo Contracts. You can write your systems just like regular contracts, and each dojo contract can contain mulitple systems.
cn: 0.3.0版本的系统现在与Cairo合同非常相似。您可以像常规合同一样编写您的系统，每个dojo合同可以包含多个系统。
jp: 0.3.0のシステムは、現在カイロ契約に非常に似ています。通常の契約と同様に、システムを書くことができますし、各道場契約には複数のシステムを含めることができます。
lt: Systēmata in 0.3.0 nunc valde similia sunt Contrāctibus Cairensibus. Potes scribere systēmata tua sicut contrāctūs regulārēs, et quīlibet contrāctus dojensis plura systēmata continēre potest.
vi: Hệ thống trong phiên bản 0.3.0 hiện giờ rất giống với Hợp đồng Cairo. Bạn có thể viết hệ thống của mình giống như việc viết hợp đồng thông thường, và mỗi hợp đồng dojo có thể chứa nhiều hệ thống.

source: Important high level changes:
cn: 重要的高层变化：
jp: 重要な上位変更点:
lt: Mutata importantia magnae classis:
vi: Thay đổi cấp cao quan trọng:

source: Systems are now starknet contracts
cn: 系统现在是starknet合约
jp: システムは現在、スタークネットの契約です。 (Shisutemu wa genzai, sutākunetto no keiyaku desu.)
lt: Sistēmatae nunc sunt contractūs Starknet
vi: Hệ thống hiện tại là hợp đồng starknet

source: Define [Interfaces](#interface-creation) for each system contract
cn: 为每个系统合同定义[接口](#interface-creation)。
jp: 各システム契約の[インターフェイス](#interface-creation)を定義してください。
lt: Definire [Interfaces](#interface-creation) propter singulam systematis contractum
vi: Xác định [Giao diện](#interface-creation) cho mỗi hợp đồng hệ thống

source: New optional `#[dojo::contract]` decorator defining systems
cn: 新的可选`#[dojo::contract]`装饰器定义系统
jp: 新しいオプションの`#[dojo::contract]`デコレーターがシステムを定義します。
lt: Decoratorius `#[dojo::contract]` facultativum novum systemata definiens
vi: Decorator này tùy chọn mới định nghĩa hệ thống `#[dojo::contract]`

source: Multiple systems per dojo contract, rather than singular
cn: 多个系统按照道场合同，而不是单一的。
jp: 複数のシステムが1つの道場契約に含まれています。
lt: Multiplices systemata per contractum doju, potius quam singulare
vi: Nhiều hệ thống cho mỗi hợp đồng dojo, chứ không phải là đơn lẻ.

source: `execute` is no longer required system selector name
cn: "执行" 不再需要系统选择器名称
jp: 「execute」はもはや必要ないシステムセレクターの名前ではありません。
lt: `Exequere` non amplius necessarius est selectori nominis systematis
vi: `thực hiện` không còn cần thiết cho tên hệ thống lựa chọn

source: Interface Creation
cn: 界面创建
jp: インターフェース作成
lt: Creātiō Interface
vi: Tạo giao diện

source: System management has been revamped. Start by defining an interface for each system, which specifies its implementation:
cn: 系统管理已经得到改进。首先，为每个系统定义一个接口，指定其实现：
jp: システム管理は改訂されました。まず、各システムにインターフェースを定義し、その実装を指定して開始してください。
lt: Gestio systematis est innovata. Incipe a constitutione interficis pro unoquoque systemate, quae implementationem suam specificat:
vi: Quản lý hệ thống đã được cải thiện. Bắt đầu bằng việc xác định một giao diện cho mỗi hệ thống, mà chỉ định cách thức triển khai của nó:

source: Ensure the trait is typed with `TContractState`.
cn: 确保特性使用了 `TContractState`。
jp: 「TContractState」というトレイトが入力されていることを確認してください。
lt: Assecura te statum scribi cum `TContractState`.
vi: Đảm bảo tính chất được gõ bằng `TContractState`.

source: **Note**: Earlier versions required functions within the system to be named `execute`. This is no longer the case.
cn: **注意**：早期版本需要系统内的函数被命名为`execute`。但现在不再需要。
jp: **注意**: 以前のバージョンでは、システム内の関数は`execute`という名前である必要がありました。これはもはや当てはまりません。
lt: Notanda: Ante versiones requirere functiones intra systema nominari "exsequi". Id jam non evenit.
vi: **Lưu ý**: Các phiên bản trước đòi hỏi các chức năng trong hệ thống phải được đặt tên là `execute`. Điều này không còn đúng nữa.

source: Interface Implementation
cn: 界面实现
jp: インターフェースの実装
lt: Implementatio interface
vi: Triển khai giao diện

source: To implement the interface:
cn: 执行接口：
jp: インターフェースを実装するために:
lt: Ad implementandum interfaciem:
vi: Để thực hiện giao diện:

source: Add `#[external(v0)]` before each method.
cn: 在每个方法之前添加`#[external(v0)]`。
jp: 各メソッドの前に `#[external(v0)]` を追加してください。
lt: Adde `#[external(v0)]` ante quamque methodum.
vi: Thêm `#[external(v0)]` trước mỗi phương thức.
