Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: For the no implementation error, implement the PrintTrait to run `sozo test` successfully. For the not dropped error, add the Drop trait. Address other errors by adding derives or implementing them on a case-by-case basis.
cn: 针对没有执行错误，请实现PrintTrait以成功运行`sozo test`。针对未丢弃错误，请添加Drop trait。通过添加派生或根据情况逐个实现来解决其他错误。
jp: 実装エラーの場合は、PrintTraitを実装して`sozo test`を成功させてください。ドロップされないエラーの場合は、Dropトレイトを追加してください。他のエラーに対しては、デリバイスを追加するか、個別のケース毎に実装することによって対応してください。
lt: Pro errore nulla implementationis, PrintTrait implementa ad feliciter currere 'sozo test' . Ad errore non deposito, addere Drop trait. Alios errores adde mediante elderivatos aut eos casu definito implementando.
vi: Đối với lỗi không có triển khai, triển khai PrintTrait để chạy `sozo test` thành công. Đối với lỗi không được loại bỏ, thêm trait Drop. Đối phó với các lỗi khác bằng cách thêm derives hoặc triển khai chúng trên trường hợp cụ thể.

source: Add more models
cn: 增加更多的模型
jp: モデルを追加してください。
lt: Adde plures exemplaria
vi: Thêm mô hình nữa

source: Before you move on, add more models so we can use them in the next chapter when creating the action contract.
cn: 在继续之前，添加更多模型，这样我们可以在下一章创建行动合同时使用它们。
jp: 次に進む前に、さらにモデルを追加してください。次の章でアクション契約を作成する際に使用するためです。
lt: Antequam procedas, addere plures exemplaria ut ea in sequenti capite uti possimus cum actionem contractus creando.
vi: Trước khi bạn tiếp tục, thêm nhiều mẫu để chúng ta có thể sử dụng chúng trong chương tiếp theo khi tạo hợp đồng hành động.

source: Requirements
cn: 要求
jp: 要件 (ようけん)
lt: Exigentias
vi: Yêu cầu

source: `Color` enum with values White,Black & None
cn: 颜色枚举 白色，黑色和无色。
jp: `Color` 列挙型の値は White、Black、および None です。
lt: Enumeratio "Color" cum valoribus Albus, Nigellus & Nullus
vi: Enumerated (enum) `Màu sắc` với các giá trị Trắng, Đen & Không

source: `Game` model:
cn: “游戏”模型：
jp: 「ゲーム」モデル
lt: Modelus "Ludus":
vi: Mô hình `Game`:

source: `GameTurn` model:
cn: `游戏回合` 模型：
jp: `ゲームターン` モデル:
lt: Model "GameTurn":
vi: Mô hình `GameTurn`:

source: Run `sozo build` to see if your code compiles, we'll handle `test` implementiation in the subsequent chapters.
cn: 运行 `sozo build` 来查看你的代码是否编译通过，我们将在接下来的章节中处理 `test` 的实现。
jp: 「sozo build」と入力してコードがコンパイルされるか確認してください。`test`の実装は後の章で対応します。
lt: Curre `sozo aedificare` ut videas si coda tua conpilatur, nos `experimentum` in capitulis subsequente tractabimus.
vi: Chạy `sozo build` để xem liệu mã của bạn có biên dịch không, chúng tôi sẽ xử lý `test` trong các chương tiếp theo.

source: This tutorial is extracted from [here](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)
cn: 这个教程是从[这里](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)提取的。
jp: このチュートリアルは[ここ](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)から抜粋されました。
lt: Hic tutorial sumit e [illic](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)
vi: Hướng dẫn này được trích từ [đây](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)

source: /// game id, computed as follows pedersen_hash(player1_address, player2_address)
cn: 游戏ID，计算方式为 pedersen_hash(player1_address, player2_address)
jp: /// ゲームのIDは、以下のように計算されます: pedersen_hash(player1_address, player2_address)
lt: ludum id, computatum est ut sequitur pedersen_hash(ad locum primi ludicri, ad locum secundi ludicri)
vi: /// id trò chơi, tính như sau pedersen_hash(player1_address, player2_address)

source: //printing trait for debug
cn: //用于调试的打印特征
jp: //デバッグ用のプリント特性
lt: // characteristica imprimendi ad investigandum
vi: //đặc điểm in để gỡ lỗi

source: Congratulations! You've completed the basic setup for building an on-chain chess game 🎉
cn: 恭喜！您已经完成了构建链上国际象棋游戏的基本设置 🎉
jp: おめでとうございます！オンチェーンチェスゲームの基本セットアップを完成しました🎉
lt: Gratulor! Tu cōnfectisti fundamenta rudimentāria ad ōrdiendam lūdum scaccōrum in catēnā. 🎉
vi: Chúc mừng! Bạn đã hoàn thành cài đặt cơ bản để xây dựng một trò chơi cờ vua trên chuỗi 🎉

source: 1. Action_Contract
cn: 1. 行动_合同
jp: 1. 行動契約 (Kōdō Keiyaku)
lt: Actio_Contractus
vi: 1. Hợp_đồng_hành_động

source: This chapter will address implementing `action_contract.cairo`, which spawns the game & squares containing pieces and also allow players to move pieces.
cn: 本章将讨论实现`action_contract.cairo`，它将生成游戏和包含棋子的方块，同时允许玩家移动棋子。
jp: この章では、ゲームと駒を含むマスを生成し、プレーヤーが駒を移動できるようにするために `action_contract.cairo` の実装について取り上げます。
lt: Haec capita agemus actionem implementantia 'action_contract.cairo', quae ludum et quadratos continentes partes exorcitat et etiam lusores partes movere permittunt.
vi: Chương này sẽ giải quyết việc triển khai `action_contract.cairo`, mà tạo ra trò chơi & ô vuông chứa các mảnh và cũng cho phép người chơi di chuyển các mảnh.

source: What is `action_contract`?
cn: "什么是`action_contract`？"
jp: 「action_contract」とは何ですか？(あくしょん こんとらくと)
lt: Quid est "action_contract"?
vi: Quy định hành động là gì?

source: To play chess, you need, to start game, spawn the pieces, and move around the board. the `action_contract` has two dominant functions `spawn_game` function which spawns the game entity and places each piece in its proper position on the board and the `move` funtion which allows pieces to be moved around the board.
cn: 下棋，你需要开始游戏，生成棋子并在棋盘上移动。 “action_contract”有两个主要功能，“spawn_game”功能生成游戏实体并将每个棋子放在棋盘上的正确位置，“move”功能使棋子能够在棋盘上移动。
jp: チェスをするには、ゲームを始めるために駒を配置し、ボード上を移動する必要があります。 『action_contract』には、2つの主要な機能があります。『spawn_game』関数はゲームエンティティを生成し、各駒を適切な位置に配置する機能であり、『move』関数は駒をボード上で移動させる機能です。
lt: Ad ludendum scaccorum, opus est, ut ludum incipias, pecuniam generes, et per tabulam te circumferas. `action_contract` duae principales functiones habet, `spawn_game` functio quae ludum generat et quemlibet pecuniam in rectam suam positionem in tabula locat et `move` functio quae pecunias permittit per tabulam moveri.
vi: Để chơi cờ vua, bạn cần, để bắt đầu trò chơi, sinh ra các quân cờ, và di chuyển xung quanh bảng. `action_contract` có hai chức năng chiếm ưu thế `spawn_game` chức năng sinh ra thực thể trò chơi và đặt mỗi quân cờ vào vị trí phù hợp trên bảng và `move` chức năng cho phép di chuyển các quân cờ xung quanh bảng.

source: _Copy the unit tests below and paste them at the bottom of your `action_contract.cairo` file._
cn: 将以下单元测试复制并粘贴到您的`action_contract.cairo`文件的底部。
jp: 下の単体テストをコピーし、それらを`action_contract.cairo`ファイルの最後に貼り付けてください。
lt: Reite exempla interrogationum infra et eas in funiculo codicis tui `action_contract.cairo` ad inferiorem partem transcribas.
vi: Sao chép các bài kiểm tra đơn vị dưới đây và dán chúng vào cuối tập tin `action_contract.cairo` của bạn.

source: Write an interface for the `initiate_system` contract and define your functions. In this case, `move` and `spawn_game`
cn: 为“initiate_system”合同编写一个接口，并定义您的函数。 在这种情况下，“move”和“spawn_game”
jp: `initiate_system`コントラクトのためのインターフェースを作成し、関数を定義してください。この場合、`move`と `spawn_game`という関数を定義してください。
lt: Scribe interficiam pro 'initiate_system' pactum et definire suas functiones. In hoc casu, 'move' et 'spawn_game'
vi: Viết giao diện cho hợp đồng `initiate_system` và định nghĩa các chức năng của bạn. Trong trường hợp này, `move` và `spawn_game`.

source: ```shell #[starknet::interface] trait IActions<ContractState> { fn move( self: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //player game_id: felt252 ); fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress, ); } ```
cn: ```shell #[starknet::interface] trait IActions<ContractState> { fn move( self: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //玩家 game_id: felt252 ); fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress, ); } ```
jp: ```shell #[starknet::interface] trait IActions<ContractState> { fn move( self: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //player game_id: felt252 ); fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress, ); } ``` ```shell #[starknet::インタフェース] trait IActions<ContractState> { fn move( self: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //player game_id: felt252 ); fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress, ); } ```
lt: ```shell #[starknet::interface] trait IActions<ContractState> { fn move( self: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //ludens game_id: felt252 ); fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress, ); } ```
vi: ```shell #[starknet::interface] trait IActions<ContractState> { fn di_chuyen( self: @ContractState, vi_tri_hien_tai: (u32, u32), vi_tri_tiep_theo: (u32, u32), nguoi_goi: ContractAddress, //nguoi_choi id_game: felt252 ); fn tao_game( self: @ContractState, dia_chi_trang: ContractAddress, dia_chi_den: ContractAddress, ); } ```

source: Bring in required imports into the contract and initialize storage with the `world_dispatcher` in it like this :
cn: 将所需的导入项引入合同，并使用其中的`world_dispatcher`进行存储初始化，就像这样：
jp: 契約に必要なインポートを取り込み、それを含んだ`world_dispatcher`でストレージを初期化します。
lt: Affer in importationes requisitas in pactum et inchoa depositum cum 'mundi-dispositor' in ea taliter:
vi: Mang các phần nhập cần thiết vào hợp đồng và khởi tạo bộ nhớ với `world_dispatcher` trong đó như sau:

source: should be noted that `actions` is the contract name.
cn: 应该注意到“actions”是合同名称。
jp: 「actions」は契約名であることに注意が必要です。
lt: Notandum est "actiones" esse nomen contractus.
vi: Lưu ý rằng `actions` là tên hợp đồng.

source: Write a `spawn_game` function that accepts the `white address`, and `black address` as input and set necessary states using `set!(...)`.Implement the game entity, comprised of the `Game` model and `GameTurn` model we created in the `models.cairo` and Implement the square entities from a1 to h8 containing the correct `PieceType` in the `spawn_game` fn.
cn: 编写一个`spawn_game`函数，接受`白方地址`和`黑方地址`作为输入，并使用`set!(...)`来设置必要的状态。实现游戏实体，包括我们在`models.cairo`中创建的`Game`模型和`GameTurn`模型，并在`spawn_game`函数中实现包含正确`PieceType`的a1到h8的方块实体。
jp: `spawn_game`という名前の関数を作成し、入力として`white address`と`black address`を受け取り、`set!(...)`を使用して必要な状態を設定します。 また、`models.cairo`で作成した`Game`モデルと`GameTurn`モデルから構成されるゲームエンティティと、`spawn_game`関数内に正しい`PieceType`を持つa1からh8までのマスエンティティを実装してください。 Here is the translation in Japanese: ホワイトアドレスとブラックアドレスを入力として受け取り、`set!(...)`を使用して必要な状態を設定する`spawn_game`関数を作成しましょう。`models.cairo`で作成した`Game`モデルと`GameTurn`モデルからなるゲームエンティティと、`spawn_game`関数内に、a1からh8までの正しい`PieceType`を持つマスエンティティを実装してください。
lt: Scribite `spawn_game` functionem quod recipit `white address`, et `black address` ut input et statuum necessarium uti `set!(...)`. Implementate ludum entity, quae constat ex `Game` modelo et `GameTurn` modelo nos fecimus in `models.cairo` et Implementate quadratum entitates ab a1 ad h8 continens rectum `PieceType` in `spawn_game` fn.
vi: Viết một hàm `spawn_game` chấp nhận `địa chỉ trắng`, và `địa chỉ đen` làm đầu vào và thiết lập các trạng thái cần thiết bằng cách sử dụng `set!(...)`. Thực hiện thực thể trò chơi, bao gồm mô hình `Game` và mô hình `GameTurn` chúng ta đã tạo trong `models.cairo` và Thực hiện các thực thể ô vuông từ a1 đến h8 chứa `PieceType` chính xác trong hàm `spawn_game`.

source: ```shell #[external(v0)] impl PlayerActionsImpl of IActions<ContractState> { fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress ) { let world = self.world_dispatcher.read(); let game_id = pedersen::pedersen(white_address.into(), black_address.into()); set!( world, ( Game { game_id: game_id, winner: Color::None(()), white: white_address, black: black_address, }, GameTurn { game_id: game_id, turn: Color::White(()), }, ) ); set!(world, (Square { game_id: game_id, x: 0, y: 0, piece: PieceType::WhiteRook })); set!(world, (Square { game_id: game_id, x: 0, y: 1, piece: PieceType::WhitePawn })); set!(world, (Square { game_id: game_id, x: 1, y: 6, piece: PieceType::BlackPawn })); set!(world, (Square { game_id: game_id, x: 1, y: 0, piece: PieceType::WhiteKnight })); //the rest of the positions on the board goes here.... } ```
cn: #[外部（v0）] impl PlayerActionsImpl of IActions<ContractState> { fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress ) { let world = self.world_dispatcher.read(); let game_id = pedersen::pedersen(white_address.into(), black_address.into()); set!( world, ( Game { game_id: game_id, winner: Color::None(()), white: white_address, black: black_address, }, GameTurn { game_id: game_id, turn: Color::White(()), }, ) ); set!(world, (Square { game_id: game_id, x: 0, y: 0, piece: PieceType::WhiteRook })); set!(world, (Square { game_id: game_id, x: 0, y: 1, piece: PieceType::WhitePawn })); set!(world, (Square { game_id: game_id, x: 1, y: 6, piece: PieceType::BlackPawn })); set!(world, (Square { game_id: game_id, x: 1, y: 0, piece: PieceType::WhiteKnight })); //棋盘上的其余位置在这里.... } }
jp: #[外部(v0)] impl IActions<ContractState>のPlayerActionsImpl { fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress ) { let world = self.world_dispatcher.read(); let game_id = pedersen::pedersen(white_address.into(), black_address.into()); set!( world, ( Game { game_id: game_id, winner: Color::None(()), white: white_address, black: black_address, }, GameTurn { game_id: game_id, turn: Color::White(()), }, ) ); set!(world, (Square { game_id: game_id, x: 0, y: 0, piece: PieceType::WhiteRook })); set!(world, (Square { game_id: game_id, x: 0, y: 1, piece: PieceType::WhitePawn })); set!(world, (Square { game_id: game_id, x: 1, y: 6, piece: PieceType::BlackPawn })); set!(world, (Square { game_id: game_id, x: 1, y: 0, piece: PieceType::WhiteKnight })); //ボード上の残りの位置はここに入ります.... }
lt: ```shell #[externus(v0)] impetoPlayerActionsImpl of IActions<ContractusStatus> { fn nascor_ludus( ipse: @ContractusStatus, albus_adversarius_address: ContractusAdversariusAdfuerit, ater_adversarius_address: ContractusAdversariusAdfuerit ) { let mundus = ipse.world_dispatcher.lego(); let ludus_id = pedersen::pedersen(albus_adversarius_address.in(), ater_adversarius_address.in()); set!( mundus, ( Ludus { ludus_id: ludus_id, victor: Color::None(()), albus: albus_adversarius_address, ater: ater_adversarius_address, }, LudusVersa { ludus_id: ludus_id, versus: Color::Albus(()), }, ) ); set!(mundus, (Quadratum { ludus_id: ludus_id, x: 0, y: 0, pecunia: PecuniaTypus::AlbusRocus })); set!(mundus, (Quadratum { ludus_id: ludus_id, x: 0, y: 1, pecunia: PecuniaTypus::AlbusPedites })); set!(mundus, (Quadratum { ludus_id: ludus_id, x: 1, y: 6, pecunia: PecuniaTypus::AterPedites })); set!(mundus, (Quadratum { ludus_id: ludus_id, x: 1, y: 0, pecunia: PecuniaTypus::AlbusEquites })); //reliqui positiones in tabula hic eunt.... } ```
vi: ```shell #[external(v0)] impl PlayerActionsImpl of IActions<ContractState> { fn spawn_game( self: @ContractState, white_address: ContractAddress, black_address: ContractAddress ) { let world = self.world_dispatcher.read(); let game_id = pedersen::pedersen(white_address.into(), black_address.into()); set!( world, ( Game { game_id: game_id, winner: Color::None(()), white: white_address, black: black_address, }, GameTurn { game_id: game_id, turn: Color::White(()), }, ) ); set!(world, (Square { game_id: game_id, x: 0, y: 0, piece: PieceType::WhiteRook })); set!(world, (Square { game_id: game_id, x: 0, y: 1, piece: PieceType::WhitePawn })); set!(world, (Square { game_id: game_id, x: 1, y: 6, piece: PieceType::BlackPawn })); set!(world, (Square { game_id: game_id, x: 1, y: 0, piece: PieceType::WhiteKnight })); //phần còn lại của vị trí trên bảng được đặt ở đây.... } ```

source: Write a `move` function that accepts the `current position`, `next position`, `caller address`, and `game id`. The `move` function should look like this:
cn: 编写一个`move`函数，该函数接受`当前位置`，`下一个位置`，`调用者地址`和`游戏ID`。 `move`函数应该如下所示：
jp: 「現在位置」、「次の位置」、「呼び出し元のアドレス」、および「ゲームID」を受け入れる「move」関数を作成してください。この「move」関数は、次のようになるべきです： ``` def move(current_position, next_position, caller_address, game_id): # ここにコードを追加する pass ```
lt: Scribe `move` functionem quae accipiat `current position`, `next position`, `caller address`, et `game id`. Functionem `move` sic esse debet:
vi: Viết một hàm `move` nhận vào `vị trí hiện tại`, `vị trí tiếp theo`, `địa chỉ người gọi`, và `id trò chơi`. Hàm `move` nên có dạng như sau:

source: Run `sozo test` and pass all the tests.
cn: 运行`sozo测试`并通过所有测试。
jp: `sozoテスト`を実行し、全てのテストをパスしてください。
lt: Currite 'sozo test' et omnes probationes transite.
vi: Chạy `kiểm tra sozo` và vượt qua tất cả các bài kiểm tra.

source: Test Flow
cn: 测试流程
jp: テストフロー (Tesuto furō)
lt: Flumen probatio
vi: Luồng Kiểm tra

source: Spawn the test world (`spawn_test_world`) that imports the models in testing.
cn: 生成测试世界（`spawn_test_world`），导入测试中的模型。
jp: テスト用ワールド（`spawn_test_world`）を生成し、テスト用のモデルをインポートします。
lt: Genera mundum experimentalem (`spawn_test_world`) qui importat modulos in experimento.
vi: Sinh thế giới kiểm thử (`spawn_test_world`) mà nhập khẩu các mô hình trong quá trình kiểm thử.

source: deploy actions contract
cn: 部署行动合同
jp: アクション契約を展開する
lt: mittere actiones contractu
vi: Triển khai hợp đồng hành động

source: interact with `spawn_game` function in the `actions` contract by providing white and black player's wallet addresses as inputs.
cn: 与“actions”合同中的“spawn_game”函数进行交互，提供白色和黑色玩家的钱包地址作为输入。
jp: 「アクション」契約内の「spawn_game」関数とやりとりするために、白と黒のプレーヤーのウォレットアドレスを入力として提供してください。
vi: tương tác với hàm `spawn_game` trong hợp đồng `actions` bằng cách cung cấp địa chỉ ví của người chơi trắng và đen làm đầu vào.

source: Retrieve the game entity and piece entity created in `actions` contract.
cn: 检索在`actions`合同中创建的游戏实体和棋子实体。
jp: `actions` コントラクトで作成されたゲームエンティティとピースエンティティを取得してください。 (アクションズ コントラクトで さくせいされた ゲームエンティティ と ピースエンティティ を しゅとく してください。)
lt: Reperite ludum entitatem et entitatem partis creata in contractu `actiones`.
vi: Truy xuất thực thể trò chơi và thực thể quân cờ được tạo trong hợp đồng "actions".

source: Ensure the game has been correctly created.
cn: 确保游戏已经正确创建。
jp: ゲームが正しく作成されていることを確認してください。 (Gēmu ga tadashiku sakusei sarete iru koto o kakunin shite kudasai.)
lt: Verify ludum recte creatus esse.
vi: Đảm bảo rằng trò chơi đã được tạo ra đúng cách.

source: Verify that each `Piece` is located in the correct `Square`.
cn: 验证每个“棋子”是否位于正确的“方格”中。
jp: 各「ピース」が正しい「スクエア」に位置していることを確認してください。 (Kaku yaku na "pīsu" ga tadashī "sukuea" ni ichi shite iru koto o kakunin shite kudasai.)
lt: Confirma ut singulum `Fragmentum` sit in recto `Plano` locatum.
vi: Xác minh rằng mỗi `Piece` được đặt tại `Square` đúng đắn.

source: Unit Tests
cn: 单元测试
jp: ユニットテスト
lt: Examinae Unitatis
vi: Kiểm thử đơn vị

source: // models
cn: 模特 IMPORTANT: ONLY RETURN TRANSLATED TEXT AND NOTHING ELSE.
jp: // モデル
lt: modelli
vi: mô hình

source: //system calls
cn: 系统调用
jp: //システム コール
lt: Voces systematis
vi: Cuộc gọi hệ thống

source: //get game
cn: //获取游戏
jp: //ゲームを取得
lt: ludum captare
vi: trò chơi

source: //get a1 square
cn: 获取A1格子
jp: //a1のマスを取得する
lt: //obtener un cuadrado a1
vi: đến vị trí a1 trên bàn cờ

source: Need help?
cn: 需要帮助吗？
jp: 助けが必要ですか？ (Tasuke ga hitsuyou desu ka?)
lt: Opus est auxilio?
vi: Cần giúp đỡ không?

source: If you're stuck, don't hesitate to ask questions at the [Dojo community](https://discord.gg/akd2yfuRS3)!
cn: 如果你遇到困难, 不要犹豫在[道场社区](https://discord.gg/akd2yfuRS3)提问!
jp: もし困っているのであれば、[道場コミュニティ](https://discord.gg/akd2yfuRS3)で質問することをためらわないでください。
lt: Si haeres, noli dubitare rogare quaestiones in [Dojo community](https://discord.gg/akd2yfuRS3)!
vi: Nếu bạn bị mắc kẹt, đừng ngần ngại đặt câu hỏi tại cộng đồng [Dojo](https://discord.gg/akd2yfuRS3)!

source: You can find the [answer](https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo) for chapter 1 here.
cn: 你可以在这里找到第1章的答案：https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo
jp: こちらでは、[第1章の解答](https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo)を見つけることができます。 (Kochira dewa, dai 1-shō no kaitō o mitsukeru koto ga dekimasu.)
lt: Potes invenire [answer](https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo) for chapter 1 hic.
vi: Bạn có thể tìm thấy [câu trả lời](https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo) cho chương 1 ở đây.

source: 2. Check Legal Move
cn: 2. 检查合法移动
jp: 2. 合法な手を確認してください (Gōhō na te o kakunin shite kudasai)
lt: 2. Verificare motum legitimum
vi: 2. Kiểm tra Nước đi Hợp pháp

source: In this chapter, we'll make functions to check:
cn: 在这一章中，我们将创建用于检查的功能：
jp: この章では、確認するための関数を作成します。 (Kono shō de wa, kakunin suru tame no kankei o sakusei shimasu.)
lt: In hoc capitulo, faciemus functiones ad verificandum:
vi: Trong chương này, chúng ta sẽ tạo các hàm để kiểm tra:

source: If the next move goes outside the board.
cn: 如果下一步走出棋盘。
jp: もし次の手が盤外に出る場合。 (Moshi tsugi no te ga bangaide deru baai.)
lt: Si proximus motus extra tabulam exierit.
vi: Nếu nước đi tiếp theo ra khỏi bàn cờ.

source: If there's a piece that can be captured.
cn: 如果有一部分可以被捕获。
jp: 捕まえることができる駒がある場合。 (Torimaeru koto ga dekiru koma ga aru baai.)
lt: Si sit pecunia quae capiatur.
vi: Nếu có một mảnh có thể bị bắt.

source: If the next move is allowed for the type of piece.
cn: 如果下一步可以移动这种类型的棋子。
jp: もし次の手がその駒のタイプで許可されている場合。
lt: Si proximus motus licet generi tabulae.
vi: Nếu nước đi tiếp theo được phép cho loại quân cờ.

source: If the user can allow to make a action (based on the piece's color).
cn: 如果用户可以允许采取行动（基于图案的颜色）。
jp: ユーザーがアクションを許可できる（駒の色に基づいて）
lt: Si usor concedere potest facere actionem (ex piece's color).
vi: Nếu người dùng có thể cho phép thực hiện một hành động (dựa trên màu sắc của mảnh đó).

source: ... You can also add other custom check functions.
cn: ... 你也可以添加其他自定义检查功能。
jp: 他のカスタムチェック関数も追加することができます。 (Hoka no kasutamu chekku kansu mo tsuika suru koto ga dekimasu.)
lt: ... Tu quoque aliae functiones inspectio adiectas potes.
vi: Bạn cũng có thể thêm các hàm kiểm tra tùy chỉnh khác.

source: Make Check Functions
cn: 检查功能
jp: チェック機能を作成してください
lt: Facere verificare officia
vi: Chức năng Kiểm tra

source: We need to add some check functions in `actions` contract. These will help make sure the next move is allowed.
cn: 我们需要在`actions`合约中添加一些检查功能。这些将有助于确保下一步是允许的。
jp: 私たちは`actions`契約にいくつかのチェック機能を追加する必要があります。これにより、次の動きが許可されていることが確認できます。
lt: Opus est nobis addere aliquas functions inspectionis in contractu `actionum'. Haec adiuvabunt ad certificandum sequentem motum licere.
vi: Chúng ta cần thêm một số chức năng kiểm tra trong hợp đồng `actions`. Những chức năng này sẽ giúp đảm bảo rằng bước tiếp theo được phép.

source: See if player is moving the right piece
cn: 查看玩家是否移动了正确的棋子。
jp: そのプレーヤーが正しい駒を動かしているか確認してください。 (Sono purēyā ga tadashii koma o ugokashite iru ka kakunin shite kudasai.)
lt: Vide si ludens movet dexteram partem
vi: Kiểm tra xem người chơi có đang di chuyển quân cờ đúng không

source: See if the next spot is still on the board.
cn: 看看下一个位置是否仍在棋盘上。
jp: 次のスポットがまだボードにあるか確認してください。 (Tsugi no supotto ga mada bōdo ni aru ka kakunin shite kudasai.)
lt: Vide si locus sequens adhuc in tabula est.
vi: Hãy xem xem vị trí tiếp theo vẫn còn trên bảng không.

source: See if the person trying the move is doing it at the right time and with their piece color.
cn: 看看这个人试图移动的时机是否正确，并且是否使用了自己的棋子颜色。
jp: その人が試みている動きを正しいタイミングと駒の色で行っているか確認してください。 (Sono hito ga kokoromite iru ugoki o tadashii taimingu to koma no iro de okonatte iru ka kakunin shite kudasai.)
lt: Videat utrum persona conando motum faciat tempore recto et cum colore sui fragmenti.
vi: Xem xem người thử nghiệm đang thực hiện đúng thời gian và màu sắc của họ.

source: see if it's the right move
cn: 看看这是不是正确的举动。
jp: それが正しい選択肢かどうか確かめてください。
lt: "Vide si est rectum motum"
vi: xem xem đó có phải là động thái đúng đắn không
