Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: [Katana](/crates/katana/README.md) - Blazingly fast development network
cn: [刀](/crates/katana/README.md) - 极快的开发网络
jp: [刀](/crates/katana/README.md) - 高速開発ネットワーク
lt: [Katana](/crates/katana/README.md) - Rete velocitatis ardenti développementi
vi: [Katana](/crates/katana/README.md) - Mạng phát triển nhanh chóng chóng

source: Katana is a customizable StarkNet development network. It is blazingly fast and allows you to iterate on your game logic swiftly.
jp: Katanaはカスタマイズ可能なStarkNet開発ネットワークです。非常に高速で、ゲームロジックの迭代を迅速に行うことができます。
lt: Gladius est rete developmenti StarkNet mutabile. Id celerrime procedit et tibi permittit celeriter logica ludendi tuae renovare.

source: [Sozo CLI](/crates/sozo/README.md) - CLI Management Tool
cn: Sozo CLI（/crates/sozo/README.md）- CLI管理工具
jp: [Sozo CLI](/crates/sozo/README.md) - CLI管理ツール
lt: Sozo CLI - Instrumentum Administrationis CLI (crates/sozo/README.md)
vi: Sozo CLI - Công cụ quản lý dòng lệnh

source: Dojo worlds are poised to become some of the largest contracts. Sozo is a CLI tool that assists you in managing your worlds. It enables you to create, build, test, and deploy your worlds. Additionally, you can craft new components and systems and register them with your world.
cn: 道场世界有望成为一些最大的合同。 Sozo是一种CLI工具，可帮助您管理您的世界。 它使您能够创建、构建、测试和部署您的世界。 此外，您还可以制作新的组件和系统，并将它们注册到您的世界中。
jp: 道場の世界は、最も大規模な契約の一部になろうとしています。Sozoは、あなたの世界を管理するためのCLIツールであり、世界の作成、ビルド、テスト、展開をサポートします。さらに、新しいコンポーネントやシステムを作成し、世界に登録することもできます。
lt: Mundus Dojo parati erunt aliquot contractus maximorum. Sozo est instrumentum CLI quod auxiliatur tibi in administratione mundorum tuorum. Id tibi permittit mundos tuos creare, aedificare, probare, ac deponere. Verum etiam, potes componentes novos et systemata conficere et eos cum mundo tuo describere.
vi: Thế giới Dojo dự định sẽ trở thành một số hợp đồng lớn nhất. Sozo là một công cụ CLI giúp bạn quản lý thế giới của mình. Nó cho phép bạn tạo, xây dựng, kiểm tra và triển khai thế giới của mình. Ngoài ra, bạn cũng có thể tạo ra các thành phần và hệ thống mới và đăng ký chúng với thế giới của mình.

source: What Dojo doesn't give you
cn: 什么道场没有给予你
jp: どの道場（どうじょう）も与えてくれないものは何ですか？ (Dono dōjō mo ataete kurenai mono wa nan desu ka?)
lt: Quid Dojo tibi non dat
vi: Những gì Dojo không mang lại cho bạn

source: Visual graphics - While Dojo provides networking and contracts, it doesn't offer graphical engines. You can bring your graphics of choice! Integrate your Dojo world with Unreal, Godot, or Unity.
cn: 视觉图形 - 虽然道场提供了网络和合同，但它并不提供图形引擎。您可以带上您喜欢的图形！将您的道场世界与虚幻引擎，Godot或Unity集成。
jp: 視覚グラフィックス - ドージョはネットワーキングや契約を提供していますが、グラフィカルなエンジンは提供していません。ご希望のグラフィックスをお持ちください！ドージョの世界をアンリアル、ゴドー、またはユニティと統合してください。
lt: Graphica visibilia - Licet Dojo networking et contractus praestet, motores graphicos non offert. Tu potes tuas graphicas eligere! Coniunge tuum mundum Dojo cum Unreal, Godot, aut Unity.
vi: Đồ họa trực quan - Trong khi Dojo cung cấp mạng lưới và hợp đồng, nó không cung cấp động cơ đồ họa. Bạn có thể mang đồ họa theo sở thích của mình! Hòa nhập thế giới Dojo của bạn với Unreal, Godot, hoặc Unity.

source: Understanding the Dojo Workflow: A Visual Guide
cn: 理解道场工作流程：视觉指南
jp: 道場のワークフローの理解：ビジュアルガイド
lt: Intellectus Dojo Processus: Ductus Visibilis
vi: Hiện tại tôi không thể thực hiện yêu cầu của bạn.

source: To help you understand how `Sozo` works, we've created a visual guide that outlines the flow of execution using the powerful sozo tool and the katana development network.
cn: 帮助您了解`Sozo`工作原理，我们创建了一个视觉指南，概述了使用强大的Sozo工具和Katana开发网络的执行流程。
jp: 「Sozo」の仕組みを理解していただくために、強力なSozoツールとカタナ開発ネットワークを使用して実行の流れを示したビジュアルガイドを作成しました。
lt: Ad adiuuandum te intellegere `Sozo` operatur, creauimus ductum visualem qui explicat cursus executionis utens potentem instrumentum sozo et retiaculum katanae progressus.
vi: Để giúp bạn hiểu cách `Sozo` hoạt động, chúng tôi đã tạo một hướng dẫn trực quan mô tả quy trình thực hiện sử dụng công cụ mạnh mẽ Sozo và mạng lưới phát triển katana.

source: This visual representation will help you grasp the fundamental steps of working with Dojo, guiding you through the process of creating and managing your on-chain games.
cn: 这种视觉表达将帮助您掌握使用道场的基本步骤，指导您完成创建和管理您的链上游戏的过程。
jp: このビジュアル表現は、Dojoを使った作業の基本的な手順を理解するのに役立ちます。オンチェーンゲームの作成と管理のプロセスを案内します。
lt: Hoc repraesentatio visiva tuae adiuvabit comprehendere gradus fundamentales in labore Dojo, te ducens per processum creandi et administrandi ludos in catena tua.
vi: Representative Hình ảnh này sẽ giúp bạn hiểu được các bước cơ bản khi làm việc với Dojo, chỉ dẫn bạn qua quá trình tạo ra và quản lý trò chơi trên chuỗi của bạn.

source: ![Dojo Sozo Workflow](../images/dojo-sozo-workflow.jpg)
cn: 道场 Sozo 工作流
jp: ![道場ソゾワークフロー](../images/dojo-sozo-workflow.jpg)
lt: Nulla est haec transtuliendum in hoc casu.
vi: Thông điệp cần dịch: ![Dojo Sozo Workflow](../images/dojo-sozo-workflow.jpg)

source: Autonomous Worlds
cn: 自主世界
jp: 自律世界 (Jiritsu sekai)
lt: Mundos Autonomi
vi: Thế giới tự trị

source: "Autonomous worlds represent persistent, permissionless, and decentralized open environments that users can freely interact with and contribute to."
cn: 自治世界代表着持久的、无需许可的和去中心化的开放环境，用户可以自由地与之交互并做出贡献。
jp: 自律的な世界は、ユーザーが自由に相互作用し、貢献できる永続的で許可基盤のない分散化されたオープン環境を表します。
lt: "Mundi autonomi significant persistentiam, permissum, et decentralizatum apertum ad quod usores libere et contribuere possint."
vi: "Thế giới tự trị đại diện cho môi trường mở liên tục, không cần phép cả và phi tập trung mà người dùng có thể tương tác và đóng góp tự do."

source: The precise definition of Autonomous Worlds (AWs) remains somewhat elusive, as it is more of an abstract concept that has yet to be fully crystallized. Lattice first [introduced](https://0xparc.org/blog/autonomous-worlds) the terminology in 2022, but the notion of open worlds operating on the blockchain has been around for a while. The abstraction introduced by MUD served as a catalyst for the market to recognize the potential of these worlds.
cn: Autonomous Worlds (AWs)的准确定义仍然有些难以捉摸，因为它更多的是一个尚未完全凝固的抽象概念。Lattice在2022年首次引入了这个术语，但基于区块链的开放世界的概念已经存在一段时间了。MUD引入的抽象概念成为市场认识到这些世界潜力的催化剂。
jp: 自律世界（AWs）の正確な定義は、完全に明確でないままであり、まだ完全に結晶化されていないというよりも、抽象的な概念です。Latticeは2022年に最初にこの用語を[導入しました](https://0xparc.org/blog/autonomous-worlds)が、ブロックチェーン上で動作するオープンワールドの概念は以前から存在していました。MUDによって導入された抽象化は、市場がこれらの世界のポテンシャルを認識するきっかけとなりました。
lt: The precise definition of Autonomous Worlds (AWs) remains somewhat elusive, as it is more of an abstract concept that has yet to be fully crystallized. Lattice first introduced the terminology in 2022, but the notion of open worlds operating on the blockchain has been around for a while. The abstraction introduced by MUD served as a catalyst for the market to recognize the potential of these worlds.
vi: Định nghĩa chính xác về Thế giới Tự trị (AWs) vẫn còn mơ hồ một chút, vì nó là một khái niệm trừu tượng hơn và chưa hoàn toàn tinh chế. Lattice đầu tiên đã giới thiệu thuật ngữ vào năm 2022, nhưng ý niệm về thế giới mở hoạt động trên blockchain đã tồn tại từ lâu. Sự trừu tượng được giới thiệu bởi MUD đã làm xúc tác cho thị trường nhận ra tiềm năng của những thế giới này.

source: Autonomous Worlds share notable similarities with blockchains in their fundamental nature. Once established, they persist, maintaining their state throughout the lifespan of the chain. Players can join or leave, and developers can expand these worlds by deploying features in a permissionless manner, much like how contracts are added to a chain. While there is no universally accepted definition for an Autonomous World, we believe that a game must possess at least the following two essential features to be considered as such:
cn: 自主世界在其基本本质上与区块链有着显著的相似性。一旦建立，它们就会持续存在，维持其状态直到链的寿命结束。玩家可以加入或离开，开发人员可以以无需许可的方式通过部署功能来扩展这些世界，就像合同被添加到链中一样。虽然对于自主世界没有普遍接受的定义，但我们认为游戏必须至少具备以下两个基本特征才能被视为自主世界：
jp: 自律的な世界は、その根本的な性質においてブロックチェーンと顕著な類似点を持っています。一度確立されると、それらは維持され、チェーンの寿命を通じて状態を保ちます。プレイヤーは参加したり離脱したりすることができ、開発者は許可なく特徴を展開することでこれらの世界を拡張することができます。契約がチェーンに追加されるのと同様です。自律的な世界の一般的に認められた定義は存在しませんが、我々は少なくとも以下の2つの必須の特徴を持つことがあるゲームを自律的な世界と考えます。
lt: Mundi autonoma similitudines notabiles cum catenis fundamentis communicant. Quondam constituti, perseverant, suum statum servantes per totam vitam catenae. Lusores possunt accedere aut abire, et auctores possunt ampliare hos mundos implementando characteristica in ratione permissionis, multum sicut contractus catenae adduntur. Cum non sit definitio universim recepta pro Mundo Autonomo, credimus ludum oportere saltem habere sequentes duos characteres essentiales ut sic consideretur:
vi: Thế giới tự trị có những điểm tương đồng đáng chú ý với các chuỗi khối trong bản chất cơ bản của chúng. Một khi được thành lập, chúng tồn tại và duy trì trạng thái của mình suốt quãng đời của chuỗi. Người chơi có thể tham gia hoặc rời đi, và nhà phát triển có thể mở rộng thế giới này bằng cách triển khai các tính năng một cách không cần sự cho phép, giống như cách mà các hợp đồng được thêm vào một chuỗi. Mặc dù không có định nghĩa được chấp nhận rộng rãi cho một Thế giới Tự trị, chúng tôi tin rằng một trò chơi phải có ít nhất hai tính năng cần thiết sau đây để được coi là như vậy:

source: Decentralized data availability layer: While the state execution may reside on a centralized layer, it is crucial that the state can be reconstructed if the execution layer ceases to exist. Rollups offer a solution, providing increased capacity execution layers while ensuring data is permanently settled on Ethereum. This guarantees the world's perpetual persistence.
cn: 分散式数据可用性层：虽然状态执行可能驻留在集中层上，但如果执行层停止存在，重建状态是至关重要的。Rollups提供了一个解决方案，提供了增加容量的执行层，同时确保数据永久地安置在以太坊上。这确保了世界的永久持久性。
jp: 分散化されたデータの利用可能性レイヤー：状態の実行は中央化されたレイヤーに存在するかもしれませんが、実行レイヤーが存在しなくなった場合でも、状態を再構築できることが重要です。ロールアップは解決策を提供し、容量の増加した実行レイヤーを提供しながら、データが永久にEthereumに確定的に保存されることを保証します。これにより、世界の永続性が保証されます。
lt: Stratum disponibilis decentralisatus datarum: Dum executio status potest commorari in strato centrali, cruciale est ut status possit restaurari si stratum executivum desinat esse. Roll-up solutiones offerunt, plus capacitates executionis stratis offerentes data permanenter constituta in Ethereum. Hoc garantit perpetuam persistence mundi.
vi: Lớp sẵn sàng dữ liệu phi tập trung: Trong khi việc thực hiện trạng thái có thể tồn tại trên một lớp tập trung, điều quan trọng là trạng thái có thể được tái tạo nếu lớp thực hiện ngừng tồn tại. Rollups cung cấp một giải pháp, cung cấp các lớp thực hiện dung lượng tăng lên, đồng thời đảm bảo dữ liệu được giải quyết vĩnh viễn trên Ethereum. Điều này đảm bảo sự tồn tại vĩnh cửu của thế giới.

source: Permissionless entry point for expanding the world: The World contract must be capable of accepting new systems and components without requiring permission. While this doesn't imply that every component and system will be utilized, they must adhere to this pattern, ensuring open and unrestricted access for potential enhancements.
cn: 无需许可的扩展世界的入口点：世界合同必须能够接受新的系统和组件，而不需要许可。虽然这并不意味着每个组件和系统都会被使用，但它们必须遵循这种模式，确保潜在增强的开放和无限制的访问。
jp: 拡大するための許可なしのエントリーポイント：ワールド契約は、許可を必要とせずに新しいシステムやコンポーネントを受け入れることができる必要があります。これは、すべてのコンポーネントやシステムが利用されることを意味するものではありませんが、潜在的な拡張性に対してオープンで制限のないアクセスを確保するためにこのパターンに従う必要があります。
lt: Ingressus sine licentia ad mundum expandendum: Mundum contractus capax esse debet admissa novarum systematum ac componentum absque licentia postulante. Quamquam hoc non implicant omne componentum ac systema adhibebitur, debeant hoc sequi normam, ex certificando accessum apertum et non prohibentem ad augendam potentiam.
vi: Điểm nhập không cần sự cho phép để mở rộng thế giới: Hợp đồng Thế giới phải có khả năng chấp nhận các hệ thống và thành phần mới mà không cần sự cho phép. Mặc dù điều này không ngụ ý rằng mọi thành phần và hệ thống sẽ được sử dụng, chúng phải tuân theo mô hình này, đảm bảo quyền truy cập mở và không bị hạn chế cho các cải tiến tiềm năng.

source: We're firm believers in the potential for Autonomous Worlds to catalyze the exploration of novel forms in the medium provided by zk proofs and blockchain technology. This is not only about games, but also about new forms of artwork, coordination, fun, emerging from tinkering and radical innovation, eventually questioning the very notion of "play" in this brave new decentralized and trustless world.
cn: 我们坚信自主世界有潜力催化zk证明和区块链技术提供的媒介中的新形式的探索。这不仅仅是关于游戏，还涉及到新形式的艺术作品、协作、乐趣，这些都源自于小玩和激进的创新，最终质疑了这个勇敢新的去中心化和无信任的世界中“游戏”的概念。
jp: 私たちは、自律ワールドがzkプルーフとブロックチェーン技術によって提供されるメディアを通じて、新しい形態の探求を触発する可能性を信じています。これは単にゲームに関することだけでなく、実験や根本的な革新から生まれる新しい芸術形式や協調の形態、楽しみについても問い直す、この勇敢な新しい分散化された信頼ない世界における「遊び」という概念についても究極的に疑問を投げかけるということです。
lt: Nos tenaces credentes in potentiam Mundos Autonomous ad explorandum novas formas in medio provido per zk argumenta et technologiam blockchain. Hoc non solum de ludis est, sed etiam de novis formis artis, coordinations, oblectationis, emergentibus ex conatu et innovatione radicali, interrogantes demum ipsum notionem "ludi" in hoc novo mundo decentralizato et sine fide.
vi: Chúng tôi là những người tin tưởng vững chắc vào tiềm năng của Thế giới Tự trị để kích thích sự khám phá của các hình thức mới trong phương tiện được cung cấp bởi chứng minh zk và công nghệ blockchain. Điều này không chỉ liên quan đến trò chơi, mà còn liên quan đến các hình thức nghệ thuật mới, phối hợp, vui vẻ, nổi lên từ các tìm hiểu và đổi mới mạnh mẽ, cuối cùng là đặt câu hỏi về khái niệm "chơi" trong thế giới phân quyền và không tin cậy này.

source: Homework
cn: 作业
jp: 宿題
lt: Opus domi
vi: bài tập về nhà

source: [Wired - Autonomous Worlds Primer](https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/)
cn: 《连线》- 自主世界指南 https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/
jp: [ワイヤード - 自律ワールド入門](https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/)
lt: https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/ (The translated text will appear in Latin)
vi: Wired - Sơ bộ về Thế giới Tự trị (https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/)

source: [0xParc - Autonomous Worlds (Part 1)](https://0xparc.org/blog/autonomous-worlds)
cn: [0xParc - 自治世界（第1部分）](https://0xparc.org/blog/autonomous-worlds)
jp: [0xParc - 自律世界（パート1）](https://0xparc.org/blog/autonomous-worlds)
lt: Nuntius ad vertendum: [0xParc - Mundi Autonomous (Part 1)](https://0xparc.org/blog/autonomous-worlds)
vi: [0xParc - Các Thế Giới Tự Trị (Phần 1)](https://0xparc.org/blog/autonomous-worlds)

source: [Gubsheep - The Strongest Crypto Gaming Thesis](https://gubsheep.substack.com/p/the-strongest-crypto-gaming-thesis)
cn: [gubsheep-最强加密游戏论文](https://gubsheep.substack.com/p/the-strongest-crypto-gaming-thesis)
jp: [グブシープ - 最強の暗号ゲームのテーゼ](https://gubsheep.substack.com/p/the-strongest-crypto-gaming-thesis)
lt: Gubsheep - Fortissima crypto ludorum thesis
vi: [Gubsheep - Luận Văn Về Trò Chơi Crypto Mạnh Nhất](https://gubsheep.substack.com/p/the-strongest-crypto-gaming-thesis)

source: [Lattice - MUD: An engine for Autonomous Worlds](https://lattice.xyz/blog/mud-an-engine-for-autonomous-worlds)
cn: [Lattice - MUD: 一个自主世界的引擎](https://lattice.xyz/blog/mud-an-engine-for-autonomous-worlds)
jp: [ラティス - MUD: 自律世界のためのエンジン](https://lattice.xyz/blog/mud-an-engine-for-autonomous-worlds)
lt: Lattice - LUTUM: Motor pro mundis autonomis
vi: Lưới - MUD: Một động cơ cho Thế giới Tự trị

source: [Guiltygyoza - Game 2.0](https://www.guiltygyoza.xyz/2022/07/game2)
cn: [有罪的饺子 - 游戏2.0](https://www.guiltygyoza.xyz/2022/07/game2)
jp: [ギルティギョーザ - ゲーム2.0](https://www.guiltygyoza.xyz/2022/07/game2)
lt: Culpabilis Gyozam - Ludus 2.0
vi: Guiltygyoza - Game 2.0

source: [Guiltygyoza - Composable Engineering](https://www.guiltygyoza.xyz/2023/05/composable-engineering)
cn: [Guiltygyoza - 可组合工程](https://www.guiltygyoza.xyz/2023/05/composable-engineering)
jp: [ギルティギョーザ - コンポーザブルエンジニアリング](https://www.guiltygyoza.xyz/2023/05/composable-engineering)
lt: Ingenii Componibilis - Engineering (https://www.guiltygyoza.xyz/2023/05/composable-engineering)
vi: Guiltygyoza - Kỹ sư có thể phân chia - https://www.guiltygyoza.xyz/2023/05/composable-engineering

source: [Jay Springett - Wind-up Worlds](https://www.thejaymo.net/2022/05/06/wind-up-worlds/)
cn: 杰伊·斯普林盖特-发条世界
jp: [ジェイ・スプリンゲット - Wind-up Worlds](https://www.thejaymo.net/2022/05/06/wind-up-worlds/)
lt: This is a URL and it cannot be translated into Latin.
vi: Jay Springett - Những thế giới tự quay

source: [Are.na collection on Autonomous Worlds](https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)
cn: [关于自主世界的Are.na收藏](https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)
jp: [自律世界に関するAre.naコレクション](https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)
lt: Collectio in Mundos Autonomous in Are.na: (https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)
vi: Bộ sưu tập Are.na về Thế giới Tự trị (https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)

source: Provable games
cn: 可证明的游戏
jp: 証明可能なゲーム (Shōmei kanōna gēmu)
lt: Ludus probabiles
vi: Trò chơi có thể chứng minh

source: Provable games demand [zero-knowledge](https://ethereum.org/en/zero-knowledge-proofs/) properties for efficient scaling and verification of computations. [Cairo](https://book.starknet.io/ch01-00-getting-started.html) addresses this need by providing a generalized language, eliminating the complexity of creating circuits to incorporate [SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/).
cn: 可证明的游戏需要零知识的特性，以实现计算的有效扩展和验证。Cairo通过提供通用语言来满足这一需求，消除了创建电路以整合SNARKs的复杂性。
jp: 証明可能なゲームは、計算の効率的なスケーリングと検証において[ゼロ知識](https://ethereum.org/en/zero-knowledge-proofs/)の特性を要求します。[Cairo](https://book.starknet.io/ch01-00-getting-started.html)は、[SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/)を組み込むための回路の作成の複雑さを排除することで、このニーズに対応しています。
lt: Ludis probabilis postulat proprietates [scientiam nullam](https://ethereum.org/en/zero-knowledge-proofs/) ad efficientem augmentum et verificationem computationum. [Cairo](https://book.starknet.io/ch01-00-getting-started.html) hanc necessitatem complectendo linguam generalis offert, eliminans complexitatem circuitorum creandi [SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/).
vi: Các trò chơi có thể chứng minh yêu cầu tính chất không chứng minh cho việc mở rộng hiệu quả và xác minh của tính toán. Cairo giải quyết nhu cầu này bằng cách cung cấp một ngôn ngữ tổng quát, loại bỏ sự phức tạp trong việc tạo ra mạch để tích hợp SNARKs.

source: **You can simply program in Cairo and your applications become automatically provable**.
cn: 您可以在开罗简单编程，您的应用程序会自动变得可验证。
jp: あなたはカイロで簡単にプログラムすることができ、アプリケーションは自動的に証明可能になります。
lt: Potes simple in Cairo programmare et tuae applicationes automatice demonstrabiles fiunt.
vi: Bạn có thể đơn giản hóa việc lập trình ở Cairo và ứng dụng của bạn sẽ tự động trở nên có thể chứng minh.

source: Moreover, you can deploy your programs on the [Cairo Virtual Machine](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), which is compatible with Starknet's Layer 2, Starknet appchains, and even in-browser through WebAssembly (WASM)! Dojo aims to supply straightforward ZK primitives to fuel your game development.
cn: 此外，您可以在[开罗虚拟机](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f)（CVM）上部署您的程序，该虚拟机兼容Starknet的第2层、Starknet应用链，甚至可以通过WebAssembly（WASM）在浏览器中运行！道场旨在提供简单的ZK基元，以推动您的游戏开发。
jp: さらに、[Cairo Virtual Machine](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f)（CVM）上でプログラムを展開することもできます。これはStarknetのレイヤー2やStarknetアプリチェーン、さらにはWebAssembly（WASM）を通じてブラウザ上でも互換性があります！ Dojoは、ゲーム開発を活性化するために直感的なZKプリミティブを提供することを目指しています。
lt: Deinde, potes tuos programas immittere in [Cairo Virtual Machine](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), quae apta est cum Starknet's Layer 2, Starknet appchains, et etiam in-browser per WebAssembly (WASM)! Dojo destinatur ad suppeditare primordia ZK aperta ad incitandum progressionem tuam ludendi.
vi: Hơn nữa, bạn có thể triển khai chương trình của mình trên [Máy ảo Cairo](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), mà tương thích với Layer 2 của Starknet, appchains của Starknet, và thậm chí còn trên trình duyệt thông qua WebAssembly (WASM)! Dojo nhằm cung cấp các nguyên tắc ZK đơn giản để thúc đẩy việc phát triển trò chơi của bạn.

source: For more information about Starknet, Cairo and its tech stack, check out the [Starknet & Cairo book](https://book.starknet.io/).
cn: 有关Starknet、Cairo及其技术架构的更多信息，请查看《Starknet & Cairo 书》(https://book.starknet.io/)。
jp: Starknet、Cairo、およびそのテックスタックに関する詳細情報については、[Starknet＆Cairoの書籍](https://book.starknet.io/)をご覧ください。
lt: Ad plures inscriptionem de Starknet, Cairo, et eius technicam strue, inspicite [librum Starknet & Cairo](https://book.starknet.io/).
vi: Để biết thêm thông tin về Starknet, Cairo và ngăn xếp công nghệ của họ, hãy kiểm tra [sách Starknet & Cairo](https://book.starknet.io/).

source: Cairo
cn: 开罗
jp: カイロ
lt: Urbs Cairensis
vi: Cairo thành phố của Ai Cập

source: Cairo is an open-source, Turing-complete smart contract language developed by Starkware, designed to power the Validity Rollup Starknet. The language enables highly expressive and verifiable computation, making it well-suited for building scalable and secure applications, including decentralized finance (DeFi) projects.
cn: 开罗是由Starkware开发的开源图灵完备的智能合约语言，旨在驱动有效性Rollup Starknet。该语言能够实现高度表达和可验证的计算，使其非常适合构建可扩展和安全的应用程序，包括去中心化金融（DeFi）项目。
jp: Cairoは、Validitiy Rollup StarknetをパワーとするためにStarkwareによって開発されたオープンソースのチューリング完全なスマートコントラクト言語です。この言語は、高度に表現力豊かで検証可能な計算を可能にし、スケーラブルで安全なアプリケーション（デセントラルファイナンス（DeFi）プロジェクトを含む）の構築に適しています。
lt: Cairo est lingua contractus intellegens aperta, Turing-completum, ab Starkware elabore, ad Validity Rollup Starknet movendum. Haec lingua computationes valde expressivas ac verificabiles admittit, ad applicatones ad auctum et tuta struendas apta, inter quas negotia financia decentralia (DeFi) continentur.
vi: Cairo là một ngôn ngữ hợp đồng thông minh mã nguồn mở, đầy đủ tính đa dạng turing được phát triển bởi Starkware, được thiết kế để cung cấp sức mạnh cho mạng lưới Starknet Validity Rollup. Ngôn ngữ này cho phép tính toán có tính biểu cảm cao và có thể xác minh, làm cho nó phù hợp cho việc xây dựng các ứng dụng có khả năng mở rộng và an toàn, bao gồm các dự án tài chính phi tập trung (DeFi).

source: Dojo builds on Cairo to create a robust framework for developing Autonomous Worlds (AWs). By leveraging the capabilities of Cairo, Dojo aims to streamline the development process, improve maintainability, and enhance the performance of AWs.
cn: Dojo基于开罗构建了一个强大的框架，用于开发自治世界（AWs）。通过利用开罗的能力，Dojo旨在简化开发流程，提高可维护性，并增强AWs的性能。
jp: 道場はカイロを基にして、自律世界（AWs）の開発のための堅牢なフレームワークを構築します。道場はカイロの機能を活用することで、開発プロセスを効率化し、保守性を向上させ、AWsのパフォーマンスを向上させることを目指しています。
lt: Dojo superstructura Caeropolim ut robustum ad struendas Mundos Autonomous (AWs) condatur. Vertendo potentiam Caeropolis, Dojo prosequitur ad deducendum processum progressus, meliorandam custodiam, et auget ad peritiam AWs.
vi: Dojo được xây dựng trên nền tảng Cairo để tạo ra một khung công việc mạnh mẽ cho việc phát triển Thế giới Tự trị (AWs). Bằng cách tận dụng khả năng của Cairo, Dojo nhằm mục tiêu tối ưu hóa quá trình phát triển, cải thiện tính bảo trì và nâng cao hiệu suất của AWs.
