Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: Then, copy the account address and the private key from the first account into the `Scarb.toml` file and replace the existing ones as follows:
cn: 然后，将第一个账户的账户地址和私钥复制到`Scarb.toml`文件中，并替换现有的内容如下：
jp: 次に、最初のアカウントからアカウントアドレスと秘密鍵を `Scarb.toml` ファイルにコピーし、以下のように既存のものを置き換えてください。
lt: Deinde, inscribe domicilium rationis et clavem privatum e primo ratione in pergamena `Scarb.toml` et muta as existentis ita:
vi: Sau đó, sao chép địa chỉ tài khoản và khóa bí mật từ tài khoản đầu tiên vào tệp `Scarb.toml` và thay thế những thông tin hiện có như sau:

source: ```toml account_address = "YOUR_NEW_ACCOUNT_ADDRESS" private_key = "YOUR_NEW_PRIVATE_KEY" ```
cn: 账户地址 = "您的新账户地址" 私钥 = "您的新私钥"
jp: ```toml account_address = "あなたの新しいアカウントアドレス" private_key = "あなたの新しいプライベートキー" ```
lt: ```latin adressem rationis = "ADRESSE_NOVA_RATIONIS_TUAE" clavis_privata = "CLAVIS_PRIVATA_NOVA_TUA" ```
vi: địa chỉ tài khoản = "ĐỊA CHỈ TÀI KHOẢN MỚI CỦA BẠN" khóa riêng tư = "KHÓA RIÊNG TƯ MỚI CỦA BẠN"

source: Note: For each new Katana slot, a different account seed is used, making all the accounts unique!
cn: 注意：对于每个新的Katana插槽，使用不同的账户种子，使所有账户都是唯一的！
jp: 注意：新しい刀のスロットごとに、異なるアカウントのシードが使用されるため、すべてのアカウントはユニークです！
lt: Nota: Propter singulum novum foramen Katana, diversa semina rationis utuntur, factum omnes rationes unicas!
vi: Lưu ý: Đối với mỗi khe Katana mới, sẽ sử dụng một mã hạt giống tài khoản khác nhau, làm cho tất cả các tài khoản trở nên duy nhất!

source: Once finished with the new configurations, we are ready to build and migrate the project. To build the project, run the following command:
cn: 完成新配置后，我们准备构建和迁移项目。要构建项目，请运行以下命令：
jp: 新しい設定が完了したら、プロジェクトの構築と移行に備えています。プロジェクトを構築するには、次のコマンドを実行してください。
lt: Una vice perfectus cum nova configurationes, parati sumus fabricare et migrare projectus. Ad fabricandum projectum, sequens imperium curre:
vi: Khi hoàn thành cài đặt mới, chúng ta sẵn sàng xây dựng và di chuyển dự án. Để xây dựng dự án, chạy lệnh sau:

source: Now, let's migrate the project to our new katana slot:
cn: 现在，让我们将项目迁移到我们的新katana插槽：
jp: 今、プロジェクトを私たちの新しい刀スロットに移行しましょう。 (Ima, purojekuto wo watashitachi no atarashii katana slotto ni ikō shimashō.)
lt: Nunc, transfert opus ad novum katana foramine nostro:
vi: Bây giờ, chúng ta hãy di chuyển dự án sang khe katana mới của chúng ta:

source: If the migrations have been successful, you will receive the `WORLD_ADDRESS`, which then you can use to interact with your world.
cn: 如果迁移成功，您将收到`WORLD_ADDRESS`，然后您可以使用它与您的世界进行交互。
jp: 移行が成功した場合、`WORLD_ADDRESS`が送信されます。これを使って、自分のワールドとやり取りすることができます。
lt: Si migrationes felices fuerint, accipies `WORLD_ADDRESS`, quod deinde uti poteris ad communicandum cum mundo tuo.
vi: Nếu các di chuyển đã thành công, bạn sẽ nhận được `WORLD_ADDRESS`, sau đó bạn có thể sử dụng để tương tác với thế giới của bạn.

source: Congratulations! You have successfully deployed your project with a Katana slot.
cn: 恭喜你！你成功部署了你的项目，并使用了Katana插槽。
jp: おめでとうございます！カタナスロットを使用して、プロジェクトを成功裏に展開しました。 (Omedetōgozaimasu! Katana surotto o shiyō shite, purojekuto o seikōri ni tenkai shimashita.)
lt: Gratulatio! Tu feliciter explevisti opus tuum cum slot Katana.
vi: Chúc mừng! Bạn đã triển khai dự án của mình thành công với một khe Katana.

source: To initiate a Torri indexer slot, execute the following command:
cn: 要启动Torri索引器插槽，请执行以下命令：
jp: Torriのインデクサースロットを開始するには、次のコマンドを実行してください。
lt: Ad Torri indexer locum incipere, sequentem imperium exsequere:
vi: Để khởi tạo một khe chỉ mục Torri, thực hiện lệnh sau:

source: Once deployment is successful, you should receive the endpoints for GraphQL and gRPC.
cn: 成功部署后，您应该收到GraphQL和gRPC的端点。
jp: デプロイが成功したら、GraphQLとgRPCのエンドポイントを受け取るはずです。
lt: Omnia expeditione prospera, debes accipere fines ad GraphQl et gRPC.
vi: Khi triển khai thành công, bạn sẽ nhận được các điểm cuối cho GraphQL và gRPC.

source: If you wish to stream the logs, you can run the following command in a new terminal:
cn: 如果你想要流式传输日志，你可以在新的终端中运行以下命令：
jp: もしログをストリーミングしたい場合は、新しいターミナルで以下のコマンドを実行できます。
lt: Si vis ligna fluminare, sequenti imperio in novo terminali uti potes:
vi: Nếu bạn muốn truyền dữ liệu ghi log, bạn có thể chạy lệnh sau trong cửa sổ terminal mới:

source: Contributing to Dojo Book
cn: 对道场书的贡献
jp: 道場の本への貢献
lt: Contribuens ad Librum Dojo
vi: Đóng góp cho Sách Dojo

source: As the Dojo engine progresses and develops, it is essential for the Dojo book to keep pace with these advancements. Updating and refining the book ensures that it remains a relevant and valuable resource for those interested in understanding and utilizing the latest Dojo engine features and capabilities. All help is welcome!
cn: 当道场引擎不断进展和发展时，道场书籍与这些进展保持同步至关重要。更新和完善书籍确保其对于那些有兴趣了解和利用最新道场引擎功能和能力的人保持相关和有价值的资源。欢迎一切帮助！
jp: 道場エンジンが進化し開発されるにつれて、道場の本もこれらの進歩に遅れることなく追いつくことが不可欠です。本を更新し磨きをかけることで、最新の道場エンジンの機能や能力を理解し活用することに興味を持つ方々にとって、関連性のある貴重なリソースであることを保証します。全ての助けが歓迎されます！
lt: Quodlibet utile.
vi: Khi Dojo engine tiến triển và phát triển, việc cập nhật và hoàn thiện cuốn sách Dojo là vô cùng quan trọng để đồng bộ với những tiến bộ này. Việc cập nhật và hoàn thiện cuốn sách đảm bảo rằng nó vẫn là một nguồn tài nguyên quan trọng và có giá trị đối với những người quan tâm đến việc hiểu và sử dụng những tính năng và khả năng mới nhất của Dojo engine. Mọi sự giúp đỡ đều được hoan nghênh!

source: The purpose of the book
cn: 书的目的
jp: 本の目的
lt: Finalitas libri
vi: Mục đích của cuốn sách

source: The Dojo book is designed to be a comprehensive resource that caters to users at various levels of experience. It aims to serve as both an introductory guide for those new to Dojo and its ancillary packages, as well as a reference for more experienced users seeking to deepen their understanding of the engine's features and capabilities.
cn: 道场书旨在成为一个全面的资源，满足不同经验水平的用户。它旨在成为对于那些对道场及其辅助包新手的入门指南，同时也是对于更有经验的用户寻求加深对引擎功能和能力理解的参考资料。
jp: 道場の本は、さまざまな経験レベルのユーザーに対応する包括的なリソースとして設計されています。「道場」とその関連パッケージに初めて触れる人々のために導入ガイドとして機能するだけでなく、エンジンの機能や能力をより深く理解するために経験豊富なユーザーが参照するためのリファレンスとしても役立つことを目指しています。
lt: Librum Dojo cultum est ut res omnium complectatur, quae ad diversos gradus usorum accommodate. Eius propositum est ut tam uti priorem ducem novis Dojo et coniunctis eius inducere, tam etiam ut uti cognitioribus operibus motricis ut feature ac potestates eorum amplificent.
vi: Sách Dojo được thiết kế để là một nguồn tài nguyên toàn diện phục vụ người dùng ở các cấp độ kinh nghiệm khác nhau. Nó nhằm mục đích phục vụ như một hướng dẫn giới thiệu cho những người mới sử dụng Dojo và các gói phụ trợ của nó, cũng như là một tài liệu tham khảo cho những người dùng có kinh nghiệm hơn đang tìm hiểu sâu hơn về các tính năng và khả năng của công cụ này.

source: The book is split into some major chapters:
cn: 书分为一些重要的章节：
jp: その本はいくつかの重要な章に分かれています。 (Sono hon wa ikutsu ka no jūyōna shō ni wakareteimasu.)
lt: Libellus dividitur in quaedam capita magna:
vi: Cuốn sách được chia thành một số chương chính:

source: Framework Theory
cn: 框架理论
jp: フレームワーク理論
lt: Theoria Fabrica
vi: Lý thuyết khuôn khổ

source: Building a World
cn: 建设一个世界
jp: 世界を築く (Sekai o kizuku)
lt: Aedificans Mundum
vi: Xây dựng một Thế giới

source: Code of Conduct
cn: 行为准则
jp: 行動規範 (Kōdō Kihan)
lt: Civilitatis ratio
vi: Quy tắc ứng xử

source: The book follows the [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct).
cn: 这本书遵循[Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct)。
jp: その本は、[Rustの行動規範（https://www.rust-lang.org/policies/code-of-conduct）](https://www.rust-lang.org/policies/code-of-conduct)に従っています。
lt: Liber sequitur [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct).
vi: Cuốn sách tuân theo [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct).

source: Ways to contribute
cn: 贡献的方式
jp: 貢献する方法
lt: Viae adferre
vi: Cách để đóng góp

source: Issues
cn: 问题
jp: 問題
lt: Res difficilis
vi: Vấn đề

source: If you think that some content is missing or out-of-date, feel free to open an issue. If you find multiple pieces of content lacking, please open up a separate issue for each.
cn: 如果您认为某些内容缺失或过时，请随时提出问题。如果您发现多个内容缺失，请为每个内容单独提出问题。
jp: もし、特定のコンテンツが欠けているか古くなっていると思う場合は、遠慮なく問題を開いてください。複数のコンテンツが不足している場合は、それぞれ別々の問題を開いてください。
lt: Si existimatis aliquem contentum deesse aut vetustatem, libere potestis rem aperire. Si plura contenta carentia invenitis, separate rem aperite pro unoquoque.
vi: Nếu bạn nghĩ rằng có nội dung nào đó bị thiếu hoặc lỗi thời, hãy mở một vấn đề. Nếu bạn thấy nhiều phần nội dung bị thiếu, hãy mở một vấn đề riêng cho mỗi phần.

source: The issues will then be labeled so other contributors can find chunks of work they are interested in more easily.
cn: 问题将被标记，这样其他贡献者就可以更容易地找到他们感兴趣的工作部分。
jp: 問題はその後、他の貢献者が自分が興味を持っている作業の断片をより簡単に見つけることができるようにラベルが付けられます。
lt: Res res tunc nomina caritabantur ita alii contubernales laborent invenire partes operae quae magis eos intersint facilius.
vi: Các vấn đề sẽ được gắn nhãn để những người đóng góp khác có thể tìm thấy các phần công việc mà họ quan tâm một cách dễ dàng hơn.

source: The issue should contain what is missing, or what could be improved, in as much detail as you deem necessary.
cn: 问题应该包含缺失的内容，或者需要改进的内容，你认为必要的话，可以尽可能提供更多细节。
jp: この問題には、あなたが必要と考える詳細な情報を含めるべきです。何が足りないのか、または改善できる点は、あなたの判断による範囲内で詳細に説明されるべきです。
lt: Res in controversiam venire debet quae desunt, aut quae melius fieri possent, tam necessario quam possibile detegere.
vi: Vấn đề nên chứa những gì đang thiếu, hoặc những gì có thể được cải thiện, với càng chi tiết càng tốt theo bạn cho là cần thiết.

source: Pull requests
cn: 拉请求
jp: プルリクエスト
lt: Pulchritudines postulationes
vi: Yêu cầu kéo

source: Feel free to contribute changes to the book by opening a pull request - anything is welcome, from reformulating a sentence, fixing a typo, to adding new sections or chapters.
cn: 请随意通过打开一个pull请求来对这本书做出改动 - 任何东西都欢迎，从重新表达一个句子，修复一个拼写错误，到添加新的部分或章节。
jp: 本に変更を加えるために、プルリクエストを開くことで自由に貢献してください。文の言い回しの改善や誤字の修正、新しいセクションや章の追加など、どんな変更でも歓迎です。
lt: Nolite timere contribuere mutationes ad librum aperiendo tirunculum acciperet - aliquid est gratum, ex reformulando sententiam, mendacium corrumpendo, ut addens novi divisiones vel capitula.
vi: Hãy thoải mái đóng góp sửa đổi cho cuốn sách bằng cách mở một yêu cầu kéo - mọi thứ đều được hoan nghênh, từ việc biên soạn lại một câu, sửa lỗi chính tả, đến việc thêm các phần hoặc chương mới.

source: When your pull request is open, other contributors will take a look and may request changes. Do not be discouraged!
cn: 当您的拉取请求开放时，其他贡献者将会查看并可能请求更改。不要灰心！
jp: あなたのプルリクエストがオープンされている場合、他のコントリビューターが目を通し、変更を要求する場合があります。落ち込まないでください！
lt: Cum tua rogatio admissa sit, alii contribulores intuebuntur et mutata possunt postulare. Noli defici!
vi: Khi yêu cầu kéo của bạn mở, những người đóng góp khác sẽ xem xét và có thể yêu cầu thay đổi. Đừng nản lòng!

source: Writing style
cn: 写作风格
jp: 文章のスタイル (Bunshō no sutairu)
lt: Stilus scribendi
vi: Phong cách viết

source: This section documents a few standards for writing used throughout the book.
cn: 这一部分记录了本书中使用的一些写作标准。
jp: この節では、本書で使用されるいくつかの書き方の標準を文書化しています。
lt: Haec pars normas paucas scripturae in toto libro invenit.
vi: Đoạn này ghi chép một số tiêu chuẩn viết được sử dụng trong toàn bộ cuốn sách.

source: Chapters start with a second level heading
cn: 章节以二级标题开头
jp: チャプターは2番目のレベルの見出しで始まります。
lt: Capitula incipiunt cum capite secundo ordinis
vi: Các chương bắt đầu với tiêu đề cấp độ thứ hai

source: We use:
cn: 我们使用：
jp: 私たちは使います。 (Watashitachi wa tsukaimasu.)
lt: Nos utimur:
vi: Chúng tôi sử dụng:

source: We do not use:
cn: 我们不使用：
jp: 私たちは使用しません。 (Watashitachi wa shiyou shimasen.)
lt: Non utimur:
vi: Chúng tôi không sử dụng:

source: Katana is a customizable Starknet development network. It is blazingly fast and allows you to iterate on your game logic swiftly.
cn: Katana 是一个可定制的 Starknet 开发网络。它运行速度非常快，可以让您迅速迭代游戏逻辑。
vi: Katana là một mạng phát triển Starknet có thể tùy chỉnh. Nó vô cùng nhanh chóng và cho phép bạn làm nhanh chóng trên logic trò chơi của mình.

source: All Starknet contracts are defined using the `#[starknet::contract]` decorator, ensuring accurate compilation. In this context, Dojo introduces the `#[dojo::contract]` decorator, which aims to minimize boilerplate in contract writing. It’s imperative to acknowledge that utilizing this decorator is entirely optional.
cn: 所有Starknet合同都是使用`#[starknet::contract]`装饰器定义的，确保准确编译。在这种情况下，Dojo引入了`#[dojo::contract]`装饰器，旨在最大程度地减少合同编写中的样板代码。必须承认，使用这个装饰器是完全可选的。
vi: Tất cả các hợp đồng Starknet được xác định bằng cách sử dụng trang trí `#[starknet::contract]`, đảm bảo biên dịch chính xác. Trong ngữ cảnh này, Dojo giới thiệu trang trí `#[dojo::contract]`, mục tiêu là giảm thiểu khoán lề trong việc viết hợp đồng. Rất quan trọng phải nhận thức rằng việc sử dụng trang trí này hoàn toàn là tùy chọn.

source: ```shell fn move( self: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //player game_id: felt252 ) { let world = self.world_dispatcher.read(); let (current_x, current_y) = curr_position; let (next_x, next_y) = next_position; current_x.print(); current_y.print(); next_x.print(); next_y.print(); let mut current_square = get!(world, (game_id, current_x, current_y), (Square)); // check if next_position is out of board or not assert(is_out_of_board(next_position), 'Should be inside board'); // check if this is the right piece type move assert( is_right_piece_move(current_square.piece, curr_position, next_position), 'Should be right piece move' ); let target_piece = current_square.piece; // make current_square piece none and move piece to next_square current_square.piece = PieceType::None(()); let mut next_square = get!(world, (game_id, next_x, next_y), (Square)); // check the piece already in next_suqare let maybe_next_square_piece = next_square.piece; if maybe_next_square_piece == PieceType::None(()) { next_square.piece = target_piece; } else { if is_piece_is_mine(maybe_next_square_piece) { panic(array!['Already same color piece exist']) } else { next_square.piece = target_piece; } } set!(world, (next_square)); set!(world, (current_square)); } //helper functions within the fn move. don't worry, we'll address logic content in the next chapter fn is_piece_is_mine(maybe_piece: PieceType) -> bool { //the rest of the code .... } fn is_correct_turn(maybe_piece: PieceType, caller: ContractAddress, game_id: felt252) -> bool { //the rest of the code .... } fn is_out_of_board(next_position: (u32, u32)) -> bool { //the rest of the code .... } fn is_right_piece_move(maybe_piece: PieceType, curr_position: (u32, u32), next_position: (u32, u32)) -> bool { //the rest of the code .... } } ```
lt: fn move( si: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), caller: ContractAddress, //ludens game_id: felt252 ) { let orbis = si.world_dispatcher.legere(); let (current_x, current_y) = curr_position; let (next_x, next_y) = next_position; current_x.print(); current_y.print(); next_x.print(); next_y.print(); let mut current_square = accipe!(orbis, (ludus_id, current_x, current_y), (Area)); // verificare si next_position est extra tabula vel non asserere(est_extra_tabula(next_position), 'Debet esse intus tabula'); // verificare si hoc est motus iustus generis asserere( est_motus_iustus_generis(current_square.piecis, curr_position, next_position), 'Debet esse motus iustus generis' ); let petitus_piecis = current_square.piecis; // facere current_square piecis nihil et moveto piecis ad next_square current_square.piecis = GenerisPiecis::Nihil(()); let mut next_square = accipe!(orbis, (ludus_id, next_x, next_y), (Area)); // verificare generis iam in next_suqare let forte_nihil_piecis = next_square.piecis; si forte_nihil_piecis == GenerisPiecis::Nihil(()) { next_square.piecis = petitus_piecis; } else { si est_piecis_mea(forte_nihil_piecis) { caedere(array!['Iam exstitit idem coloris petra']) } else { next_square.piecis = petitus_piecis; } } pone!(orbis, (next_square)); pone!(orbis, (current_square)); } //subsidium functiones intra fn move. nolite solliciti, nos insequi rationem contenti in proximo capite fn est_piecis_mea(forte_piecis: GenerisPiecis) -> verum { //ceteri codex .... } fn est_iusta_vicissim(forte_piecis: GenerisPiecis, caller: ContractAddress, ludus_id: felt252) -> verum { //ceteri codex .... } fn est_extra_tabula(next_position: (u32, u32)) -> verum { //ceteri codex .... } fn est_motus_iustus_generis(forte_piecis: GenerisPiecis, curr_position: (u32, u32), next_position: (u32, u32)) -> verum { //ceteri codex .... } }
vi: ```shell fn move( tự: @ContractState, curr_position: (u32, u32), next_position: (u32, u32), người gọi: ContractAddress, // người chơi game_id: felt252 ) { let world = tự.world_dispatcher.read(); let (current_x, current_y) = curr_position; let (next_x, next_y) = next_position; current_x.print(); current_y.print(); next_x.print(); next_y.print(); let mut current_square = get!(world, (game_id, current_x, current_y), (Square)); // kiểm tra nếu next_position ra khỏi bảng hay không assert(is_out_of_board(next_position), 'Nên ở bên trong bảng'); // kiểm tra xem đây có phải là nước đi loại quân đúng không assert( is_right_piece_move(current_square.piece, curr_position, next_position), 'Nên là nước đi loại quân đúng' ); let target_piece = current_square.piece; // đặt current_square piece thành none và di chuyển piece tới next_square current_square.piece = PieceType::None(()); let mut next_square = get!(world, (game_id, next_x, next_y), (Square)); // kiểm tra quân đã có trong next_suqare let maybe_next_square_piece = next_square.piece; if maybe_next_square_piece == PieceType::None(()) { next_square.piece = target_piece; } else { if is_piece_is_mine(maybe_next_square_piece) { panic(array!['Đã có cùng màu quân tồn tại']) } else { next_square.piece = target_piece; } } set!(world, (next_square)); set!(world, (current_square)); } //các hàm trợ giúp trong fn di chuyển. Đừng lo, chúng ta sẽ giải quyết nội dung logic trong chương kế tiếp fn is_piece_is_mine(maybe_piece: PieceType) -> bool { //phần còn lại của code .... } fn is_correct_turn(maybe_piece: PieceType, người gọi: ContractAddress, game_id: felt252) -> bool { //phần còn lại của code .... } fn is_out_of_board(next_position: (u32, u32)) -> bool { //phần còn lại của code .... } fn is_right_piece_move(maybe_piece: PieceType, curr_position: (u32, u32), next_position: (u32, u32)) -> bool { //phần còn lại của code .... } } ```
