Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: ```toml [package] name = "ohayoo" version = "0.1.0" cairo-version = "2.1.1" [cairo] sierra-replace-ids = true [dependencies] dojo = { git = "https://github.com/dojoengine/dojo.git" } # # Katana # rpc_url = "http://localhost:5050" # account_address = "0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0" # private_key = "0x0300001800000000300000180000000000030000000000003006001800006600" #Madara rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" #world_address = "0x5b328933afdbbfd44901fd69a2764a254edbb6e992ae87cf958c70493f2d201" ```
cn: ```toml [包] 名称 = "ohayoo" 版本 = "0.1.0" 开罗版本 = "2.1.1" [开罗] 塞拉替换ID = true [依赖] dojo = { git = "https://github.com/dojoengine/dojo.git" } # # 刀 # rpc_url = "http://localhost:5050" # account_address = "0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0" # private_key = "0x0300001800000000300000180000000000030000000000003006001800006600" #斑 rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" #world_address = "0x5b328933afdbbfd44901fd69a2764a254edbb6e992ae87cf958c70493f2d201" ```
jp: [package] name = "ohayoo" version = "0.1.0" cairo-version = "2.1.1" [cairo] sierra-replace-ids = true [dependencies] dojo = { git = "https://github.com/dojoengine/dojo.git" } # # Katana # rpc_url = "http://localhost:5050" # account_address = "0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0" # private_key = "0x0300001800000000300000180000000000030000000000003006001800006600" #マダラ rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" #world_address = "0x5b328933afdbbfd44901fd69a2764a254edbb6e992ae87cf958c70493f2d201"
lt: ```toml [pacchage] nomen = "ohayoo" versio = "0.1.0" cairo-versio = "2.1.1" [cairo] sierra-replace-ids = verum [dependencies] dojo = { git = "https://github.com/dojoengine/dojo.git" } # # Katana # rpc_url = "http://localhost:5050" # account_address = "0x03ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0" # private_key = "0x0300001800000000300000180000000000030000000000003006001800006600" #Madara rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" #world_address = "0x5b328933afdbbfd44901fd69a2764a254edbb6e992ae87cf958c70493f2d201" ```

source: Remote Katana
cn: 遥控刀劍
jp: リモート刀
lt: Katana remota
vi: Kiếm Xa Lạ

source: Katanas are able to be hosted and run as remote testnets, however this is not recommended for production use.
cn: 刀剑可以作为远程测试网络进行托管和运行，但不建议用于生产环境。
jp: 日本語に翻訳すると：刀剣は遠隔テストネットとしてホストおよび実行することができますが、本番利用には推奨されていません。
lt: Catanas possunt hospitari et currere quasi test-networks remoti, tamen hoc non est commendatum ad usum in productione.
vi: Katanas có thể được lưu trữ và chạy như mạng lưới kiểm tra từ xa, tuy nhiên điều này không được khuyến nghị cho việc sử dụng sản xuất.

source: **todo**: add instructions for deploying to remote katana
cn: **待办事项**：添加部署到远程katana的说明。
jp: **TODO**: 遠隔の刀（かたな）への展開手順を追加してください。
lt: **omnia**: add instruxiones pro explantando in remoto katana
vi: **việc cần làm**: thêm hướng dẫn để triển khai lên máy chủ từ xa của katana

source: Madara
cn: 马达拉
jp: マダラ
vi: Mađa라

source: [Madara](https://github.com/keep-starknet-strange/madara) is a blazingly fast Starknet sequencer. Built on the robust Substrate framework and fast, thanks to Rust 🦀, Madara delivers unmatched performance and scalability to power your Starknet-based Validity Rollup chain.
cn: Madara是一个速度非常快的Starknet顺序器。Madara建立在强大的Substrate框架上，由于Rust 🦀而快速，为您的基于Starknet的有效性Rollup链提供了无与伦比的性能和可扩展性。
jp: [マダラ](https://github.com/keep-starknet-strange/madara) は、驚くべき速さで動作するスタークネットシーケンサーです。堅牢なSubstrateフレームワークと高速なRust🦀のおかげで、マダラは類を見ないパフォーマンスとスケーラビリティを提供し、あなたのスタークネットベースのValidity Rollupチェーンを支えます。
lt: Madara est sequencer Starknet velocissimus. Construitur in robuusto framework Substrate, et celeris, gratias ad Rust 🦀, Madara praestat performance incomparabilem et scalabilitatem ad rationem tuam Starknet-based Validity Rollup catenam.
vi: Madara là một máy chủ Starknet cực kỳ nhanh chóng. Được xây dựng trên nền tảng Substrate mạnh mẽ và nhanh nhẹn, nhờ vào Rust 🦀, Madara mang lại hiệu suất và khả năng mở rộng không giới hạn để cung cấp năng lượng cho chuỗi Validity Rollup dựa trên Starknet của bạn.

source: A public Madara testnet is available for deployment:
cn: 公共的玛达拉测试网可供部署：
jp: デプロイメント用のパブリックなMadaraテストネットが利用可能です。
lt: Testnet publicus Madara ad deploymentum disponibilis est.
vi: Một Madara testnet công cộng có sẵn để triển khai:

source: **Testnet RPC:** https://api.cartridge.gg/x/shinai/madara
cn: **测试网络RPC：**https://api.cartridge.gg/x/shinai/madara
jp: **テストネットRPC：**https://api.cartridge.gg/x/shinai/madara
vi: **Testnet RPC:** https://api.cartridge.gg/x/shinai/madara **Testnet RPC:** https://api.cartridge.gg/x/shinai/madara

source: You can use the following account to deploy:
cn: 您可以使用以下账户进行部署：
jp: 以下のアカウントを使用して展開することができます。 (An answer in Japanese)
lt: Potestis uti sequenti ratione ad deployare:
vi: BẠN CÓ THỂ SỬ DỤNG TÀI KHOẢN SAU ĐỂ TRIỂN KHAI:

source: ```toml # ...rest of Scarb.toml rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" ```
cn: ```toml # ...其余的Scarb.toml rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" ```
jp: ```toml # ...Scarab.tomlの残り部分 rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" ``` You can translate the text to Japanese as: ```toml # ...Scarab.tomlの残りの部分 rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d" ```
lt: rpc_url = "https://api.cartridge.gg/x/shinai/madara" account_address = "0x2" private_key = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d"
vi: url của rpc = "https://api.cartridge.gg/x/shinai/madara" địa chỉ tài khoản = "0x2" khóa riêng = "0xc1cf1490de1352865301bb8705143f3ef938f97fdf892f1090dcb5ac7bcd1d"

source: Starknet
cn: Starknet 星网
jp: スタークネット
lt: Rete Stark

source: **todo**: add instructions for deploying to remote Starknet
cn: **待办事项**：添加部署到远程Starknet的说明。
jp: **todo**: リモートStarknetへのデプロイ手順を追加してください。
lt: **omne**: adde praecepta pro deploymento in Starknet remotum
vi: **làm**: thêm hướng dẫn triển khai lên máy chủ từ xa của Starknet

source: Building a Chess Game
cn: 建立一个棋类游戏
jp: チェスゲームを作成する
lt: Aedificans ludum scacchorum
vi: Xây dựng một trò chơi cờ vua

source: _"I just finished reading The Dojo Book. What should I do next?"_
cn: 我刚刚读完了《道场书》。接下来我该做什么呢？
jp: 「私はちょうど『道場の本』を読み終えました。次に何をすべきですか？」
lt: Nuper legens liber The Dojo. Quid agam postea?
vi: "Tôi vừa mới đọc xong cuốn sách The Dojo Book. Tôi nên làm gì tiếp theo?"

source: The answers to this question are always "Make something!", sometimes followed by a list of cool projects. This is a great answer for some people, but others might be looking for a little more direction.
cn: 这个问题的答案总是“创造一些东西！”有时后面会跟着一系列酷炫的项目。这对某些人来说是一个很好的答案，但有些人可能正在寻找更明确的方向。
jp: この質問の答えは常に「何か作る！」ということであり、時にはクールなプロジェクトのリストが続けて紹介されることがあります。これは一部の人々にとっては素晴らしい答えですが、他の人々はもう少し具体的な指示を求めているかもしれません。
lt: Responsiones ad hanc quaestionem semper sunt "Aliquid fac!", interdum sequitur a catalogo projectorum pulchrorum. Hoc est responsio optima pro aliquibus, sed alii forte quaerunt plus directionis.
vi: Câu trả lời cho câu hỏi này luôn là "Làm cái gì đó!", đôi khi được theo sau bởi một danh sách các dự án thú vị. Điều này là câu trả lời tuyệt vời đối với một số người, nhưng người khác có thể đang tìm kiếm một chút hướng dẫn hơn.

source: This guide is intended to fill the gap between heavily directed beginner tutorials and working on your projects. The primary goal here is to get you to write code. The secondary goal is to get you reading documentation.
cn: 这个指南旨在填补初学者教程和自己动手项目之间的巨大差距。这里的主要目标是让你开始写代码。次要目标是让你阅读文档。
jp: このガイドは、初心者向けの詳しい指導に加えて、自分のプロジェクトに取り組む準備をするためのものです。主な目標はここでコードを書けるようにすることです。第二の目標はドキュメンテーションを読めるようにすることです。
lt: Hic dux est ad implendum lacunam inter praecepta rudimenta adhibitiora directa et laborem in proiectis tuis. Scopus primarius hic est ut te ad movendum ad scripturam codicis. Scopus secundarius est ut te ad movendum ad lectionem documentorum.
vi: Hướng dẫn này được thiết kế để điền vào khoảng trống giữa các hướng dẫn dành cho người mới bắt đầu được chỉ đạo mạnh mẽ và việc làm trên các dự án của bạn. Mục tiêu chính ở đây là giúp bạn viết mã. Mục tiêu phụ là giúp bạn đọc tài liệu.

source: If you haven't read the Dojo Book yet, it is highly encouraged for you to do so before starting this project.
cn: 如果你还没有读过《道场书》,强烈建议你在开始这个项目之前先阅读一下。
jp: もしまだ道場の本を読んでいないならば、このプロジェクトを始める前に読むことを強くお勧めします。
lt: Si nondum librum Dojo legeris, vehementer hortamur te eum prius legere quam hoc opus incipias.
vi: Nếu bạn chưa đọc cuốn sách Dojo Book, rất khuyến khích bạn làm điều đó trước khi bắt đầu dự án này.

source: What are we building?
cn: 我们在建造什么？
jp: 私たちは何を建てていますか？ (Watashitachi wa nani o tatete imasu ka?)
lt: Quid aedificamus?
vi: Chúng ta đang xây dựng cái gì?

source: We're building an on-chain chess game contract that lets you start a new game and play chess. This guide does not cover every rules of the chess game. You will build step by step as follows:
cn: 我们正在建立一个链上国际象棋游戏合约，让您可以开始新游戏并下国际象棋。本指南不涵盖国际象棋游戏的每一个规则。您将按照以下步骤逐步构建：
jp: 私たちはオンチェーンのチェスゲーム契約を構築しています。この契約では新しいゲームを始めてチェスをプレイすることができます。このガイドではチェスのすべてのルールを網羅していません。以下に従って段階的に構築していきます。
lt: Stamus construimus in catena ludi scaccorum contractum qui permitterit tibi novum lusum incipere ac scaccos ludere. Hoc ductus non complectitur omnes regulas ludi scaccorum. Gradatim aedificabis ut sequitur:
vi: Chúng tôi đang xây dựng một hợp đồng trò chơi cờ vua trên chuỗi cho phép bạn bắt đầu một trò chơi mới và chơi cờ vua. Hướng dẫn này không bao gồm mọi quy tắc của trò chơi cờ vua. Bạn sẽ xây dựng từng bước một như sau:

source: A system contract to spawn all the chess pieces
cn: 一个系统合同生成所有的棋子 Note: This is the translated text in Chinese.
jp: すべてのチェスの駒を生成するためのシステム契約
lt: A systema pactus ad creandos omnes taxillos Ludorum Sacrorum
vi: Một hợp đồng hệ thống để tạo ra tất cả các quân cờ.

source: A system contract to make pieces move
cn: 一个系统契约来使棋子移动。
jp: 片を動かすシステム契約
lt: Unum contractum ad systema ut argumenta movere
vi: Một hợp đồng hệ thống để làm cho các mảnh di chuyển

source: Add some functions to check a legal move
cn: 添加一些功能来检查合法移动。
jp: 合法な動きをチェックするいくつかの機能を追加してください
lt: Adde aliquas functiones ad verificandum motum legitimum
vi: Thêm một số chức năng để kiểm tra nước đi hợp lệ

source: Play chess ♟♙ - integration test!
cn: 下棋♟♙ - 集成测试！
jp: チェスをプレイする♟♙ - 統合テストです！
lt: Ludere scacchis ♟♙ - test integrationis!
vi: Chơi cờ vua ♟♙ - bài kiểm tra tích hợp!

source: The full code of tutorial is based on [this repo](https://github.com/dojoengine/dojo-examples/tree/main/examples/dojo-chess).
cn: 教程的完整代码基于[此存储库](https://github.com/dojoengine/dojo-examples/tree/main/examples/dojo-chess)。
jp: チュートリアルの完全なコードは、[このリポジトリ](https://github.com/dojoengine/dojo-examples/tree/main/examples/dojo-chess)に基づいています。
lt: Codex totus tutorialis fundatus est in [hoc depositario](https://github.com/dojoengine/dojo-examples/tree/main/examples/dojo-chess).
vi: Toàn bộ mã nguồn của hướng dẫn được dựa trên [kho lưu trữ này](https://github.com/dojoengine/dojo-examples/tree/main/examples/dojo-chess).

source: If this seems too hard, don't worry! This guide is for beginners. If you know some basics about Cairo and Dojo, you're good. We won't make a full chess game with all the rules. We're keeping it simple.
cn: 如果这个似乎太难，别担心！这个指南是给初学者的。如果你对开罗和道场有一些基础知识，那就够了。我们不会制作一个包含所有规则的完整国际象棋游戏。我们会保持简单。
jp: もしこれがやりにくそうであれば、心配しないでください！このガイドは初心者向けです。もしカイロと道場の基礎について少し知っているのであれば、大丈夫です。全てのルールを含んだ完全なチェスゲームを作るわけではありません。シンプルに保ちます。
lt: Si hoc videtur nimis difficile, noli sollicitari! Hic ductus est ad initiatores. Si quaedam elementa de Al-Qahira et Dojo nosti, bene est. Ludum scaccorum integrum cum omnibus regulis non faciemus. Facilem eum redigimus.
vi: Nếu có vẻ quá khó, đừng lo! Hướng dẫn này dành cho người mới bắt đầu. Nếu bạn biết một vài kiến thức cơ bản về Cairo và Dojo, bạn đã đủ. Chúng tôi sẽ không làm một trò chơi cờ vua đầy đủ các quy tắc. Chúng tôi sẽ giữ nó đơn giản.

source: What after this guide?
cn: 这个指南之后呢？
jp: このガイドの後は何ですか？ (Kono gaido no ato wa nan desu ka?)
lt: Quid post hunc ducem?
vi: Quá trình này kết thúc, điều gì tiếp theo?

source: We're making another guide to help design the frontend. This will make our chess game complete.
cn: 我们正在制作另一份指南来帮助设计前端。这将使我们的国际象棋游戏更加完整。
jp: 私たちはフロントエンドの設計を支援するための別のガイドを作成しています。これにより、私たちのチェスゲームが完成します。
lt: Facimus alium ductorem adiuvandi structuram aspectalem. Hoc perficiet ludum regium nostrum.
vi: Chúng tôi đang làm một hướng dẫn khác để giúp thiết kế giao diện. Điều này sẽ khiến trò chơi cờ vua của chúng tôi hoàn chỉnh hơn.

source: After you finish all the four chapters, we can move on to the frontend guide.
cn: 完成了所有四章之后，我们就可以开始进行前端指南了。
jp: 四つの章をすべて終えたら、フロントエンドガイドに進むことができます。 (Yottsu no shō o subete oeta ra, furonto endo gaido ni susumu koto ga dekimasu.)
lt: Postquam finieris omnes quattuor capita, poterimus progredi ad praeceptum frontend.
vi: Sau khi bạn hoàn thành bốn chương, chúng ta có thể tiến tới hướng dẫn phía trước.

source: _Before starting recommend following the [`hello-dojo`](../../cairo/hello-dojo.md) chapter to gain a basic understanding of the Dojo game._
cn: 开始之前建议按照[`hello-dojo`](../../cairo/hello-dojo.md)一章，以获得对道场游戏的基本理解。
jp: 始める前に、Dojoゲームの基本的な理解を得るために、[`hello-dojo`](../../cairo/hello-dojo.md)チャプターを参照することをおすすめします。
lt: Antequam incipias, suadeo sequi capitulum [`hello-dojo`](../../cairo/hello-dojo.md) ut rudimenta Ludi Dojo capias.
vi: Trước khi bắt đầu, tôi recomnend theo chương ['hello-dojo'](../../cairo/hello-dojo.md) để có được hiểu biết cơ bản về trò chơi Dojo.

source: Initializing the Project
cn: 开始项目
jp: プロジェクトを初期化します。
lt: Initiandi Proiecti
vi: Khởi tạo dự án

source: Create a new Dojo project folder. You can name your project what you want.
cn: 创建一个新的道场项目文件夹。您可以随意命名您的项目。
jp: 新しい道場（どうじょう）のプロジェクトフォルダを作成してください。プロジェクト名は自由につけて構いません。
lt: Creare novum folium operis Dojo. Potes nomen dare operi tuo quod vis.
vi: Tạo một thư mục dự án Dojo mới. Bạn có thể đặt tên cho dự án của mình như bạn muốn.

source: Open the project folder.
cn: 打开项目文件夹。
jp: プロジェクトのフォルダを開く。
lt: Aperi projecti fasciculum.
vi: Mở thư mục dự án.

source: And initialize the project using sozo init.
cn: 初始化项目使用sozo init。
jp: そして、「sozo init」を使ってプロジェクトを初期化します。
lt: Et incohare projectum per sozo init.
vi: Và khởi tạo dự án bằng cách sử dụng lệnh sozo init.

source: Cleaning Up the Boilerplate
cn: 清理标准文件
jp: ボイラープレートの清掃
lt: Purgatio calidariae
vi: Dọn dẹp bộ khung căn bản

source: The project comes with a lot of boilerplate codes. Clear it all. Make sure both `models.cairo` and `systems.cairo` files are empty. In this tutorial, we won't be creating a `systems.cairo` nor the `src/systems` folder, you can delete both (highly optional, folder structure is entirely up to you). instead, we'll be creating a file named `actions_contract.cairo`, this is where our game logic/contract will reside.
cn: 该项目带有大量样板代码。清除所有内容。确保`models.cairo`和`systems.cairo`文件为空。在本教程中，我们不会创建`systems.cairo`或`src/systems`文件夹，您可以删除这两者（高度可选，文件夹结构完全由您决定）。相反，我们将创建一个名为`actions_contract.cairo`的文件，这是我们的游戏逻辑/合同所在的地方。
jp: このプロジェクトにはたくさんのテンプレートコードが含まれています。それらをすべて削除してください。`models.cairo`ファイルと`systems.cairo`ファイルの両方が空であることを確認してください。このチュートリアルでは、`systems.cairo`や`src/systems`フォルダを作成しません。両方を削除しても問題ありません（完全に任意のフォルダ構造です）。代わりに、`actions_contract.cairo`というファイルを作成します。ここにゲームのロジック/コントラクトが入ります。
lt: Venit projectum cum multitudine codicum burdulis. Omnia elue. Fac ut tam `models.cairo` quam `systems.cairo` censilia sint vacua. In hoc monstro, non creabimus `systems.cairo` nec fodrum `src/systems`, potes ambo delere (valde facultativum, structura fodrum penitus ad te pertinet). Pro potius, creabimus limem nomine `actions_contract.cairo`, hic est ubi logica/contractus ludi nostri morabitur.
vi: Dự án đi kèm với rất nhiều mã mẫu. Xóa sạch tất cả. Đảm bảo cả hai tệp `models.cairo` và `systems.cairo` đều trống. Trong hướng dẫn này, chúng ta sẽ không tạo ra một `systems.cairo` hay thư mục `src/systems`, bạn có thể xóa cả hai (tùy chọn cao, cấu trúc thư mục hoàn toàn thuộc về bạn). Thay vào đó, chúng ta sẽ tạo một tệp có tên là `actions_contract.cairo`, đây là nơi mà logic/hợp đồng của trò chơi chúng ta sẽ nằm.

source: Remodel your`lib.cairo`, to look like this :
cn: 重新设计你的`lib.cairo`，使其看起来像这样：
jp: これに見えるように、'lib.cairo'をリモデルしてください。
lt: Reformare librum tuum "lib.cairo", ut videatur hoc modo:
vi: Nâng cấp thư viện `lib.cairo` của bạn, để trông giống như thế này:

source: Compile your project with:
cn: 将您的项目编译与:
jp: 以下のコマンドでプロジェクトをコンパイルしてください。 コンパイルするコマンド:
lt: Collige tuum proiectum cum:
vi: Biên dịch dự án của bạn với:

source: Basic components
cn: 基本组件
jp: 基本的なコンポーネント
lt: Elementa fundamentalia
vi: Các thành phần cơ bản

source: While there are many ways to design a chess game using the ECS model, we'll follow this approach:
cn: 虽然有许多种方式可以使用ECS模型来设计国际象棋游戏，但我们将遵循这种方法：
jp: ECSモデルを使用してチェスゲームを設計する方法はたくさんありますが、私たちは次のアプローチに従います。
lt: Dum sunt multae viae ad ludendum scaccorum ludum, utemur hoc ratione:
vi: Trong khi có nhiều cách để thiết kế một trò chơi cờ vua bằng mô hình ECS, chúng tôi sẽ tuân theo cách tiếp cận này:

source: Every square of the chess board (e.g., A1) will be treated as an entity. If a piece exists on a square, the square entity will hold that piece.
cn: 棋盘上的每一个方块（例如A1）将被视为一个实体。如果一个棋子存在于一个方块上，那个方块的实体将持有那个棋子。
jp: チェス盤の各マス（例：A1）は、エンティティとして扱われます。もしマスに駒が存在すれば、そのマスのエンティティはその駒を保持します。
lt: Omnis quadratum latrunculorum tabulae (e.g., A1) ut entitas tractabitur. Si pecia in quadrato existit, entitas illa peciam retinebit.
vi: Mỗi ô của bàn cờ vua (ví dụ, A1) sẽ được xem xét như là một thực thể. Nếu một quân cờ tồn tại trên ô, thực thể ô đó sẽ giữ quân cờ đó.

source: First, add this basic model to `models.cairo` file. If you are not familar with model syntax in Dojo engine, go back to this [chapter](../../cairo/models.md).
cn: 首先，将这个基本模型添加到`models.cairo`文件中。如果你对Dojo引擎中的模型语法不熟悉，请回到这个[章节](../../cairo/models.md)。
jp: まず、この基本的なモデルを `models.cairo` ファイルに追加してください。もしDojoエンジンのモデル構文について慣れていない場合は、[この章](../../cairo/models.md)に戻ってください。
lt: Primum, adde hoc exemplar rudimentarium ad limam `models.cairo`. Si non es familiaris cum syntaxi modello in motori Dojo, redi ad hoc [caput](../../cairo/models.md).
vi: Đầu tiên, thêm mô hình cơ bản này vào tệp `models.cairo`. Nếu bạn không quen với cú pháp mô hình trong động cơ Dojo, hãy quay lại [chương này](../../cairo/models.md).

source: Basic systems
cn: 基本系统
jp: 基本システム
lt: Sistēmās simplicibus
vi: Hệ thống cơ bản

source: Starting from the next chapter, you will implement the `actions_contract.cairo` logic.
cn: 从下一章开始，您将实施`actions_contract.cairo`逻辑。
jp: 次の章から、`actions_contract.cairo`のロジックを実装します。
lt: A principio sequenti capituli, implementabis logica 'actions_contract.cairo'.
vi: Bắt đầu từ chương tiếp theo, bạn sẽ thực hiện logic `actions_contract.cairo`.

source: Create `actions_contract.cairo` inside the src folder. the file should contain a basic contract.
cn: 在src文件夹中创建`actions_contract.cairo`。该文件应包含一个基本的合同。
jp: srcフォルダ内に`actions_contract.cairo`を作成してください。このファイルには基本的な契約が含まれている必要があります。
lt: Creare 'actions_contract.cairo' intra folium src. Archivum debet continere contractum basem.
vi: Tạo `actions_contract.cairo` bên trong thư mục src. Tập tin nên chứa một hợp đồng cơ bản.

source: For example, `actions_contract.cairo` should look like this:
cn: 例如，`actions_contract.cairo` 应该是这样的：
jp: たとえば、`actions_contract.cairo` は以下のようになります：
lt: "Verbi causa, `actions_contract.cairo` huiusmodi esse debet:"
vi: Ví dụ, `actions_contract.cairo` nên trông như thế này:

source: It should be noted that systems are cairo contracts, by implication, rather than implementing the game logic in systems, we are implementing it in a contract.
cn: 值得注意的是，系统是开罗合同，从而意味着，我们不是在系统中实现游戏逻辑，而是在合同中实现它。
jp: これは注意しておくべきことですが、システムはカイロ契約というものであり、それによって、システムにゲームロジックを実装するのではなく、契約に実装しています。
lt: Notandum est systemata esse pacta Cairo, ideoque potius quam systematibus ludos implementamus, eos in pacto implementamus.
vi: Lưu ý rằng hệ thống là hợp đồng cairo, theo ngụ ý, thay vì thực hiện logic trò chơi trong hệ thống, chúng tôi đang thực hiện nó trong một hợp đồng.

source: Compile your project
cn: 编译您的项目
jp: プロジェクトをコンパイルしてください (Purojekuto o konpairu shite kudasai)
lt: Construe tuum projectum
vi: Hãy biên soạn dự án của bạn

source: Now try `sozo build` to build. Faced some errors?
cn: 现在尝试“sozo build”进行构建。遇到了一些错误吗？
jp: 今度は「sozo build」を試してみてください。エラーが発生しましたか？
lt: Nunc conare 'sozo aedificare' aedificare. Aliquos errores obviasit?
vi: Hãy thử `sozo build` để xây dựng. Gặp phải một số lỗi không?

source: You would probably faced some trait implementation errors, which you can implement as a derive like:
cn: 您可能会遇到一些特征实现错误，您可以像这样实现：
jp: おそらく、いくつかのトレイトの実装エラーに直面するかもしれませんが、それらはderivで実装することができます。
lt: Tu fortasse aliquas errores implementationis indolis expertus sis, quas ut derivare possis implementare.
vi: Bạn có thể gặp một số lỗi triển khai đặc tính, bạn có thể triển khai chúng như một phần như sau:

source: Complied? Great! then let's move on. If not fix other issues as above, so that you can run the `sozo build` command successfully.
cn: 已编译？太好了！那么让我们继续。如果没有，请解决上述其他问题，以便您可以成功运行`sozo build`命令。
jp: 了解しましたか？素晴らしい！では、次に進みましょう。もし解決しなかった場合、上記の他の問題を修正して、`sozo build`コマンドを正常に実行できるようにしてください。
lt: Confecta? Magnus! Tum progrediamur. Sin aliteria corrigere, ut possis `sozo build` imperium prospera decurrere.
vi: Đã hoàn tất? Tuyệt vời! Bây giờ chúng ta tiếp tục. Nếu chưa, hãy sửa các vấn đề khác như đã nói trên để bạn có thể chạy lệnh `sozo build` thành công.

source: Run test
cn: 运行测试
jp: テストを実行してください。 (Tesuto o jikkō shite kudasai.)
lt: Currere tentandum
vi: Chạy thử

source: Before proceeding to the next chapter, remember that `sozo build` and `sozo test` are important steps to ensure your code is correct.
cn: 在继续下一章之前，请记住，“sozo build”和“sozo test”是重要的步骤，以确保您的代码是正确的。
jp: 次の章に進む前に、「sozo build」と「sozo test」がコードが正しいか確認するために重要な手順であることを覚えておいてください。
lt: Antequam procedas ad proximum capitulum, memento 'sozo build' et 'sozo test' esse passus importantes ad code tuum rectum esse.
vi: Trước khi tiến hành sang chương tiếp theo, hãy nhớ rằng `sozo build` và `sozo test` là những bước quan trọng để đảm bảo mã code của bạn là chính xác.

source: Run sozo test. Did you face any errors?
cn: 运行sozo测试。 你面对过任何错误吗？
jp: ソゾテストを実行してください。エラーは発生しましたか？ (Sozō tesuto o jikkō shitekudasai. Erā wa hassei shimashita ka?)
lt: Currere sozo examen. Facedne aliquos errores?
vi: Chạy kiểm tra sozo. Bạn đã gặp phải bất kỳ lỗi nào không?
