Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: Now, let's deploy it to [Katana](../toolchain/katana/overview.md)! First, we need to get Katana running. Open a second terminal and execute:
cn: 现在，让我们将其部署到[Katana](../toolchain/katana/overview.md)！首先，我们需要让Katana运行起来。在打开第二个终端并执行：
jp: いま、[Katana](../toolchain/katana/overview.md)に展開しましょう！まず、Katanaを起動する必要があります。2番目のターミナルを開いて、以下を実行してください。
lt: Nunc, deinde deployamus ad [Katana](../toolchain/katana/overview.md)! Primum, opus est ut Katana currat. Aperi terminalem secundum et exsequere:
vi: Bây giờ, hãy triển khai nó vào [Katana](../toolchain/katana/overview.md)! Trước hết, chúng ta cần làm Katana chạy. Mở một cửa sổ dòng lệnh thứ hai và thực thi:

source: Success! [Katana](../toolchain/katana/overview.md) should now be running locally on your machine. Now, let's deploy! In your primary terminal, execute:
cn: 成功！[Katana](../toolchain/katana/overview.md) 现在应该在您的本地机器上运行。现在，让我们部署！在您的主要终端上执行：
jp: 成功しました！[Katana](../toolchain/katana/overview.md)は、今あなたのローカルマシンで実行されているはずです。さあ、デプロイしましょう！主なターミナルで、次を実行してください。
lt: Felicitas! [Katana](../toolchain/katana/overview.md) nunc debet currere in vicino super tuo machina. Nunc, sinamus deploy! In tuo primarius terminalis, exequere:
vi: Thành công! [Katana](../toolchain/katana/overview.md) bây giờ nên đang chạy cục bộ trên máy của bạn. Bây giờ, hãy triển khai! Trong cửa sổ terminal chính, thực thi:

source: This will deploy the artifact to [Katana](../toolchain/katana/overview.md). You should see terminal output similar to this:
cn: 将此部署到[Katana](../toolchain/katana/overview.md)的工件。您应该会看到类似这样的终端输出：
jp: これはアーティファクトを[Katana](../toolchain/katana/overview.md)に展開します。ターミナル出力は次のようになります。
lt: Hoc artefactum [Katana](../toolchain/katana/overview.md) deployabit. Termino similem ad hunc videbis:
vi: Điều này sẽ triển khai tác phẩm nghệ thuật đến [Katana](../toolchain/katana/overview.md). Bạn nên thấy đầu ra từ terminal tương tự như sau:

source: # Executor
cn: # 执行者
jp: 実行者
lt: # Praeses
vi: # Người Thi Hành

source: # Base Contract
cn: 基础合同
jp: # ベース契約
lt: Contrahit fundamentale
vi: Thông điệp phải dịch: # Hợp đồng cơ bản

source: # World
cn: # 世界
jp: 世界
lt: Mundus
vi: Thế giới

source: # Models (2)
cn: # 模特 (2)
jp: モデル（2）
lt: Modelli (2)
vi: Mô hình (2)

source: # Contracts (1)
cn: # 合同（1）
jp: 契約 (1)
lt: #Contrahit (1)
vi: # Hợp đồng (1)

source: Your 🌎 is now deployed at `0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973`!
cn: 您的🌎现在已部署到`0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973`！
jp: あなたの🌎は現在、`0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973` に展開されました！
lt: Tuum 🌎 nunc deployatur ad `0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973`!
vi: Khoảnh khắc của bạn 🌎hiện đang triển khai tại `0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973`!

source: This establishes the world address for your project.
cn: 这为你的项目确立了世界地址。
jp: あなたのプロジェクトのための世界的なアドレスを確立します。
lt: Hoc constituit mundi ad projectum tuum address.
vi: Điều này thiết lập địa chỉ thế giới cho dự án của bạn.

source: Let's discuss the `Scarb.toml` file in the project. This file contains environment variables that make running CLI commands in your project a breeze. (Read more about it [here](./config.md)). Make sure your file specifies the version of Dojo you have installed!. In this case version `0.3.10`
cn: 让我们讨论项目中的`Scarb.toml`文件。这个文件包含使在项目中运行CLI命令变得轻松的环境变量。（在[这里](./config.md)了解更多）。请确保您的文件指定了您安装的Dojo版本！在这种情况下，版本为`0.3.10`
jp: プロジェクトの `Scarb.toml` ファイルについて話し合いましょう。このファイルには、プロジェクト内でCLIコマンドを実行する際に便利な環境変数が含まれています（[こちら](./config.md)で詳細を読む）。インストールされているDojoのバージョンをファイルに指定してください！ この場合、バージョンは `0.3.10` となります。
lt: Dicamus de archivo `Scarb.toml` in opere. Hic liber continet variabiles ambientas quae faciunt exsecutionem mandatorum CLI in opere tuo facillimam. (Legite amplius de eo [hic](./config.md)). Certificamini liber tuus adsignet versionem Dojo quae habes installatam!. In hoc casu versio `0.3.10`
vi: Hãy thảo luận về tệp `Scarb.toml` trong dự án. Tệp này chứa các biến môi trường giúp việc chạy các lệnh CLI trong dự án của bạn trở nên dễ dàng hơn. (Đọc thêm về nó [tại đây](./config.md)). Đảm bảo rằng tệp của bạn chỉ định phiên bản Dojo bạn đã cài đặt!. Trong trường hợp này là phiên bản `0.3.10`

source: ```toml [dependencies] dojo = { git = "https://github.com/dojoengine/dojo", version = "0.3.13" } ```
jp: ```toml [dependencies] dojo = { git = "https://github.com/dojoengine/dojo", version = "0.3.13" } ``` ```japanese [dependencies] dojo = { git = "https://github.com/dojoengine/dojo", version = "0.3.13" } ```
lt: [dependencyes] dojo = { git = "https://github.com/dojoengine/dojo", version = "0.3.13" }
vi: [dependencies] dojo = { git = "https://github.com/dojoengine/dojo", version = "0.3.13" }

source: Indexing
cn: 索引
jp: インデックス化 (Indekkusu-ka)
lt: Indicem
vi: Chỉ mục

source: With your local world address established, let's delve into indexing. You can index the entire world. To accomplish this we have to copy your world address from the output of `sozo migrate`. Now Open a new terminal and input this simple command that includes your own world address:
cn: 您的本地世界地址已经建立，让我们深入了解索引。您可以为整个世界建立索引。为了实现这一目标，我们必须从`sozo migrate`的输出中复制您的世界地址。现在打开一个新的终端，并输入包含您自己的世界地址的简单命令：
jp: 日本語に翻訳すると次のようになります: ローカルワールドアドレスが確立されたら、インデックスに進みましょう。あなたは世界全体をインデックスすることができます。これを達成するには、`sozo migrate`の出力からあなたのワールドアドレスをコピーする必要があります。今度は新しいターミナルを開き、次のシンプルなコマンドを入力してください。ただし、自分自身のワールドアドレスを含めてください。
lt: Cum loci mundo tuus aditus constitutus sit, in indexationem immergamus. Totum mundum potes indexare. Ad hoc perficiendum oportet aditum tuum de output `sozo migrate` imitari. Nunc novam terminalem aperi et hoc praeceptum simplicem exerce quod aditum tuum proprium includit:
vi: Với địa chỉ thế giới địa phương của bạn đã thiết lập, hãy đào sâu vào việc lập chỉ mục. Bạn có thể lập chỉ mục toàn bộ thế giới. Để làm được điều này, chúng ta phải sao chép địa chỉ thế giới của bạn từ kết quả của `sozo migrate`. Bây giờ Mở một cửa sổ terminal mới và nhập lệnh đơn giản này mà bao gồm địa chỉ thế giới của bạn:

source: Running the command mentioned above starts a Torii server on your local machine. This server uses SQLite as its database and is accessible at http://0.0.0.0:8080/graphql. Torii will automatically organize your data into tables, making it easy for you to perform queries using GraphQL. When you run the command, you'll see terminal output that looks something like this:
cn: 上述命令会在您的本地机器上启动一个Torii服务器。该服务器使用SQLite作为其数据库，并且可以通过http://0.0.0.0:8080/graphql访问。Torii将自动将您的数据组织成表，使您可以使用GraphQL轻松执行查询。运行命令时，您会看到类似以下内容的终端输出：
jp: 上記のコマンドを実行すると、ローカルマシン上でToriiサーバーが起動します。このサーバーはデータベースとしてSQLiteを使用し、http://0.0.0.0:8080/graphqlでアクセスできます。Toriiはデータをテーブルに自動的に整理し、GraphQLを使用してクエリを実行することが容易になります。コマンドを実行すると、次のようなターミナルの出力が表示されます。
lt: Cursus supra memoratum imperium incipit Torii servum in machina locali. Hic servus utitur SQLite ut suum databasem et est accessibilis in http://0.0.0.0:8080/graphql. Torii automatice disponet tuos datos in tabulis, faciens facile tibi facere interrogationes per utendo GraphQL. Cum imperium curras, videbis terminalem exitum quod similem aliquid spectabitur ut:
vi: Chạy lệnh được đề cập ở trên sẽ khởi động một máy chủ Torii trên máy cục bộ của bạn. Máy chủ này sử dụng SQLite làm cơ sở dữ liệu và có thể truy cập tại http://0.0.0.0:8080/graphql. Torii sẽ tự động tổ chức dữ liệu của bạn thành các bảng, giúp bạn dễ dàng thực hiện truy vấn bằng cách sử dụng GraphQL. Khi bạn chạy lệnh, bạn sẽ thấy đầu ra của terminal trông giống như thế này:

source: You can observe that our `Moves` and `Position` models have been successfully registered. Next, let's use the GraphiQL IDE to retrieve data from the `Moves` model. In your web browser, navigate to `http://0.0.0.0:8080/graphql`, and enter the following query:
cn: 您可以观察到我们的 `Moves` 和 `Position` 模型已经成功注册。接下来，让我们使用 GraphiQL IDE 从 `Moves` 模型中检索数据。在您的网络浏览器中，导航到 `http://0.0.0.0:8080/graphql`，并输入以下查询：
jp: 私たちの`Moves`モデルと`Position`モデルが正常に登録されていることが確認できます。次に、GraphiQL IDEを使用して`Moves`モデルからデータを取得しましょう。ウェブブラウザで`http://0.0.0.0:8080/graphql`に移動し、以下のクエリを入力してください。
lt: Potestis observare vestras `Motus` et `Positio` formulas feliciter esse registratas. Deinde, utamur GraphiQL IDE ad data ex `Motus` formula recipienda. In vestro web navigato, ingredimini ad `http://0.0.0.0:8080/graphql`, et inserite sequentem quaestionem:
vi: Bạn có thể quan sát rằng các mô hình `Moves` và `Position` của chúng tôi đã được đăng ký thành công. Tiếp theo, hãy sử dụng GraphiQL IDE để lấy dữ liệu từ mô hình `Moves`. Trong trình duyệt web của bạn, hãy điều hướng đến `http://0.0.0.0:8080/graphql`, và nhập truy vấn sau đây:

source: ```graphql query { model(id: "Moves") { id name class_hash transaction_hash created_at } } ```
cn: 查询{ model（ID：“Moves”）{ ID 名称 类哈希 交易哈希 创建于 } }
jp: ```graphql クエリ { model(id: "Moves") { id name class_hash transaction_hash created_at } } ```
lt: { quaerere { modello(id: "Moves") { id nomen classis_hash transaction_hash creatus_est } } }
vi: truy vấn { mô hình(id: "Di chuyển") { id tên lớp_băm giao_dịch_băm đã_tạo_lúc } }

source: After you run the query, you will receive an output like this:
cn: 运行查询后，您将收到以下输出：
jp: クエリを実行した後、このような出力を受け取ります。 (Kuieri o jikkō shita ato, kono yōna shutsuryoku o uketorimasu)
lt: Postquam quaeris quaestionem, recipies exitum ut hic:
vi: Sau khi chạy truy vấn, bạn sẽ nhận được một kết quả như thế này:

source: "data"
cn: "数据"
jp: データ (dēta)
lt: "Datum"
vi: dữ liệu

source: "model"
cn: 模特
jp: モデル (mōderu)
lt: exemplar
vi: "Người mẫu"

source: "id"
cn: "身份证"
jp: ID (アイディー)
lt: This sentence is already in Latin and means "it" in English. If you would like a different text translated into Latin, please provide the English text.

source: "Moves"
cn: 动作
jp: 動き (Ugoki)
lt: Motus
vi: "Di chuyển"

source: "name"
cn: 名字
jp: 名前 (なまえ)
lt: nomen
vi: Tên

source: "class_hash"
cn: "类哈希"
jp: クラスハッシュ (Kurasu hasshu)
lt: Classes_lilium
vi: "lớp_hash"

source: "0xb37482a660983dfbf65968caa26eab260d3e1077986454b52ac06e58ae20c4"
cn: "0xb37482a660983dfbf65968caa26eab260d3e1077986454b52ac06e58ae20c4" 的中文翻译。
jp: これを日本語に翻訳すると「0xb37482a660983dfbf65968caa26eab260d3e1077986454b52ac06e58ae20c4」となります。
vi: "0xb37482a660983dfbf65968caa26eab260d3e1077986454b52ac06e58ae20c4" -> "0xb37482a660983dfbf65968caa26eab260d3e1077986454b52ac06e58ae20c4"

source: "transaction_hash"
cn: 交易哈希
jp: トランザクションのハッシュ
lt: "transaction_hash" -> "transactio_hash"
vi: "transaction_hash" -> "mã giao dịch"

source: "created_at"
cn: "创建于"
jp: "created_at" in Japanese is "作成日時" (さくせいにちじ).
lt: creatus est
vi: "đã tạo"

source: Awesome, now let's work with subscriptions to get real-time updates. Let's clean up your workspace on the GraphiQL IDE and input the following subscription:
cn: 了不起，现在让我们与订阅一起工作，以获得实时更新。让我们在GraphiQL IDE上整理一下您的工作空间，并输入以下订阅：
jp: すごいですね、さあ、リアルタイムの更新を取得するためにサブスクリプションを使いましょう。GraphiQL IDEのワークスペースを整理して、以下のサブスクリプションを入力しましょう。
lt: Magnus, nunc laboremus cum subscriptionibus ut actualizationes temporis veri accipiamus. Mundemus spatium tuum in GraphiQL IDE et incidamus subscriptionem sequentem:
vi: Tuyệt vời, bây giờ chúng ta hãy làm việc với đăng ký để nhận cập nhật thời gian thực. Hãy dọn dẹp không gian làm việc của bạn trên GraphiQL IDE và nhập đăng ký sau đây:

source: Once you execute the subscription, you will receive notifications whenever new entities are updated or created. For now, don't make any changes to it and proceed to create a new entity.
cn: 一旦您执行订阅，您将在新实体更新或创建时收到通知。现在，请不要对其进行任何更改，然后继续创建新实体。
jp: 購読を実行すると、新しいエンティティが更新または作成されるたびに通知を受け取ります。今のところ、変更は行わず、新しいエンティティの作成に進んでください。
lt: Semel subscribes, notificas accipies quotiens nova entia subrogantur vel creantur. Nunc, nihil muta et procede ad novum entitatem creandam.
vi: Khi bạn thực hiện đăng ký, bạn sẽ nhận thông báo mỗi khi có thực thể mới được cập nhật hoặc tạo ra. Hiện tại, đừng thực hiện bất kỳ thay đổi nào và tiếp tục tạo ra một thực thể mới.

source: To accomplish this, we have to go back to our primary terminal and check the contracts section.
cn: 要做到这一点，我们必须回到我们的主要终端并检查合同部分。
jp: これを達成するためには、まず主な端末に戻って契約のセクションを確認する必要があります。
lt: Ad hoc perficiendum est, ad primariam terminalem revertendum est et sectionem contractuum inspiciendum.
vi: Để thực hiện điều này, chúng ta phải quay trở lại trạm chính và kiểm tra phần hợp đồng.

source: We have to use `actions` contract address to start to create entities. In your main local terminal, run the following command:
cn: 我们必须使用`actions`合同地址开始创建实体。在您的主要本地终端上运行以下命令：
jp: 以下のコマンドを実行して、エンティティの作成を開始するために `actions` コントラクトアドレスを使用する必要があります。お使いのメインのローカル端末で、次のコマンドを実行してください。
lt: Oportet uti `actionibus` ad locum contractus ad initium creandi entitates. In tuo terminali locali principali, curre sequentem mandatum:
vi: Chúng ta phải sử dụng địa chỉ hợp đồng `actions` để bắt đầu tạo thực thể. Trong cửa sổ dòng lệnh cục bộ chính của bạn, chạy lệnh sau:

source: By running this command, you've activated the spawn system, resulting in the creation of a new entity. This action establishes a local world that you can interact with.
cn: 通过运行这个命令，您已激活了生成系统，导致创建了一个新的实体。这一行动建立了一个您可以与之交互的本地世界。
jp: このコマンドを実行することで、スポーンシステムが起動し、新しいエンティティが生成されます。このアクションにより、相互作用できるローカルワールドが確立されます。 Romanized (Rōmaji): Kono komando o jikkō suru koto de, supōn shisutemu ga katsudō shi, atarashī entiti ga seisei sa remasu. Kono akushon ni yori, sōgo sasayaku lokal wordo ga kakuritsu sa remasu.
lt: Mediante hoc imperium currenti, tu excitavisti partum systematis, quo productio novae entitatis creata est. Haec actio constituit mundum localem, cum quo interagere potes.
vi: Bằng cách chạy lệnh này, bạn đã kích hoạt hệ thống sinh sảy, dẫn đến việc tạo ra một thực thể mới. Hành động này thiết lập một thế giới cục bộ mà bạn có thể tương tác.

source: Now, go back to your GraphiQL IDE, and you will notice that you have received the subscription's results, which should look something like this:
cn: 现在，返回到您的GraphiQL IDE，您会注意到您已收到订阅结果，应该看起来像这样：
jp: 今、GraphiQL IDEに戻り、購読の結果が受け取られていることに気づくでしょう。結果は次のようなものになるはずです。
lt: Nunc, rede ad tuum GraphiQL IDE, et notabis te accepisse subscriptionis resultatus, qui similis debent spectare hoc:
vi: Bây giờ, quay lại GraphiQL IDE của bạn và bạn sẽ nhận thấy rằng bạn đã nhận được kết quả của sự đăng ký, nó sẽ trông giống như thế này:

source: "entityUpdated"
cn: 实体已更新
jp: エンティティが更新されました (Entiti ga koushin saremashita)
lt: Entitas Updated
vi: "đãCậpNhậtThựcThể"

source: "0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20"
cn: "0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20" 的翻译
jp: 「0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20」を日本語に翻訳すると、次のようになります。「0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20」
lt: "0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20" - nulla aliud
vi: "0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20" (Note: This appears to be a hexadecimal string and may not require translation)

source: "keys"
cn: 钥匙
jp: 鍵 (kagi)
lt: claves
vi: "chìa khóa"

source: "0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973"
cn: "0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973" 的中文翻译。
jp: 「0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973」を日本語に翻訳すると、次のようになります：「0x517ececd29116499f4a1b64b094da79ba08dfd54a3edaa316134c41f8160973」

source: "model_names"
cn: "模特名"
jp: モデルの名前
lt: nomina exemplaris
vi: "tên mô hình"

source: "event_id"
cn: "事件ID"
jp: イベント_ID
lt: "eventus_id"
vi: "sự kiện_id"

source: "0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0000"
cn: "0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0000" -> "0x000000000000000000000000000000000000000000000000000000000000000b：0x0000：0x0000"
jp: 「0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0000」を日本語に翻訳すると、「0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0000」となります。

source: "updated_at"
cn: "更新时间"
jp: "updated_at"の日本語への翻訳は「更新日時」です。
lt: "emendatus ad"
vi: "cập nhật vào"

source: "Moves,Position"
cn: 移动，位置
jp: 動き、位置 (Ugoki, Ichi)
lt: "Motus, Positio"
vi: "Di chuyển, Vị trí"

source: "0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0001"
cn: "0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0001" "0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0001"
jp: 「0x000000000000000000000000000000000000000000000000000000000000000b:0x0000:0x0001」を日本語に翻訳すると、 「0x000000000000000000000000000000000000000000000000000000000000000b：0x0000：0x0001」となります。

source: In the GraphiQL IDE, by clicking the `DOCS`\-button on the right, you can open the API documentation. This documentation is auto-generated based on our schema definition and displays all API operations and data types of our schema.. In order to know more about query and subscription, you can jump to [GraphQL](../toolchain/torii/graphql.md) section. We've covered quite a bit! Here's a recap:
cn: 在GraphiQL IDE中，通过点击右侧的`DOCS`按钮，您可以打开API文档。该文档是根据我们的架构定义自动生成的，并显示我们架构的所有API操作和数据类型。为了更多了解查询和订阅，您可以跳转到[GraphQL](../toolchain/torii/graphql.md)部分。我们已经涵盖了相当多！这里是一个总结：
jp: GraphiQL IDEでは、右側の`DOCS`ボタンをクリックすることで、APIドキュメントを開くことができます。このドキュメントはスキーマ定義に基づいて自動生成され、スキーマのすべてのAPI操作とデータ型を表示します。クエリとサブスクリプションについて詳しく知りたい場合は、[GraphQL](../toolchain/torii/graphql.md)セクションに進むことができます。かなり多くの内容をカバーしています！ここでまとめると、
lt: In GraphiQL IDE, cliccando sul pulsante `DOCS` a destra, è possibile aprire la documentazione dell'API. Questa documentazione è generata automaticamente in base alla nostra definizione dello schema e mostra tutte le operazioni dell'API e i tipi di dati del nostro schema. Per saperne di più su query e subscription, è possibile passare alla sezione [GraphQL](../toolchain/torii/graphql.md). Abbiamo coperto parecchio! Ecco un riassunto:
vi: Trong IDE GraphiQL, bằng cách nhấp vào nút `DOCS` ở bên phải, bạn có thể mở tài liệu API. Tài liệu này được tạo tự động dựa trên định nghĩa schema của chúng tôi và hiển thị tất cả các hoạt động API và kiểu dữ liệu của schema của chúng tôi. Để biết thêm về truy vấn và đăng ký, bạn có thể nhảy đến phần [GraphQL](../toolchain/torii/graphql.md). Chúng tôi đã covered quite a bit! Đây là một bản tóm tắt:

source: Built a Dojo world
cn: 建立一个道场世界
jp: 道場の世界を作りました (Doujou no sekai o tsukurimashita)
lt: Construit mundum Dojo
vi: Xây dựng một thế giới Dojo

source: Deployed the project to Katana
cn: 将项目部署到武士刀
jp: プロジェクトを刀に展開しました。
lt: Proiectum in Katanam detulerunt
vi: Triển khai dự án lên Katana

source: Indexed the world with Torii
cn: 用鸟居索引世界
jp: 鳥居を用いて世界をインデックス化しました。
lt: Indicavit mundum cum Torii
vi: Đánh dấu thế giới với Torii

source: Ran the spawn system locally
cn: 运行生成系统本地化
jp: ローカルでスポーンシステムを実行しました
lt: Sistema generandi locale cucurrit
vi: Hệ thống sinh sản ran được chạy cục bộ

source: Interacted with GraphQL
cn: 与GraphQL交互
jp: GraphQL との相互作用
lt: Interactus est cum GraphQL
vi: Tương tác với GraphQL

source: Next Steps
cn: 下一步
jp: 次のステップ (Tsugi no suteppu)
lt: Proximos Gradus
vi: Bước tiếp theo

source: This overview provides a rapid end-to-end glimpse into Dojo. However, the potential of these worlds is vast! Designed to manage hundreds of systems and components, Dojo is equipped for expansive creativity. So, what will you craft next?
cn: 这个概述快速地展示了 Dojo 的端到端情景。然而，这些世界的潜力是巨大的！Dojo 被设计用于管理数百个系统和组件，因此适用于广泛的创意。那么，你接下来将创造什么？
jp: この概要は、Dojoに素早い全体像を提供します。しかしながら、これらの世界の可能性は広大です！数百のシステムとコンポーネントを管理するように設計され、Dojoは広範な創造力に備えています。では、次にあなたは何を作り出すのでしょうか？
lt: Hic conspectus praebet rapide ad missis intus Dojo. Verumtamen, potentia harum orbium est immensa! Confectus ad moderandum centenas systematum et partium, Dojo est instructus ad amplitudinem creativitatis. Itaque, quid conficies proxime?
vi: Tổng quan này cung cấp cái nhìn toàn diện nhanh chóng vào Dojo. Tuy nhiên, tiềm năng của những thế giới này rất lớn! Được thiết kế để quản lý hàng trăm hệ thống và thành phần, Dojo được trang bị cho sự sáng tạo mở rộng. Vậy, bạn sẽ chế tác cái gì tiếp theo?

source: Entities are the primary key value within the world, to which models can be attached.
cn: 实体是世界中的主键值，模型可以附加到这些实体上。
jp: エンティティは世界内の主キー値であり、モデルがアタッチされるものです。
lt: Entitates sunt prima clave valoris intra mundum, ad quas modelli possunt adiungi.
vi: Thực thể là giá trị khóa chính trong thế giới, mà các mô hình có thể được gắn vào.

source: Different ECS systems handle entities in various ways. In Dojo, entities are treated as a primary key value within the world, to which models can be attached. To illustrate this concept, consider a simple example of a character in a game that has a `Moves` and a `Position` model.
cn: 不同的ECS系统以不同的方式处理实体。在Dojo中，实体被视为世界中的主键值，可以附加模型。为了说明这个概念，考虑一个简单的例子，游戏中的角色有一个`Moves`和一个`Position`模型。
jp: 異なるECSシステムは、さまざまな方法でエンティティを処理します。Dojoでは、エンティティはワールド内の主キー値として扱われ、そこにモデルをアタッチできます。この概念を説明するために、ゲーム内のキャラクターの単純な例である「Moves」と「Position」のモデルを持つキャラクターを考えてみてください。
lt: Different ECS systems handle entities in various ways. In Dojo, entities are treated as a primary key value within the world, to which models can be attached. To illustrate this concept, consider a simple example of a character in a game that has a `Moves` and a `Position` model. Translation into Latin: Diversa ECS systemata entia varie tractant. In Dojo, entia tanquam clavis primaria in mundo tractantur, ad quae modelli adiungi possunt. Hanc conceptum illustrare, considera exemplum simplicem de personagio in ludo, qui habet modellos `Moves` et `Position`.
vi: Các hệ thống ECS khác nhau xử lý các thực thể theo cách khác nhau. Trong Dojo, các thực thể được xem xét như một giá trị khóa chính trong thế giới, mà các mô hình có thể được gắn kết. Để minh họa cho khái niệm này, hãy xem xét một ví dụ đơn giản về một nhân vật trong trò chơi có một mô hình `Moves` và một mô hình `Position`.

source: When defining the models for this entity, it is important to note that we do not reference the entity directly. Instead, we simply provide two structs that the entity will contain.
cn: 在为这个实体定义模型时，重要的是要注意我们不直接引用这个实体。相反，我们只是提供了实体将包含的两个结构体。
jp: このエンティティのモデルを定義する際には、エンティティ自体を直接参照しないことが重要です。代わりに、エンティティに含まれる2つの構造体を提供するだけです。
lt: Cum definiuntur modelli pro hac entitate, notandum est nos non hanc entitatem directe referre. Immo duos structuras tantummodo praebemus quas entitas continebit.
vi: Khi xác định các mô hình cho thực thể này, quan trọng phải lưu ý rằng chúng ta không tham chiếu trực tiếp đến thực thể. Thay vào đó, chúng ta chỉ cung cấp hai cấu trúc mà thực thể sẽ chứa.

source: ECS Theory: Plenty has been written on ECS systems, to go deeper read [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)
cn: ECS理论：对ECS系统已经有很多文章进行了撰写，想要深入了解，请阅读[ECS-FAQ](https://github.com/SanderMertens/ecs-faq)。
jp: ECS理論：ECSシステムについては多くの文献があります。詳細については、[ECS-FAQ](https://github.com/SanderMertens/ecs-faq)を参照してください。
lt: Theoria ECS: Multum scriptum est de systematibus ECS, ad altius legere [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)
vi: Lý thuyết ECS: Đã có rất nhiều văn bản được viết về các hệ thống ECS, để hiểu sâu hơn hãy đọc [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)
