Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: If configured to _Ethereum_ messaging, Katana will listen/send messages on an Ethereum chain. This type of messaging behaves similar to the canonical Starknet sequencer with the exception that messages from L2 -> L1 will be sent directly to the settlement chain for consumption, instead of having to wait for the corresponding blocks of the messages to be proven on the settlement chain (which in reality would be a very time consuming process).
cn: 如果配置为以_Ethereum_消息传递，Katana将在以太坊链上监听/发送消息。这种类型的消息传递行为类似于规范的Starknet序列器，唯一的区别是从L2 -> L1的消息将直接发送到结算链以供消耗，而不必等待消息的对应区块在结算链上被证明（这实际上将是一个非常耗时的过程）。
jp: Ethereumメッセージングに設定された場合、刀はEthereumチェーンでメッセージを聞き取ったり、送信したりします。この種のメッセージングは、L2 -> L1のメッセージが決済チェーンに直接送信され、メッセージの対応するブロックが決済チェーン上で証明されるまで待つ必要がないという点を除いて、通常のStarknetシーケンサーと似ています（実際には非常に時間のかかるプロセスとなります）。
lt: Si configuratum est ad _Ethereum_ messaging, Katana auscultabit/mittere messagia in catena Ethereum. Hic genus messaging similem se habebit sequencer canonicalis Starknet, cum exceptione quod messagia a L2 -> L1 directe ad catenam settlement missa erunt ad consumptionem, proinde quam oporteat expectare correspondentes tabulas messagiorum ad probandum in catena settlement (quod re ipsa processus valde temporis consumptivus esset).
vi: Nếu được cấu hình để gửi tin nhắn _Ethereum_, Katana sẽ lắng nghe/gửi tin nhắn trên một chuỗi Ethereum. Loại tin nhắn này hoạt động tương tự như trình tự Starknet chuẩn với sự khác biệt là các tin nhắn từ L2 -> L1 sẽ được gửi trực tiếp đến chuỗi thanh toán để tiêu thụ, thay vì phải chờ đợi cho các khối tương ứng của các tin nhắn được chứng minh trên chuỗi thanh toán (điều này trên thực tế sẽ là một quá trình tốn thời gian rất nhiều).

source: The _Starknet_ messaging, however, is an experimental feature that allows Katana to listen/send messages on a Starknet chain. It attempts to replicate the behaviour of Ethereum messaging but with a Starknet chain as the settlement layer. This is achieved by having Katana listen to the Starknet chain for new blocks and then sending the messages to the settlement chain for consumption. This is an experimental and opinionated feature, and is not recommended for production use.
cn: “Starknet”消息传输，但是，是一个实验性功能，允许Katana在Starknet链上监听/发送消息。它尝试复制以太坊消息传输的行为，但使用Starknet链作为结算层。这是通过让Katana监听Starknet链以获取新区块，然后将消息发送到结算链以供使用来实现的。这是一个实验性和主观的功能，不建议用于生产环境。
jp: しかし、StarknetメッセージングはKatanaがStarknetチェーン上でメッセージの受信/送信を可能にする実験的な機能です。これは、スティールチェーンを決済層として使用しつつ、Ethereumメッセージングの振る舞いを再現する試みです。Katanaは新しいブロックをStarknetチェーンで受信し、その後メッセージを決済チェーンに送信して消費します。これは実験的な機能であり、本番環境での使用は推奨されません。
lt: The _Starknet_ messaging, tamen, est experimentale attributum quod permit Katana auscultare/mittere nuncios in catenam Starknet. Conatur imitari modum nuntiandi Ethereum sed cum catena Starknet veluti strato solutionis. Hoc fit ut Katana auscultat catenam Starknet ad novos trutos et deinde nuncios mittit ad catenam solutionis ad usurpationem. Hoc est experimentale et opinabile attributum et non commendatur ad usum productionis.
vi: Tin nhắn _Starknet_, tuy nhiên, là một tính năng thử nghiệm cho phép Katana nghe/gửi tin nhắn trên chuỗi Starknet. Nó cố gắng sao chép hành vi của tin nhắn Ethereum nhưng với chuỗi Starknet làm lớp thanh toán. Điều này được đạt được bằng cách cho Katana nghe chuỗi Starknet để tìm kiếm các khối mới và sau đó gửi tin nhắn đến chuỗi thanh toán để sử dụng. Đây là một tính năng thử nghiệm và chủ quan, và không được khuyến nghị sử dụng trong sản xuất.

source: The messaging config file is a JSON file that contains the following fields:
cn: 消息配置文件是一个JSON文件，包含以下字段：
jp: メッセージングの設定ファイルは、以下のフィールドを含むJSONファイルです。
lt: "Configuratio nuntiorum est lima JSON quae sequentes campos continet:"
vi: Tập tin cấu hình tin nhắn là một tập tin JSON chứa các trường sau:

source: /// The type of messaging service to use. Can be either "ethereum" or "starknet". "chain"
cn: 消息服务的类型要使用。可以是“以太坊”或“斯塔克网”。 “链”
jp: メッセージングサービスの使用方法のタイプ。"ethereum"または"starknet"のいずれかを選択できます。 "chain"
lt: /// Genus ministerii messaging adhibendum. Potest autem esse vel "ethereum" vel "starknet". "catena"
vi: Loại dịch vụ tin nhắn để sử dụng. Có thể là "ethereum" hoặc "starknet". "chuỗi"

source: "ethereum"
cn: 以太坊
jp: イーサリアム (īsariamu)
vi: "ethereum" -> "ethereum"

source: /// The RPC-URL of the settlement chain. "rpc_url"
cn: ///定居链的RPC-URL。 "rpc_url"
jp: /// 解決チェーンのRPC-URL。 "rpc_url"
lt: /// URL-adeptus rei publicae chainae. "rpc_url"
vi: /// RPC-URL của chuỗi định cư. "rpc_url"

source: "http://127.0.0.1:8545"
cn: "网址：http://127.0.0.1:8545"
jp: 「http://127.0.0.1:8545」を日本語に翻訳すると、「http://127.0.0.1:8545」となります。

source: /// The messaging-contract address on the settlement chain. "contract_address"
cn: 合约地址
jp: /// メッセージング契約のアドレスは清算チェーン上にあります。 "contract_address"
lt: Ad locum conductionis mandatōrum in catena solutionis. "locus_contractus"
vi: Địa chỉ hợp đồng thông điệp trên chuỗi thanh toán. "địa_chỉ_hợp_đồng"

source: "0x5FbDB2315678afecb367f032d93F642f64180aa3"
cn: "0x5FbDB2315678afecb367f032d93F642f64180aa3" 对应的中文翻译。
jp: 「0x5FbDB2315678afecb367f032d93F642f64180aa3」を日本語に翻訳すると、「0x5FbDB2315678afecb367f032d93F642f64180aa3」となります。
lt: "0x5FbDB2315678afecb367f032d93F642f64180aa3" Imus et transitus
vi: "0x5FbDB2315678afecb367f032d93F642f64180aa3" => "0x5FbDB2315678afecb367f032d93F642f64180aa3"

source: /// The address to use for settling messages. It should be a valid address that /// can be used to send a transaction on the settlement chain. "sender_address"
cn: 用于结算消息的地址。它应该是一个有效的地址，可以用来在结算链上发送交易。"发送者地址"
jp: 送信者のアドレス
lt: /// Ad usum epistularum sedandarum adhibenda est. Sit ad usum legitimum quod /// adhiberi potest ad transactionem in catena solutionis mittendam. "adres emitentis"
vi: Địa chỉ để sử dụng để giải quyết tin nhắn. Nó phải là một địa chỉ hợp lệ có thể được sử dụng để gửi giao dịch trên chuỗi giải quyết. "địa chỉ người gửi"

source: "0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266"
cn: "0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266" 的译文
jp: 「0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266」を日本語に翻訳すると、「0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266」となります。
vi: "0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266" được dịch thành "0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266" trong tiếng Việt.

source: /// The private key associated to `sender_address`. "private_key"
cn: 私钥与“发件人地址”相关。 "私钥"
jp: /// `sender_address` に関連付けられた秘密鍵。 "private_key"
lt: Clavis privata coniuncta ad `mittentis_adressem`. "clavis_privata"
vi: Khóa riêng tư liên kết với `địa chỉ người gửi`. "private_key"

source: "0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80"
cn: "0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80" translates to "0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80" in Chinese.
jp: 「0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80」を日本語に翻訳すると、「0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80」となります。
vi: "0xac0974bec39a17e36ba4a6b4d238ff944bacb478cbed5efcae784d7bf4f2ff80" (Note: This is a hexadecimal number and may not have a direct translation in Vietnamese)

source: /// The interval, in seconds, at which the messaging service will fetch and settle messages /// from/to the settlement chain. "interval"
cn: /// 以秒为单位的时间间隔，在此间隔内，消息服务将获取和处理结算链上的消息。 "间隔"
jp: /// メッセージングサービスがメッセージを取得し、決済チェーンに解決する間隔（秒単位） "インターバル"
lt: Interval, in secundis, in quo servitium nuntiorum nuntia suscipiet et concludet elucidationem a/ad catenam settlement.
vi: Khoảng thời gian, tính bằng giây, mà dịch vụ nhắn tin sẽ lấy và giải quyết các tin nhắn từ/đến chuỗi giải quyết. "Khoảng cách"

source: /// The block on settlement chain from where Katana will start fetching messages. "from_block"
cn: 起始区块链上的阻塞，卡塔纳将从这里开始获取消息。 "from_block"
jp: /// カタナがメッセージを取得し始める解決チェーンのブロック。 "from_block"
lt: /// Parietes in catena seditionis ex qua Katana incipiet nuntios petere. "from_block"
vi: Khối trên chuỗi giải quyết từ nơi mà Katana sẽ bắt đầu lấy tin nhắn. "từ khối"

source: Supported Transport Layers
cn: 支持的传输层
jp: サポートされているトランスポート層
lt: Strata vecturae sustentatae
vi: Các lớp vận chuyển được hỗ trợ

source: Only HTTP connection is supported at the moment. The server listens on port 5050 by default, but it can be changed by running the following command:
cn: 目前只支持HTTP连接。服务器默认监听5050端口，但可以通过运行以下命令进行更改：
jp: 現時点では、HTTP接続のみがサポートされています。サーバーはデフォルトでポート5050でリッスンしますが、以下のコマンドを実行することで変更することができます。 ただし、日本語においては「サーバーはデフォルトでポート5050でリッスンします」のような表現は一般的ではないため、より自然な表現に変更しています。
lt: Tantum coniunctio HTTP momento supportatur. Servitor audit in portu quingentorum et quinquaginta moribus, sed potest mutari per sequens imperium:
vi: Chỉ kết nối HTTP được hỗ trợ trong thời điểm hiện tại. Máy chủ lắng nghe trên cổng 5050 theo mặc định, nhưng nó có thể được thay đổi bằng cách chạy lệnh sau:

source: Starknet Feature Compatibility
cn: Starknet特性兼容性
jp: スタークネットの機能互換性
lt: Compatibilitas Starknet Operationis
vi: Tính năng tương thích với Starknet

source: Supported Transaction Type
cn: 支持的交易类型
jp: サポートされるトランザクションのタイプ
lt: "Typus Tractationis Sustinendae"
vi: Loại giao dịch được hỗ trợ

source: Type
cn: 类型
jp: タイプ
lt: Typus
vi: Loại hình

source: Version
cn: 版本
jp: バージョン
lt: Versio
vi: Phiên bản

source: INVOKE
cn: 唤起
jp: 喚起 (kanki)
lt: INVOCARE
vi: KÍCH HOẠT

source: DECLARE
cn: 宣布
jp: 宣言する (sengen suru)
lt: Adfirma
vi: TUYÊN BỐ

source: DEPLOY_ACCOUNT
cn: 部署帐户
jp: デプロイアカウント
lt: DEPLOY_ACCOUNT = DEPONE DEPOSITUM
vi: Triển khai tài khoản

source: Supported RPC Methods
cn: 支持的RPC方法
jp: サポートされているRPCメソッド
lt: Methodi RPC Sustentatae
vi: Phương thức RPC được hỗ trợ

source: Starknet Methods
cn: Starknet 方法
jp: スタークネットメソッド
lt: Starknet methodis
vi: Phương pháp Starknet

source: Katana supports version **v0.3.0** of the Starknet JSON-RPC specifications. The standard methods are based on [this](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) reference.
cn: Katana支持Starknet JSON-RPC规范的**v0.3.0**版本。标准方法基于[此](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)参考。
jp: この文を日本語に翻訳すると、以下のようになります。 Katanaは、Starknet JSON-RPC仕様のバージョン**v0.3.0**をサポートしています。標準のメソッドは、[こちら](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)のリファレンスに基づいています。
lt: Katana versionem **v0.3.0** specificationibus Starknet JSON-RPC sustinet. Methodi standardum ex [hoc](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) reference fundantur.
vi: Katana hỗ trợ phiên bản **v0.3.0** của các thông số kỹ thuật JSON-RPC của Starknet. Các phương pháp tiêu chuẩn dựa trên [đây](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) làm tài liệu tham khảo.

source: `starknet_blockNumber`
cn: Starknet 区块编号
jp: スタークネットブロック番号
lt: Numerus_blockStarknet
vi: `starknet_blockNumber` -> `starknet_blockNumber`

source: `starknet_blockHashAndNumber`
cn: Starknet区块哈希和编号
jp: スタークネットブロックハッシュと番号
lt: starknet_blockHashAndNumber => StarkNet bloccus hash et numerus

source: `starknet_getBlockWithTxs`
cn: `starknet_getBlockWithTxs`的中文翻译
jp: `starknet_getBlockWithTxs` を日本語に翻訳すると、`starknet_getBlockWithTxs` となります。
vi: `starknet_getBlockWithTxs` -> `starknet_getBlockWithTxs`

source: `starknet_getBlockWithTxHashes`
cn: `starknet_getBlockWithTxHashes` 获取带有交易哈希的区块
jp: `starknet_getBlockWithTxHashes`を日本語に翻訳すると、`starknet_getBlockWithTxHashes`となります。
lt: ObtinereBlockCumTxHashes
vi: `starknet_getBlockWithTxHashes` -> `starknet_getBlockWithTxHashes`

source: `starknet_getBlockTransactionCount`
cn: `starknet_getBlockTransactionCount` -> `starknet_getBlockTransactionCount` (斯塔克网络_获取区块交易数量)
jp: スタークネットの`starknet_getBlockTransactionCount`
lt: starknet_getBlockTransactionCount -> StarkNet_BlockTransactionHumeroConseguere
vi: `starknet_getBlockTransactionCount` translates to `starknet_getBlockTransactionCount` in Vietnamese.

source: `starknet_getTransactionByHash`
cn: `starknet_getTransactionByHash`的中文翻译
jp: `starknet_getTransactionByHash` の翻訳: スタークネットでトランザクションをハッシュによって取得
lt: translatio `starknet_getTransactionByHash`
vi: `starknet_getTransactionByHash` - Lấy giao dịch bằng mã băm

source: `starknet_getTransactionByBlockIdAndIndex`
cn: `starknet_getTransactionByBlockIdAndIndex` starknet_getTransactionByBlockIdAndIndex
jp: `starknet_getTransactionByBlockIdAndIndex` の日本語訳は次の通りです: `starknet_getTransactionByBlockIdAndIndex`
vi: lấyGiaoDịchTheoIdKhốiVàChỉSố

source: `starknet_getTransactionReceipt`
cn: `starknet_getTransactionReceipt`的中文翻译
jp: `starknet_getTransactionReceipt` を日本語に翻訳すると、`starknet_getTransactionReceipt`

source: `starknet_pendingTransactions`
cn: Starknet_pendingTransactions ```javascript ```
jp: スタークネットペンディングトランザクション
lt: translatio: `starknet_pendingTransactions`
vi: các giao dịch đang chờ xử lý trong starknet

source: `starknet_getStateUpdate`
jp: `starknet_getStateUpdate` の日本語訳は「starknetの状態更新を取得する」です。
vi: starknet_getStateUpdate => cập nhật trạng thái starknet

source: `starknet_call`
cn: Starknet调用
jp: スタークネット_コール
lt: `sine rete clamabit`
vi: 'gọi_starknet'

source: `starknet_estimateFee`
cn: `starknet_estimateFee`的中文翻译：starknet_estimateFee
jp: スタークネットの手数料を見積もる (Sutākunetto no tesūryō o mitsumoru)
vi: `starknet_estimateFee` => `starknet_estimateFee`

source: `starknet_chainId`
cn: `starknet_chainId`的中文翻译
jp: スタークネットチェーンID
vi: chuỗi starknet_chainId

source: `starknet_getNonce`
cn: `starknet_getNonce`的翻译
jp: スタークネットのノンスを取得する
lt: Obtainere_arcana_nonae

source: `starknet_getEvents`
cn: `starknet_getEvents` 的中文翻译
jp: スタークネットのイベントを取得する

source: `starknet_getStorageAt`
cn: starknet_getStorageAt Starknet_getStorageAt
jp: `starknet_getStorageAt`を日本語に翻訳すると、`スタークネットのストレージを取得する`となります。
vi: `starknet_getStorageAt` -> "starknet_getStorageAt"

source: `starknet_getClassHashAt`
cn: `starknet_getClassHashAt` "starknet_getClassHashAt"获取类哈希。
jp: `starknet_getClassHashAt`を日本語に翻訳すると、`starknet_getClassHashAt`となります。
vi: `starknet_getClassHashAt` -> `starknet_getClassHashAt`

source: `starknet_getClass`
cn: `starknet_getClass` 的中文翻译
jp: スタークネットの`getClass`
lt: There is no direct translation of "starknet_getClass" into Latin, as it appears to be a specific technical term or code.

source: **`starknet_getClassAt`**
cn: starknet_getClassAt 获取在
jp: **`starknet_getClassAt`** を日本語に翻訳すると、「**`starknet_getClassAt`**」となります。
vi: starknet_getClassAt - lấy lớp tại

source: `starknet_addInvokeTransaction`
cn: `starknet_addInvokeTransaction`的中文翻译。
jp: スタークネットに追加するインボークトランザクション (sutākunetto ni tsuika suru inbōku toranzakushon)
vi: `starknet_addInvokeTransaction` được dịch là "starknet_addInvokeTransaction"

source: `starknet_addDeclareTransaction`
jp: スタークネットの`starknet_addDeclareTransaction`
lt: starknet_addDeclareTransaction - Declaratio Transactio Addere
vi: starknet_addDeclareTransaction -> khai_báo_giao_dịch_starknet

source: `starknet_addDeployAccountTransaction`
cn: Starknet_addDeployAccountTransaction 重要事项：只返回已翻译文本，不要追加其他任何内容。
jp: `starknet_addDeployAccountTransaction`の日本語訳は「starknet_addDeployAccountTransaction」となります。
vi: thực_hiện_thêm_giao_dịch_tài_khoản_triển_khai

source: Custom Methods
cn: 自定义方法
jp: カスタムメソッド
lt: Metodos Consueti
vi: Phương pháp tùy chỉnh

source: Katana provides a convenient set of custom RPC methods to quickly and easily configure the node to suit your testing environment.
cn: Katana提供了一套方便的自定义RPC方法，可以快速轻松地配置节点，以适应您的测试环境。
jp: Katanaは、テスト環境に合わせてノードを簡単かつ迅速に設定するための便利なカスタムRPCメソッドのセットを提供します。
lt: Katana praebet commodum consortium consuetarum RPC methodorum ad celere et facile configurandum nodum ad idoneam probationem ambientem accommodatum.
vi: Katana cung cấp một bộ phương pháp RPC tùy chỉnh thuận tiện để nhanh chóng và dễ dàng cấu hình nút để phù hợp với môi trường thử nghiệm của bạn.

source: `katana_generateBlock` Mine a new block which includes all currently pending transactions.
cn: 刀锋_生成区块 挖掘一个新的区块，其中包括所有当前挂起的交易。
jp: `katana_generateBlock`を日本語に翻訳すると、`katana_新しいブロックを生成する`となります。 現在保留中のすべての取引を含む新しいブロックをマイニングしてください。
lt: Genera novum bloccum qui omnes transactiones expectatae nunc continet.
vi: sinh khối mới chứa tất cả các giao dịch đang chờ xử lý.

source: `katana_nextBlockTimestamp` Get the time for the next block.
cn: 刀_nextBlockTimestamp 获取下一个区块的时间。
jp: 次のブロックの時間を取得するための`katana_nextBlockTimestamp`
lt: Tempus quaere pro proximo bloco.
vi: `katana_nextBlockTimestamp` Lấy thời gian cho khối tiếp theo.

source: `katana_increaseNextBlockTimestamp` Increase the time for the block by a given amount of time, in seconds.
cn: 刀（katana）_增加下一个区块的时间戳 通过给定的时间量（以秒为单位）增加区块的时间。
jp: `katana_increaseNextBlockTimestamp`を日本語に翻訳すると、「次のブロックのタイムスタンプを指定した秒数だけ増加させる」となります。
lt: katana_increaseNextBlockTimestamp Auge tempus block sequentis quantitatem temporis data, in secundis.
vi: Tăng thời gian cho block thêm một lượng thời gian nhất định, tính bằng giây.

source: `katana_setNextBlockTimestamp` Similar to `katana_increaseNextBlockTimestamp` but takes the exact timestamp that you want in the next block.
cn: katana_setNextBlockTimestamp 类似于`katana_increaseNextBlockTimestamp`，但是接受你想要在下一个区块中使用的确切时间戳。
jp: 次のブロックのタイムスタンプを設定します `katana_setNextBlockTimestamp`。 `katana_increaseNextBlockTimestamp` と同様ですが、次のブロックで使用したい正確なタイムスタンプを使用します。
lt: katana_setNextBlockTimestamp simile est `katana_increaseNextBlockTimestamp`, sed capit exactum temporis signaculum quod vis in sequenti cubito.
vi: `katana_setNextBlockTimestamp` Tương tự như `katana_increaseNextBlockTimestamp` nhưng lấy thời gian chính xác mà bạn muốn trong khối tiếp theo.

source: `katana_predeployedAccounts` Get the info for all of the predeployed accounts.
cn: 刀前部署账户的信息
jp: 「katana_predeployedAccounts」の情報を取得してください。
lt: katana_predeployedAccounts Obtine informationem omnium praedepositano contorum.
vi: Lấy thông tin cho tất cả các tài khoản được triển khai trước đó.

source: `katana_setStorageAt` Set an exact value of a contract's storage slot.
cn: katana_setStorageAt 设置合同存储槽的确切值。
jp: `katana_setStorageAt` 契約のストレージスロットの正確な値を設定します。
lt: katana_setStorageAt Ponere exactum valorem in contractui loco repositi.
vi: `katana_setStorageAt` Thiết lập một giá trị chính xác cho khe lưu trữ của hợp đồng.

source: `--silent` Don't print anything on startup.
cn: --silent 启动时不要打印任何内容。
jp: 「--silent」 起動時に何も表示しない。
lt: --tacite Nihil imprime in initio.
vi: `-im lặng`

source: `--no-mining` Disable auto and interval mining, and mine on demand instead.
cn: `--不挖矿` 禁用自动和间隔挖矿，改为按需进行挖矿。
jp: `--no-mining` の意味は、「自動マイニングとインターバルマイニングを無効化し、必要に応じてマイニングを行う」ということです。
lt: --non excutere Disabilita excutionem automaticam et intervale et exca solidum postulante.
vi: `--không-khai-thác` Vô hiệu hóa khai thác tự động và theo khoảng thời gian, và thay vào đó khai thác theo yêu cầu.

source: `-b, --block-time <MILLISECONDS>` Block time in milliseconds for interval mining.
cn: “-b，-- block-time <MILLISECONDS>” 间隔挖矿的毫秒级阻塞时间。
jp: `-b, --block-time <MILLISECONDS>` 間隔マイニングのためのブロック時間（ミリ秒単位）
lt: `-b, - -block-time <MILLISECONDIS>` Tempsus bloccum in millisecondis ad intervallum excavatio.
vi: `-b, --block-time <MILLISECONDS>` Thời gian chặn trong mili giây cho khai thác theo khoảng.

source: `--dump-state <PATH>` Dump the state of chain on exit to the given file. If the value is a directory, the state will be written to `<PATH>/state.bin`.
cn: --dump-state <路径> 在退出时将链的状态转储到给定的文件中。 如果该值是一个目录，则状态将被写入到<路径>/state.bin中。
jp: `--dump-state <PATH>` を日本語に翻訳すると: 終了時にチェーンの状態を指定されたファイルにダンプします。 もし値がディレクトリであれば、状態は `<PATH>/state.bin` に書き込まれます。
lt: --statum-demittere <VIA> Quaere statum catenae in exitu ad scriptorium datum. Si valor sit directum, status erit scriptus ad <VIA>/status.bin.
vi: --dump-state <ĐƯỜNG DẪN> Lưu trạng thái của chuỗi khi thoát vào tệp đã cho. Nếu giá trị là một thư mục, trạng thái sẽ được ghi vào `<ĐƯỜNG DẪN>/state.bin`.

source: `--load-state <PATH>` Initialize the chain from a previously saved state snapshot.
cn: --load-state <路径> 从之前保存的状态快照中初始化链。
jp: 「--load-state <PATH>」は、以前に保存された状態スナップショットからチェーンを初期化します。
lt: --incumbere-statui <VIA>
vi: --load-state <ĐƯỜNG DẪN> Khởi tạo chuỗi từ trạng thái snapshot đã lưu trước đó.

source: `--rpc-url <URL>` The Starknet RPC provider to fork the network from.
cn: `--rpc-url <URL>` 从中分叉网络的Starknet RPC提供程序。
jp: `--rpc-url <URL>`を日本語に翻訳すると、次のようになります： ネットワークをフォークするために使用するStarknet RPCプロバイダのURL。
vi: --rpc-url <URL> Nhà cung cấp RPC Starknet để sao chép mạng từ.

source: `--json-log` Output logs in JSON format.
cn: --json-log 以JSON格式输出日志。
jp: `--json-log` を日本語に訳すと、以下のようになります。 JSON形式でログを出力します。
lt: --json-log Eici logia edere formato JSON.
vi: `--json-log` Ghi nhật ký đầu ra dưới dạng JSON.

source: `--fork-block-number <BLOCK_NUMBER>` Fork the network at a specific block.
cn: “--fork-block-number <BLOCK_NUMBER>” 在特定区块处分叉网络。
jp: `--fork-block-number <BLOCK_NUMBER>` を使って、指定されたブロックでネットワークをフォークします。
lt: --furca-bloccus-numerus <BLOCCUS_NUMERUS>
vi: --fork-block-number <SỐ_BƯỚC_BLOCK> Phân nhánh mạng tại một block cụ thể.

source: `--messaging <PATH>` Configure the messaging service to allow Katana to listen/send messages on a settlement chain that can be either Ethereum or another Starknet sequencer (experimental).
cn: `--消息传输<路径>` 配置消息传输服务，允许Katana在结算链上接收/发送消息，可以是以太坊或其他Starknet序列器（实验性）。
jp: `--messaging <PATH>` を日本語に翻訳すると： カタナがイーサリアムまたは他の Starknet シーケンサ（実験的）のいずれかでメッセージの送受信を行うためにメッセージングサービスを設定します。
lt: --messaging <ITER> Configura servitium nuntiorum ut Katana possit audire/mittere nuntios in catena coloniae quae possit esse vel Ethereum vel sequens Starknet (experimentale).
vi: --tin nhắn <ĐƯỜNG DẪN> Cấu hình dịch vụ nhắn tin để cho phép Katana nghe/gửi tin nhắn trên một chuỗi giải quyết có thể là Ethereum hoặc một sequencer Starknet khác (thử nghiệm).

source: `-h, --help` Print help (see a summary with '-h').
cn: “-h，--帮助” 打印帮助（使用“-h”查看摘要）。
jp: -ヘルプ、-ヘルプ ヘルプを表示します（'-h'で概要を確認）。
lt: -h, --auxilium Imprime auxilium (vide summam cum '-h').
vi: `-h, --help` In ấn trợ giúp (xem tóm tắt với '-h').

source: `-V, --version` Print version information.
cn: - V，--版本 打印版本信息。
jp: `-V、--バージョン` バージョン情報を表示します。
lt: `-V, --versio` Versio informationem imprimere.
vi: `-V, --version` In ấn thông tin phiên bản.

source: Server Options
cn: 服务器选项
jp: サーバーオプション
lt: Optiones servitoris
vi: Tùy chọn máy chủ

source: `-p, --port <PORT>` Port number to listen on. \[default: 5050\]
cn: “-p，--port <端口>” 监听的端口号。【默认：5050】
jp: `-p, --port <PORT>` リッスンするポート番号。 \[デフォルト: 5050\]
lt: `-p, --port <PORT>` Numerus portus audiendi. \[defectum: 5050\]
vi: `-p, --port <CỔNG>` Số cổng để lắng nghe. \[mặc định: 5050\]

source: `--host <HOST>` The IP address the server will listen on.
cn: --主机 <主机> 服务器将侦听的IP地址。
jp: -- ホスト <HOST> サーバーがリッスンする IP アドレス
lt: --host <HOST> Ad litteram IP, quod servitor auscultabit.
vi: --máy chủ <HOST> Địa chỉ IP mà máy chủ sẽ lắng nghe trên.

source: `--seed <SEED>` Specify the seed for randomness of accounts to be predeployed.
cn: --种子 <种子> 指定要预部署的帐户随机性的种子。
jp: `--seed <SEED>` 事前にデプロイされるアカウントのランダム性のシードを指定してください。
lt: --semen <SEMINIS> Indica semen pro randomness of rationem praeexstructam.
vi: --seed <SEED> Chỉ định hạt giống cho sự ngẫu nhiên của các tài khoản sẽ được triển khai trước.

source: `--accounts <NUM>` Number of pre-funded accounts to generate. \[default: 10\]
cn: --账户 <NUM> 生成的预资金账户数量。 \[默认：10\]
jp: `--accounts <NUM>` の日本語訳は、`--accounts <NUM>`です。 生成する事前資金アカウントの数です。[デフォルト: 10]
lt: --rationes <NUM> Numerus rationum praesidiorum generandarum. [defectum: 10]
vi: --accounts <NUM> Số lượng tài khoản được tài trợ trước để tạo ra. [mặc định: 10]

source: `--disable-fee` Disable charging fee for transactions.
cn: --disable-fee 禁用交易费用。
jp: `--disable-fee` の日本語訳: トランザクションの手数料を無効化する。
lt: --disable-pretium Transactiones sine pretio non gravabuntur.
vi: --disable-fee Tắt tính năng tính phí cho giao dịch.

source: Environment Options
cn: 环境选项
jp: 環境オプション (Kankyō opushon)
lt: Optiones Ambientis
vi: Lựa chọn môi trường

source: `--chain-id <CHAIN_ID>` The chain ID. \[default: KATANA\]
cn: --chain-id <CHAIN_ID> 链ID。[默认值：KATANA]
jp: 「--chain-id <CHAIN_ID>」 チェーンIDです。 \[デフォルト: KATANA\]
lt: --catena-id <CATENA_ID> Catena ID. [defectus: KATANA]
vi: --chain-id <CHAIN_ID> Mã chuỗi. \[mặc định: KATANA\]
