Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: `--gas-price <GAS_PRICE>` The gas price.
cn: --气价 <GAS_PRICE> 燃气价格。
jp: 「--gas-price <GAS_PRICE>」 ガスの価格。
lt: --pretium-gas <PRETIUM_GAS>
vi: --giá-gas <GAS_PRICE>

source: `--validate-max-steps <VALIDATE_MAX_STEPS>` The maximum number of steps available for the account validation logic.
cn: --validate-max-steps <VALIDATE_MAX_STEPS> 账户验证逻辑可用的最大步骤数量。
jp: `--validate-max-steps <VALIDATE_MAX_STEPS>`の日本語訳は、`--validate-max-steps <VALIDATE_MAX_STEPS>`です。 アカウントの検証ロジックに利用可能な最大ステップ数です。
lt: --valida-max-spatia <VALIDA_MAX_SPATIA> Maximum numerum spatiorum disponibilium pro ratione validationis rationis.
vi: --validate-max-steps <VALIDATE_MAX_STEPS> Số bước tối đa có sẵn cho logic xác minh tài khoản.

source: `--invoke-max-steps <INVOKE_MAX_STEPS>` The maximum number of steps available for the account execution logic.
cn: --invoke-max-steps <INVOKE_MAX_STEPS> 帐户执行逻辑的可用最大步骤数。
jp: `--invoke-max-steps <INVOKE_MAX_STEPS>`の日本語訳：アカウント実行ロジックで使用可能な最大ステップ数。
lt: --ad maximos progressus <AD_MAXIMOS_PROGRESSUS>
vi: --invoke-max-steps <INVOKE_MAX_STEPS> Số bước tối đa có sẵn cho logic thực thi tài khoản.

source: Shell Completions
cn: 外壳完成
jp: シェル補完
lt: Shell Completions = Complētiones Testūdinis
vi: Hoàn thành Shell

source: `katana` completions shell
cn: 刀剑 完成外壳
jp: `katana` 完成のシェル
lt: completiones conchae `katana`
vi: vũ khí katana hoàn thiện shell

source: Generates a shell completions script for the given shell.
cn: 生成一个为指定的shell生成shell完成脚本。
jp: 指定されたシェル用のシェル補完スクリプトを生成します。
lt: Generat script completions shell para shell datam.
vi: Tạo một kịch bản hoàn chỉnh vỏ sò cho vỏ sò đã cho.

source: Supported shells are:
cn: 支持的外壳有：
jp: サポートされているシェルは次の通りです：
lt: Conchae supportatae sunt:
vi: Các shell được hỗ trợ là:

source: bash
cn: 打击
jp: バッシュ
lt: Please provide the full text that you would like to have translated into Latin.
vi: đấm

source: elvish
cn: 精灵
jp: Elvish refers to a fictional language created by J.R.R. Tolkien, so it cannot be directly translated to Japanese. However, if you are referring to a phrase or sentence specifically from the Elvish language in Tolkien's works, please provide the desired phrase for translation.
lt: elficus
vi: ngôn ngữ Elvish

source: fish
cn: 鱼
jp: 魚 (さかな or とと)
lt: Piscis
vi: Cá

source: powershell
cn: PowerShell PowerShell
jp: パワーシェル
lt: VisViresShell

source: zsh
cn: 抱歉，我只能翻译书籍和小说。
jp: zsh → ゾーシュ
lt: The text "zsh" does not have a direct translation into Latin because it is not a word.

source: Generate shell completions script for `bash` and appends it to a `.bashrc` file:
cn: 为`bash`生成shell自动完成脚本，并将其附加到`.bashrc`文件中：
jp: 「bash」用のシェル補完スクリプトを生成し、`.bashrc` ファイルに追記します。
lt: Scriptum completiones carapacium generare 'bash' et adiungit ad lima '.bashrc':
vi: Tạo tập lệnh hoàn chỉnh cho `bash` và ghi chèn vào tệp `.bashrc`:

source: Create 15 dev accounts and disable transaction fee mechanism
cn: 创建15个开发者账户，并禁用交易手续费机制。
jp: 15個の開発アカウントを作成し、手数料メカニズムを無効にする。
lt: Creare XV rationes administrativorum et commutationum vectigalium mechanisma desistere
vi: Tạo 15 tài khoản phát triển và vô hiệu hóa cơ chế phí giao dịch

source: Set the chain id to `SN_GOERLI` and run the server on port 8545
cn: 将链ID设置为`SN_GOERLI`，并在端口8545上运行服务器。
jp: チェーンIDを `SN_GOERLI` に設定し、サーバーをポート8545で実行してください。
lt: Convallis catenam id ad 'SN_GOERLI' et currere servus in portum 8545.
vi: Thiết lập mã số chuỗi là `SN_GOERLI` và chạy máy chủ trên cổng 8545

source: Load previously stored state and dump the state of this session to a file on shutdown
cn: 加载先前存储的状态并在关闭时将此会话状态转储到文件
jp: 事前に保存された状態を読み込み、セッションの状態をシャットダウン時にファイルに保存してください。
lt: Statum praeservatum antea adfer et statum huius sessionis in archivium eiciendum in clausura.
vi: Nạp trạng thái đã lưu trữ trước đó và ghi trạng thái của phiên làm việc này vào tệp khi tắt máy.

source: Torii - Networking & Indexing
cn: 鸟居-网络和索引
jp: 鳥居 - ネットワーキング＆インデックス化 (Tori - Nettowākingu & Indekkusu-ka)
lt: Torii - Networking & Indexing Torii - Networking & Indexing
vi: Cổng Torii - Mạng lưới & Chỉ mục

source: Torii is an automatic indexer for dojo worlds. Built in rust to be blazingly fast and exceptionally scalable. Torii provides a fully typed, dynamically generated GraphqQL interface and a high performance gRPC api for binding clients to the world state.
cn: 鸟居是道场世界的自动索引器。采用Rust开发，速度极快且可扩展性非常强。鸟居提供完全类型化、动态生成的GraphqQL接口，以及用于将客户端绑定到世界状态的高性能gRPC API。
jp: Toriiは、道場世界向けの自動インデクサです。Rustで構築され、超高速で非常にスケーラブルです。Toriiは、完全に型指定された動的生成されたGraphqQLインターフェースと、高性能なgRPC APIを提供し、クライアントと世界の状態をバインドします。
lt: Torii est indexator automatice pro mundis dojo. Aedificatum in ferrugine ut sit velocissimum et valde scalabile. Torii praebet graphqql interfaciem plene typificatam, dynamice generatam et api gRPC ad altam peritiam, ad nexilium clientium cum statu mundi.
vi: Torii là một bộ chỉ mục tự động cho thế giới dojo. Được xây dựng bằng rust để nhanh chóng và có khả năng mở rộng đáng kể. Torii cung cấp một giao diện GraphqQL được tạo động hoàn toàn kiểu dữ liệu và một ứng dụng gRPC hiệu suất cao để kết nối khách hàng với trạng thái thế giới.

source: Torii leverages world introspection to bootstrap directly from an onchain deployment. Simply run:
cn: 鸟屎利用世界内省，直接从链上部署引导启动。只需运行：
jp: この文を日本語に翻訳すると、「Toriiはワールドインスペクションを利用して、オンチェーンデプロイメントから直接ブートストラップします。単純に実行してください。」となります。
lt: Torii mundum introspectionem adhibet ut directe ex deployment in catenam. Simpliciter exequere:
vi: Torii tận dụng tiên tri thế giới để khởi động trực tiếp từ việc triển khai trên chuỗi. Chỉ cần chạy:

source: You'll have a GraphQL API running at `http://localhost:8080/graphql` and a gRPC api at `http://localhost:8080/grpc`
cn: 您将拥有一个在`http://localhost:8080/graphql`运行的GraphQL API，以及一个在`http://localhost:8080/grpc`运行的gRPC API。
jp: 「`http://localhost:8080/graphql` で実行されるGraphQL APIと `http://localhost:8080/grpc` で実行されるgRPC APIが利用可能です。」
lt: Habebis GraphQL API cursor in `http://localhost:8080/graphql` et api gRPC in `http://localhost:8080/grpc`
vi: Bạn sẽ có một GraphQL API chạy tại `http://localhost:8080/graphql` và một gRPC API tại `http://localhost:8080/grpc`

source: The `torii` binary can be installed via [`dojoup`](../../getting-started/quick-start.md), our dedicated installation package manager.
cn: `torii`二进制文件可以通过[`dojoup`](../../getting-started/quick-start.md)来安装，这是我们专门的安装包管理器。
jp: 「torii」バイナリは、専用のインストールパッケージマネージャーである「dojoup」を介してインストールすることができます。
lt: Torii binarium potest installari per [`dojoup`](../../getting-started/quick-start.md), nostrum manager installationis specialis.
vi: Chương trình nhị phân `torii` có thể được cài đặt thông qua [`dojoup`](../../getting-started/quick-start.md), trình quản lý gói cài đặt chuyên dụng của chúng tôi.

source: If you prefer to install from the source code:
cn: 如果您更喜欢从源代码安装：
jp: ソースコードからインストールする場合は、
lt: Si vis instaurare ex fonte codicum:
vi: Nếu bạn muốn cài đặt từ mã nguồn:

source: This will install Torii and the required dependencies on your local system.
cn: 这将在您的本地系统上安装Torii和所需的依赖项。
jp: これにより、Toriiと必要な依存関係があなたのローカルシステムにインストールされます。
lt: Hoc Torii et necessitates requirunt locali tuo systemati appendent.
vi: Điều này sẽ cài đặt Torii và các phụ thuộc cần thiết trên hệ thống cục bộ của bạn.

source: See the [`torii` Reference](./reference.md) for a complete reference.
cn: 請查閱「torii 參考」，以獲得完整的參考資料。
jp: 完全な参照については、[`torii`リファレンス](./reference.md)を参照してください。
lt: Vide [`torii` Annotationem](./reference.md) ad annotationem completam.
vi: Hãy xem [`tài liệu tham khảo torii`](./reference.md) để biết tham khảo hoàn chỉnh.

source: torii reference
cn: 鸟居参考
jp: 鳥居 (とりい) の参考
lt: Torii adnotatio
vi: tham khảo torii

source: Name
cn: 名称
jp: 名前
lt: Nomen
vi: Tên

source: torii - An automatic indexer and networking layer for a world contract.
cn: 鸥瑞 - 世界合同的自动索引和网络层。
jp: 鳥居 - 世界契約のための自動索引とネットワーキングレイヤー
lt: torii - Index automaticus et stratum networking pro pactione mundi.
vi: cổng torii - Một máy chủ tự động và lớp mạng cho một hợp đồng thế giới.

source: `torii` starts the indexer and exposes GraphQL/gRPC API endpoints. The indexer queries the specified Starknet RPC endpoint for transaction blocks and listens for transactions related to the world contract. These transactions can include component/system registrations, entity state updates, system calls, and events. The parsed data is then stored in a local SQLite database.
cn: `torii`启动索引器并暴露GraphQL/gRPC API端点。索引器查询指定的Starknet RPC端点以获取交易块并侦听与世界合同相关的交易。这些交易可以包括组件/系统注册、实体状态更新、系统调用和事件。然后将解析的数据存储在本地SQLite数据库中。
jp: 「torii」はインデクサを起動し、GraphQL/gRPC APIのエンドポイントを公開します。インデクサは指定されたStarknet RPCエンドポイントに対してトランザクションブロックをクエリし、ワールドコントラクトに関連するトランザクションを監視します。これらのトランザクションには、コンポーネント/システムの登録、エンティティの状態更新、システムコール、イベントなどが含まれます。解析されたデータは、ローカルのSQLiteデータベースに保存されます。
lt: `torii` indexatorem incipit et API GraphQL/gRPC terminos proponit. Indexator queritur ad indicatum terminum Starknet RPC transactionumque buccas audit ad transactiones spectantes ad mundum contractum. Haec transactiones possunt complecti registras componentum/systematis, mutationes status entitatum, voces systematis, et eventus. Data pertracta deinde in locale database SQLite reconditur.
vi: `torii` bắt đầu trình chỉ mục và tiết lộ các điểm cuối API GraphQL/gRPC. Trình chỉ mục truy vấn đầu cuối RPC Starknet cụ thể để các khối giao dịch và lắng nghe các giao dịch liên quan đến hợp đồng thế giới. Những giao dịch này có thể bao gồm đăng ký hệ thống/thành phần, cập nhật trạng thái thực thể, cuộc gọi hệ thống và sự kiện. Dữ liệu đã phân tích sau đó được lưu trữ trong cơ sở dữ liệu SQLite cục bộ.

source: The GraphQL and gRPC API endpoints run in tandem with the indexer, providing custom queries specific to the world contract for client applications.
cn: GraphQL和gRPC API端点与索引器一起运行，为客户端应用程序提供与世界合同特定的自定义查询。
jp: GraphQLとgRPC APIのエンドポイントは、インデクサと連携して動作し、クライアントアプリケーション向けにワールドコントラクトに特化したカスタムクエリを提供します。
lt: API termini GraphQL et gRPC eodem tempore cum indexer currunt, peculiares quaestiones pro applicationibus clientium mundo contractui pertinentes praebentes.
vi: Các đầu cuối API GraphQL và gRPC chạy song song với trình chỉ mục, cung cấp các truy vấn tùy chỉnh cụ thể cho hợp đồng thế giới cho ứng dụng khách hàng.

source: Database URL
cn: 数据库网址
jp: データベースのURL
lt: URL database
vi: URL cơ sở dữ liệu

source: `torii` uses a sqlite database to store indexed data. The database can be stored either in-memory or persistently on the filesystem.
cn: `torii` 使用sqlite数据库来存储索引数据。数据库可以存储在内存中，也可以持久地存储在文件系统中。
jp: 「torii」は、インデックス付きデータを保存するために、SQLiteデータベースを使用します。このデータベースは、メモリ内またはファイルシステム上で永続的に保存することができます。
lt: 'torii' utitur databasi sqlite ad indicia data servanda. Databasus potest memoriā servāri vel in permanentiā in limine terrarum.
vi: `torii` sử dụng cơ sở dữ liệu sqlite để lưu trữ dữ liệu được lập chỉ mục. Cơ sở dữ liệu có thể được lưu trữ trong bộ nhớ hoặc lâu dài trên hệ thống tập tin.

source: The in-memory database is ephemeral and only lasts as long as the indexer is running. This is a fast and simple option to start the indexer for development/testing.
cn: 内存数据库是瞬时的，只能持续到索引器运行。这是一个快速简单的选项，用于启动开发/测试的索引器。
jp: インメモリデータベースは一時的であり、インデクサが動作している間だけ存在します。これは開発/テストのためにインデクサを開始するための迅速で簡単なオプションです。
lt: Database memoriae tam diuturna est quam indexer pergit. Hoc celer optionem simplexque indexer in development/testing incipere.
vi: Cơ sở dữ liệu trong bộ nhớ là tạm thời và chỉ tồn tại trong thời gian indexer đang chạy. Đây là một lựa chọn nhanh và đơn giản để bắt đầu indexer cho việc phát triển / kiểm thử.

source: Persistent storage should be used in production. It relies on the local filesystem for storage.
cn: 持久存储应该在生产中使用。它依赖于本地文件系统进行存储。
jp: 本番環境では永続ストレージを使用する必要があります。それはローカルファイルシステムに依存しています。
lt: Persistent storage should be used in production. It relies on the local filesystem for storage. = Perseverantiam repositum in production uti oportet. Id loci filesystem pro reposito confidit.
vi: Lưu trữ liên tục nên được sử dụng trong sản xuất. Nó phụ thuộc vào hệ thống tệp cục bộ để lưu trữ.

source: Note: If using in-memory db, the memory will be garbage collected after a period of inactivity, causing queries to result in errors. Workaround is to use a persistent database.
cn: 注意：如果使用内存数据库，内存将在一段时间的不活动后被垃圾收集，导致查询结果出现错误。解决方法是使用持久性数据库。
jp: 注意：メモリ内データベースを使用する場合、一定時間の活動停止後にメモリがガベージコレクトされ、クエリがエラーとなる場合があります。問題の回避策は永続データベースを使用することです。
lt: Nota: Si utaris in memoria database, memoria post temporis inactivitatem deleta erit, causans quaestiones in errores resultare. Remedium est uti databasi persistente.
vi: Lưu ý: Nếu sử dụng cơ sở dữ liệu trong bộ nhớ, bộ nhớ sẽ bị thu gom rác sau một khoảng thời gian không hoạt động, làm cho các truy vấn dẫn đến lỗi. Giải pháp tạm thời là sử dụng cơ sở dữ liệu lưu trữ.

source: # Persistent database storage using file indexer.db
cn: # 使用文件索引器.db 进行持久性数据库存储
jp: # ファイルインデクサ.dbを使用した永続的なデータベースストレージ
lt: # Persistent database storage using file indexer.db Database storage persistensia adhibens indicem.vb
vi: Lưu trữ cơ sở dữ liệu liên tục bằng cách sử dụng tệp indexer.db

source: `-w, --world` Address of the world contract to index
cn: `-w，--world` 用于索引世界合同的地址
jp: `-w、--world` ワールド契約のアドレスをインデックス化
lt: `-w, --mundus` Ad mundum contractus ad indicandum
vi: `-w, --world` Địa chỉ của hợp đồng thế giới để chỉ mục

source: `--rpc` Starknet RPC endpoint to use \[default: http//localhost:5050\]
cn: --rpc Starknet RPC端点使用\[默认：http//localhost:5050\]
jp: `--rpc` の日本語への翻訳： StarknetのRPCエンドポイントを使用する\[デフォルト値：http//localhost:5050\]
lt: --rpc Starknet RPC venire uti \[defectus: http//localhost:5050\]
vi: --rpc Điểm cuối RPC của Starknet để sử dụng [mặc định: http//localhost:5050]

source: `-d, --database <DATABASE>` Database filepath (ex: indexer.db) \[default: :memory:\]
cn: - d，--数据库<数据库> 数据库文件路径（如：indexer.db）\[默认：:memory:\]
jp: `-d, --database <DATABASE>` の日本語訳は、以下の通りです: データベースのファイルパス (例: indexer.db) \[デフォルト: :memory:\]
lt: -d, --database <DATABASE> Via ad locum base datarum (ex: indexer.db) [default: :memory:]
vi: `-d, --database <DATABASE>` Đường dẫn cơ sở dữ liệu (ví dụ: indexer.db) [mặc định: :memory:]

source: `-s, --start-block <START_BLOCK>` Specify a block to start indexing from, ignored if stored head exists \[default: 0\]
cn: -s, --start-block <START_BLOCK> 指定要从索引开始的块，如果存储的头存在则被忽略\[默认值：0\]
jp: `-s、--start-block <START_BLOCK>`を日本語に翻訳すると、以下のようになります： 「-s、--start-block <START_BLOCK>」 ブロックの指定された始点をインデックス化するために使用します。保存されたヘッドが存在する場合は無視されます \[デフォルト：0\]
lt: `-s, --start-block <START_BLOCK>` Specificate morem ex quo indexandi ab initio, si existit \[defectus: 0\]
vi: `-s, --start-block <START_BLOCK>` Chỉ định một khối để bắt đầu chỉ số từ, bị bỏ qua nếu đầu đủ tồn tại \[mặc định: 0\]

source: `--allowed-origins <ALLOWED_ORIGINS>` Specify allowed origins for api endpoints (comma-separated list of allowed origins, or "\*" for all) \[default: \*\]
cn: --allowed-origins <ALLOWED_ORIGINS> 指定 API 端点的允许来源（允许来源的逗号分隔列表，或 "\*" 代表所有）\[默认：\*\]
jp: `--allowed-origins <ALLOWED_ORIGINS>` を日本語に翻訳すると、以下のようになります: APIエンドポイントの許可されたオリジンを指定します（許可されたオリジンのカンマ区切りリスト、または"\*"（すべてを表す）） \[デフォルト: \*\]
lt: --origines-allow <ORIGINES_ALLOW> Specificate origines admissas ad extrema API (discriptio divisa per virgula admissarum originum, aut "\*" pro omni) [defectum: \*\]
vi: `--allowed-origins <ALLOWED_ORIGINS>` Chỉ định các nguồn gốc được phép cho các điểm cuối api (danh sách được phân cách bằng dấu phẩy của các nguồn gốc được phép, hoặc "\*" cho tất cả) \[mặc định: \*\]

source: `--external-url <EXTERNAL_URL>` The external url of the server, used for configuring the GraphQL Playground in a hosted environment
cn: --external-url <EXTERNAL_URL> 用于在托管环境中配置 GraphQL Playground 的服务器外部 URL
jp: 「--external-url <EXTERNAL_URL>」 サーバーの外部URLは、ホスト環境でGraphQL Playgroundを設定するために使用されます。
lt: --external-url <EXTERNAL_URL> URL externa serveris, ad configurandum GraphQL Ludospatium in hospitio ambiente
vi: --external-url <EXTERNAL_URL> URL ngoại vi của máy chủ, được sử dụng để cấu hình GraphQL Playground trong môi trường được lưu trữ

source: `-h, --help` Print help
cn: - h，-- help 打印帮助
jp: `-h, --help` の日本語への翻訳は、`-h、--help` ヘルプを表示する です。
lt: -h, --auxilium Imprimere auxilium
vi: `-h, --help` In ấn trợ giúp

source: `-V, --version` Print version
cn: - V，--版本 打印版本
jp: `-V, --version` の場合、バージョンを印刷します。
lt: -nulla-; Versión imprímere
vi: `-V, --phiên bản` In ấn phiên bản

source: Torii - GraphQL
cn: 鸟居 - GraphQL
jp: 鳥居 - グラフQL
lt: Latin Translation: Torii - GraphQL
vi: Cổng Torii - GraphQL

source: In Dojo, you have access to custom queries and subscriptions that are specifically designed to work with the `caller` for client applications. GraphQL is the technology that makes this possible.
cn: 在 Dojo 中，您可以访问专门设计用于与客户端应用程序的“调用者”配合工作的自定义查询和订阅。GraphQL 是使这一切成为可能的技术。
jp: 道場では、クライアントアプリケーションの「呼び出し元」に特化したカスタムクエリとサブスクリプションへのアクセスが可能です。これは、GraphQLという技術によって実現されています。
lt: In Dojo, habes aditum ad quaestiones consuetas et subnotationes quae sunt ad id configurata ut cum `adpellante` pro applicationibus clientium operentur. GraphQL est technologia quae hoc facit possibile.
vi: Ở Dojo, bạn có quyền truy cập vào các truy vấn và đăng ký tùy chỉnh được thiết kế đặc biệt để hoạt động với `caller` cho các ứng dụng khách. GraphQL là công nghệ làm cho điều này trở nên có thể.

source: GraphQL is the rising star of backend technologies. It replaces REST as an API design paradigm and is becoming the new standard for exposing the data and functionality of a web server. It allows you to specify exactly what data you want to retrieve, and it delivers that data in a structured JSON format. This flexibility in data retrieval ensures that you get the information you need efficiently and in a format that's easy to work with.
cn: GraphQL是后端技术的新兴之星。它取代了REST作为API设计范式，正在成为暴露Web服务器数据和功能的新标准。它允许您精确指定要检索的数据，并以结构化的JSON格式提供该数据。数据检索的灵活性确保您高效地获取所需信息，并以易于处理的格式提供。
jp: GraphQLは、バックエンド技術の新星です。それはAPIデザインの枠組みとしてRESTを置き換え、ウェブサーバーのデータと機能を公開する新たな標準となっています。GraphQLでは、取得したいデータを正確に指定し、それを構造化されたJSON形式で提供することができます。データの取得におけるこの柔軟性は、効率的に必要な情報を取得し、作業しやすい形式で提供します。
lt: GraphQL est sidus crescente backend technologiae. Il mutat REST ut API design paradigma et fit novum exemplar exponens data et functionem web server. Id vobis permittit specifice exacte quae data cupis abducere, et dat data in JSON ratione. Haec flexibilitas in data abducere assecurat vos adipisci informationem necessariam efficienter et in forma quae facilis est operari.
vi: GraphQL là ngôi sao đang nổi của các công nghệ backend. Nó thay thế REST như một mô hình thiết kế API và đang trở thành tiêu chuẩn mới để tiết lộ dữ liệu và chức năng của một máy chủ web. Nó cho phép bạn chỉ định chính xác dữ liệu bạn muốn lấy về, và nó cung cấp dữ liệu đó dưới dạng JSON có cấu trúc. Sự linh hoạt này trong việc lấy dữ liệu đảm bảo rằng bạn có được thông tin mà bạn cần một cách hiệu quả và trong một định dạng dễ làm việc.

source: GraphQL Playground
cn: GraphQL游乐场
jp: GraphQL プレイグラウンド
lt: Ludus GraphQL
vi: Sân chơi GraphQL

source: GraphQL Playground is a `GraphQL IDE` that allows you to interactively explore the functionality of a GraphQL API by sending queries and mutations to it. It’s somewhat similar to Postman which offers comparable functionality for REST APIs.
cn: GraphQL Playground 是一个 `GraphQL IDE`，允许您通过发送查询和变异来交互地探索 GraphQL API 的功能。它与为 REST API 提供可比功能的 Postman 有些相似。
jp: GraphQL Playgroundは、GraphQL APIの機能を対話的に探索し、クエリとミューテーションを送信することができる「GraphQL IDE」です。これは、REST APIに対して同様の機能を提供するPostmanといくぶん似ています。
lt: Ludum GraphQL est IDE `GraphQL` qui possit vos explorare functionality de API GraphQL interactione cum queries et mutationes. Est simillimum Postman quod comparabilem functionality praebet REST API.
vi: Trò chơi GraphQL là một `GraphQL IDE` cho phép bạn tương tác khám phá chức năng của một GraphQL API thông qua việc gửi truy vấn và biến đổi đến nó. Nó hơi giống Postman, một công cụ cung cấp chức năng tương tự cho các REST API.

source: Pre-requisites
cn: 先决条件
jp: 前提条件
vi: Yêu cầu tiên quyết

source: Make sure torii is running in your local terminal.
cn: 确保在您的本地终端上运行鸟居。
jp: ローカルターミナルで鳥居が実行されていることを確認してください。 (Rōkaru tāminaru de torii ga jikkō sa rete iru koto o kakunin shite kudasai.)
lt: Verifica ut torii in termino locali tuo currat.
vi: Đảm bảo torii đang chạy trong terminal cục bộ của bạn.

source: It starts GraphQL server at `http://0.0.0.0:8080/graphql`
cn: 它在`http://0.0.0.0:8080/graphql`上启动GraphQL服务器。
jp: 「http://0.0.0.0:8080/graphql」でGraphQLサーバーが起動します。
lt: Iuvat GraphQL servum apud `http://0.0.0.0:8080/graphql`
vi: Bắt đầu máy chủ GraphQL tại `http://0.0.0.0:8080/graphql`

source: After the torii server starts on your local machine, you're ready to make query and subscription operations.
cn: 在您的本地机器上启动鸟居服务器后，您就可以开始查询和订阅操作。
jp: ローカルマシンでtoriiサーバーが起動したら、クエリとサブスクリプションの操作が可能です。
lt: Postquam servitor torii in machina tua locali incipit, paratus es ad operationes quaerendi et subscriptionis faciendas.
vi: Sau khi máy chủ torii bắt đầu trên máy cục bộ của bạn, bạn đã sẵn sàng thực hiện các thao tác truy vấn và đăng ký.

source: Schema and query defintions
cn: 架构和查询定义
jp: スキーマとクエリの定義
lt: Definitiones schematis et quaestionis
vi: Định nghĩa Schema và truy vấn

source: Torii generates both the schema and queries at runtime specific to your world. There are mainly two groups of queries, predefined queries and dynamically generated custom queries.
cn: Torii在运行时生成特定于您的世界的架构和查询。主要有两组查询：预定义查询和动态生成的自定义查询。
jp: 鳥居はランタイムであなたの世界に合わせたスキーマとクエリの両方を生成します。主に2つのクエリグループがあります。事前定義されたクエリと動的に生成されるカスタムクエリです。
lt: Torii generate has schematibus et quaeritur ad tempus specialis vestri mundi. Praecipue duae gruppi quaestiones sunt, praedefinitae quaestiones et quaestiones generatae custom dynami certatim.
vi: Cổng Torii tạo ra cả schema và các truy vấn tại thời điểm chạy cụ thể cho thế giới của bạn. Có chủ yếu hai nhóm truy vấn, truy vấn được xác định trước và truy vấn tùy chỉnh được tạo ra động.

source: Predefined queries like `entities` provide a generic entry point to the entities data of the world. Custom queries on the other hand are built according to the models of the world. Each model has a correpsonding `{name}Models` query and retrieves the associated model data. For example: `positionModels`.
cn: 预定义的查询，比如“entities”，提供了一个通用的入口点，用来访问世界上的实体数据。另一方面，定制的查询根据世界的模型构建而成。每个模型都有一个对应的“{name}模型”查询，并检索相关的模型数据。例如：“positionModels”。
jp: 事前定義されたクエリーである `entities` のようなものは、世界の実体データへの一般的なエントリーポイントを提供します。一方、カスタムクエリーは世界のモデルに基づいて構築されます。各モデルには対応する `{name}Models` クエリーがあり、関連するモデルデータを取得します。例えば： `positionModels`。
lt: Quaerunt praefinitae ut 'entitates' generem ineunt ad res entium mundi. Interim quaestiones consuetas ad modos mundi aedificantur. Singuli modelli habent `quodnam` Modellos quaestum et adsignat res admodi coniunctas trahit. Exemplo: `locatioModellos`.
vi: Các truy vấn được xác định trước như `entities` cung cấp một điểm nhập chung đến dữ liệu thực thể của thế giới. Truy vấn tùy chỉnh, ååå atlogmibw theard trong khi được xây dựng theo các mô hình của thế giới. Mỗi mô hình có một truy vấn tương ứng `{name}Models` và truy xuất dữ liệu mô hình liên quan. Ví dụ: `positionModels`.

source: The benefit of custom queries becomes apparent when filtering and sorting is needed. They allow much more finer control of the returned dataset.
cn: 自定义查询的好处在需要过滤和排序时变得明显。它们允许对返回的数据集有更加精细的控制。
jp: カスタムクエリの利点は、フィルタリングやソートが必要な場合に明らかになります。それらは返されたデータセットのより細かな制御を可能にします。
lt: Utilitas quaestionum consuetarum manifestatur cum opus sit exfiltratione et ordinatione. Maiorem facultatem praebent ad dataset reditum.
vi: Lợi ích của các truy vấn tùy chỉnh trở nên rõ ràng khi cần lọc và sắp xếp. Chúng cho phép kiểm soát tinh xảo hơn của bộ dữ liệu trả về.

source: Query operation
cn: 查询操作
jp: クエリ操作 (Kuēri sōsa)
lt: Operationem interrogandi
vi: Hoạt động truy vấn
