Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: Or, by manually building from a local copy of the [Dojo repository](https://github.com/dojoengine/dojo):
cn: 或者，通过手动从本地副本的[Dojo存储库](https://github.com/dojoengine/dojo)构建：
jp: または、[Dojoリポジトリ](https://github.com/dojoengine/dojo)のローカルコピーから手動でビルドすることによって。
lt: Aut, vel manu constructum ex locali exemplari [repositorii Dojo](https://github.com/dojoengine/dojo):
vi: Hoặc, bằng cách xây dựng thủ công từ bản sao cục bộ của [thư viện Dojo](https://github.com/dojoengine/dojo):

source: # clone the repository
cn: # 克隆存储库
jp: ＃リポジトリをクローンする
lt: # clona repositoryium
vi: sao chép kho lưu trữ

source: # install Sozo
cn: #安装Sozo
jp: ＃ソゾをインストール
lt: Installe Sozo
vi: # cài đặt Sozo

source: # install Katana
cn: # 安装Katana
jp: # カタナをインストール
lt: # installa Katana
vi: # cài đặt Katana

source: # install Torii
cn: 安装Torii
jp: ＃Toriiをインストールする
lt: # installare Torii
vi: # cài đặt Torii

source: This is a guide to setting up a development environment for Dojo. It is not suggested to follow this guide if you are just wanting to play with the toolchain. We strongly suggest following the [Quick Start](../getting-started/quick-start.md) guide.
cn: 这是一个关于为Dojo设置开发环境的指南。如果你只是想玩玩工具链，我们不建议你按照这个指南进行操作。我们强烈建议按照[快速入门](../getting-started/quick-start.md)指南进行操作。
jp: これはDojoの開発環境を設定するためのガイドです。ツールチェーンを試すだけの場合は、このガイドに従うことはお勧めできません。[クイックスタート](../getting-started/quick-start.md)ガイドの従うことを強くお勧めします。
lt: Hoc est ductus ad instaurandum environmentum developmentis pro Dojo. Non suadetur hunc ductum sequi si modo ludere vis cum instrumento. Fortiter suademus sequi ductum [Quick Start](../getting-started/quick-start.md).
vi: Đây là hướng dẫn cài đặt môi trường phát triển cho Dojo. Không khuyến nghị theo hướng dẫn này nếu bạn chỉ muốn chơi với công cụ. Chúng tôi mạnh mẽ đề xuất theo hướng dẫn [Bắt đầu Nhanh](../getting-started/quick-start.md).

source: [Rust](https://github.com/rust-lang/rust)
cn: [Rust](https://github.com/rust-lang/rust)的翻译
jp: [Rust](https://github.com/rust-lang/rust) を日本語に翻訳してください
lt: Ferrugo
vi: [Rust](https://github.com/rust-lang/rust) Rust (https://github.com/rust-lang/rust)

source: [Cairo](https://github.com/starkware-libs/cairo)
cn: 开罗
jp: [カイロ](https://github.com/starkware-libs/cairo) (Kairo)
lt: nulla
vi: Cairo (https://github.com/starkware-libs/cairo) => Cairo (https://github.com/starkware-libs/cairo)

source: [protoc](https://github.com/protocolbuffers/protobuf)
cn: [Protobuf](https://github.com/protocolbuffers/protobuf) 的消息
jp: [Protoc](https://github.com/protocolbuffers/protobuf)を日本語に翻訳してください。
lt: protoc
vi: Thông điệp cần dịch: [protoc](https://github.com/protocolbuffers/protobuf)

source: Guide
cn: 指南
jp: ガイド
lt: Ductor
vi: Hướng dẫn

source: Clone
cn: 克隆
jp: クローン (Kurōn)
lt: Clona
vi: sao chép

source: Linux & Mac
cn: Linux 和 Mac
jp: リナックス＆マック
lt: Linux & Mac Linux & Mac
vi: Linux & Mac Linux & Mac

source: 1. Install Rust and Dependencies
cn: 安装 Rust 和依赖项
jp: 1. ラストと依存関係をインストールしてください。 (Rasuto to izonkankei o insutōru shite kudasai.)
lt: 1. Installe Rust et Dependences
vi: 1. Cài đặt Rust và các phụ thuộc

source: Start by installing Rust and running the test suite to confirm your setup:
cn: 开始安装Rust，并运行测试套件来确认您的设置：
jp: 最初にRustをインストールし、動作確認のためにテストスイートを実行してください。
lt: Incipe a ferrugineo collocando et experimento congerie ut confirmes formatum tuum:
vi: Bắt đầu bằng việc cài đặt Rust và chạy bộ kiểm tra để xác nhận cài đặt của bạn:

source: Note: Depending on your Linux distribution, you may need to install additional dependencies. Make sure to install any suggested or missing dependencies that arise during the setup process.
cn: 注意：根据您的Linux发行版，您可能需要安装额外的依赖项。确保在安装过程中安装任何建议的或缺失的依赖项。
jp: 注：Linuxディストリビューションによっては、追加の依存関係をインストールする必要がある場合があります。セットアッププロセス中に生じる推奨されたまたは欠落している依存関係をインストールするようにしてください。
lt: Nota: Pro pudet tua distributio Linux, opus est installare adiecta necessitates. Cura ut installent quaecumque consilii aut carent adiecta necessitates quae surgunt durante serie.
vi: Lưu ý: Tùy thuộc vào bản phân phối Linux của bạn, bạn có thể cần cài đặt các phụ thuộc bổ sung. Đảm bảo cài đặt bất kỳ phụ thuộc được đề xuất hoặc thiếu nào phát sinh trong quá trình thiết lập.

source: 2. Install Scarb Package Manager
cn: 2. 安装Scarb软件包管理器
jp: 2. Scarbパッケージマネージャーをインストールしてください。
lt: 2. Installe Scarb Package Manager
vi: 2. Cài đặt Quản lý Gói Scarb

source: Next, install the [Scarb](https://docs.swmansion.com/scarb) package manager by running:
cn: 接下来，通过运行以下命令安装[Scarb](https://docs.swmansion.com/scarb)软件包管理器：
jp: 次に、以下のコマンドを実行して、[Scarb](https://docs.swmansion.com/scarb) パッケージマネージャーをインストールしてください：
lt: Deinde, installa [Scarb](https://docs.swmansion.com/scarb) religens administratorem per cursorem:
vi: Tiếp theo, cài đặt trình quản lý gói [Scarb](https://docs.swmansion.com/scarb) bằng cách chạy:

source: '=https'
cn: '=https'的翻译
jp: '=https'を日本語に翻訳すると、'=https'となります。
lt: '=https' - non est verbum Latinum, ideo non potest vertere.
vi: '=https' => '=https'

source: 3. Add the Cairo 1.0 VSCode Extension
cn: 3. 添加开罗1.0 VSCode扩展
jp: 3. Cairo 1.0のVSCode拡張機能を追加してください。
lt: 3. Add the Cairo 1.0 VSCode Extension Translate to latin: 3. Addere Cairo 1.0 Expansionem VSCode
vi: 3. Thêm Phần Mở Rộng Cairo 1.0 cho VSCode

source: Install the [Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) extension for Visual Studio Code.
cn: 在Visual Studio Code中安装[Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)扩展。
jp: Visual Studio Codeに[Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1)拡張機能をインストールしてください。
lt: Installe [Cairo 1.0] (https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) extensionem ad Visual Studio Code.
vi: Cài đặt tiện ích mở rộng [Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) cho Visual Studio Code.

source: Windows
cn: 窗户
jp: ウィンドウズ (Windo-zu)
lt: Fenestrae
vi: Cửa sổ

source: _Coming soon_
cn: 即将推出
jp: まもなく登場します
lt: _Proxime venturum_
vi: Sẽ sớm ra mắt

source: Container
cn: 容器
jp: コンテナ (Kontena)
lt: Repositorium
vi: Thùng chứa

source: Contributing to the Core
cn: 贡献核心
jp: コアへの貢献
lt: Contribuens ad nucleum
vi: Đóng góp vào nhân hạnh

source: Dojo is an open-source project, currently in its early development phase, and warmly welcomes contributors.
cn: 武道馆是一个开源项目，目前正处于早期发展阶段，并热烈欢迎贡献者。
jp: 道場（どうじょう）は、オープンソースプロジェクトであり、現在早期開発段階にあり、積極的に貢献者を歓迎しています。
lt: Dojo est proiectum open-source, nunc in suis primis phasis developmentis, et libenter susceptores accipit.
vi: Dojo là một dự án mã nguồn mở, hiện đang ở giai đoạn phát triển ban đầu và rất hoan nghênh những người đóng góp.

source: How to Contribute
cn: 如何进行贡献
jp: 貢献の方法
lt: Quomodo contribuere
vi: Cách đóng góp

source: Head to the [Github](https://github.com/dojoengine/dojo/issues) for open issues, if you see an issue that is unassigned, please request in the comments to be assigned to it. If you have an idea for a new feature, please create an issue with the `enhancement` tag.
cn: 前往[Github](https://github.com/dojoengine/dojo/issues)查看开放问题，如果您发现一个未被分配的问题，请在评论中请求分配给您。如果您有新功能的想法，请使用`enhancement`标签创建一个问题。
jp: 以下のリンクから[GitHub](https://github.com/dojoengine/dojo/issues)に移動して、オープンな課題を確認してください。もし未割り当ての課題を見つけた場合は、コメントで割り当てを依頼してください。新しい機能のアイデアがある場合は、`enhancement` タグを付けて課題を作成してください。
lt: Ad [githubium](https://github.com/dojoengine/dojo/issues) pro rebus aperiendis ire, si rem non assignatam videris, roga in commentariis ut tibi assignetur. Si consilium novum propter speciem novam habes, rem creari cum notula "augmento" rogito.
vi: Hãy đến [Github](https://github.com/dojoengine/dojo/issues) để xem các vấn đề mở, nếu bạn thấy một vấn đề chưa được gán, vui lòng yêu cầu trong phần bình luận để được gán cho nó. Nếu bạn có ý tưởng cho một tính năng mới, vui lòng tạo một vấn đề với nhãn `enhancement`.

source: [Community Hub](https://dojoengine.notion.site/Dojo-Engine-Community-Hub-d316194b998941c48ddf771a4dd5ff08#bcd6a32db1b2406cb6c325f3b700d45a)
cn: 社区中心: [社区工作站](https://dojoengine.notion.site/Dojo-Engine-Community-Hub-d316194b998941c48ddf771a4dd5ff08#bcd6a32db1b2406cb6c325f3b700d45a)
jp: コミュニティハブ
lt: Centrum Communitatis
vi: Trung tâm cộng đồng

source: [Discord](https://discord.gg/KG9w9BmDrV)
cn: [Discord](https://discord.gg/KG9w9BmDrV)的信息
jp: [ディスコード](https://discord.gg/KG9w9BmDrV)
vi: [Discord](https://discord.gg/KG9w9BmDrV) - [Discord](https://discord.gg/KG9w9BmDrV)

source: [Twitter](https://twitter.com/dojostarknet)
cn: 推特
jp: [ツイッター](https://twitter.com/dojostarknet)
lt: Twitter adhibere gratias!
vi: [Twitter](https://twitter.com/dojostarknet) -> [Twitter](https://twitter.com/dojostarknet)

source: [Awesome Dojo](https://github.com/dojoengine/awesome-dojo)
cn: 令人敬畏的道场 (https://github.com/dojoengine/awesome-dojo)
jp: [素晴らしい道場](https://github.com/dojoengine/awesome-dojo)
lt: Impresionans Dojo
vi: Dojo tuyệt vời (https://github.com/dojoengine/awesome-dojo)

source: You should have a good understanding of Cairo before proceeding. If you're unfamiliar with Cairo, we recommend you read the [Cairo documentation](https://book.cairo-lang.org/title-page.html) first.
cn: 你在继续之前应该对开罗有一个很好的了解。如果你对开罗不熟悉，我们建议你先阅读《开罗文档》。 (https://book.cairo-lang.org/title-page.html)
jp: 進む前に、カイロについて十分な理解を持っているべきです。カイロについて詳しく知識がない場合は、最初に[カイロのドキュメント](https://book.cairo-lang.org/title-page.html)をお読みいただくことをお勧めします。
lt: Debent habere bene intelligentiam Cairo antequam procedas. Si ignotus es Cairo, tibi suademus lege [Cairo documentation](https://book.cairo-lang.org/title-page.html) primum.
vi: Bạn nên hiểu rõ về Cairo trước khi tiếp tục. Nếu bạn không quen thuộc với Cairo, chúng tôi khuyên bạn nên đọc tài liệu về Cairo trước (https://book.cairo-lang.org/title-page.html).

source: A New Approach to Game Development
cn: 游戏开发的新方法
jp: ゲーム開発への新たなアプローチ
lt: Nova Ratio ad Developmentem Ludorum
vi: Một Cách Tiếp Cận Mới Đối Với Phát Triển Trò Chơi

source: Dojo provides an advanced abstraction layer over Cairo, mirroring React's relationship with JavaScript. Its specialized architecture simplifies game design and development. By leveraging Dojo, developers can use succinct commands that transform into comprehensive queries at compile time. This chapter delves deeper into Dojo's unique architecture.
cn: 它的专门架构简化了游戏设计和开发。通过利用道场，开发人员可以使用简洁的命令，在编译时转化为全面的查询。本章深入探讨了道场独特的架构。
jp: 道場はカイロ上に高度な抽象化レイヤーを提供し、ReactとJavaScriptの関係を反映しています。その特殊なアーキテクチャは、ゲームの設計と開発を簡素化します。開発者は、Dojoを活用することで、簡潔なコマンドを使い、コンパイル時に包括的なクエリに変換することができます。この章では、Dojoのユニークなアーキテクチャについて詳しく説明します。
lt: Dojo praebeat stratum abstractionis super Cairo, imitans vicem React cum Iavascript. Suus specialis fabrica simplificat ludendi designum et progressionem. Benefacta Dojo, scriptores potest uti succinctis mandatis, quae convertuntur in comprehensivas interrogationes in tempore compilationis. Hic capitulum profundius exponit fabricam unamquamque Dojo.
vi: Dojo cung cấp một lớp trừu tượng tiên tiến trên Cairo, phản ánh mối quan hệ của React với JavaScript. Kiến trúc chuyên biệt của nó giúp đơn giản hóa thiết kế và phát triển trò chơi. Bằng cách tận dụng Dojo, các nhà phát triển có thể sử dụng các lệnh ngắn gọn mà chuyển đổi thành các truy vấn toàn diện vào thời gian biên dịch. Chương này đi sâu vào kiến trúc độc đáo của Dojo.

source: Delving into the Architecture
cn: 探索建筑设计
jp: 建築に深く関与する
lt: Mergens in Architecturam
vi: Đào sâu vào kiến ​​trúc

source: Dojo efficiently encapsulates boilerplate contracts within the compiler, letting developers concentrate on the distinct aspects of their game or app.
cn: 道场有效地将样板合同封装在编译器内，让开发人员专注于他们的游戏或应用程序的独特方面。
jp: 童所は、コンパイラ内でボイラープレートの契約を効率的にカプセル化することで、開発者が自分たちのゲームやアプリの独自の側面に集中することを可能にします。
lt: Dojo efficaciter involucris facit dentro compilatore, sinens progammatores concentrare in distinctis aspectibus sui ludi vel applicazioni.
vi: Dojo hiệu quả trong việc đóng gói các hợp đồng mẫu trong trình biên dịch, cho phép các nhà phát triển tập trung vào các khía cạnh riêng biệt của trò chơi hoặc ứng dụng của họ.

source: Consider this as the most basic Dojo world setup:
cn: 把这个看作是最基本的道场世界设置：
jp: これを最も基本的な道場の設定と考えてください。 (Kore o mottomo kihonteki na dōjō no settei to kangaete kudasai.)
lt: Hoc ut constitutum mundi Dojo rudissimum considera:
vi: Hãy coi đây như là sự thiết lập cơ bản nhất của thế giới Dojo:

source: While seemingly simple, behind the scenes Dojo generates foundational contracts, setting the stage for you to focus purely on data and logic.
cn: 表面上看起來很簡單，但道場在幕後生成了基礎合同，為您純粹專注於數據和邏輯設定舞台。
jp: シンプルに見えるが、裏側の道場は基本的な契約を生成し、データと論理に純粋に集中できるような舞台を作り出します。
lt: Dum videtur esse simplex, post scena Dojo producit contractus fundamentales, locum parans ut totum tibi concentres in data et ratione.
vi: Mặc dù dường như đơn giản, nhưng đằng sau cảnh sân khấu Dojo tạo ra các hợp đồng cơ bản, chuẩn bị cho bạn tập trung hoàn toàn vào dữ liệu và logic.

source: Lets take a look at the `main.cairo`:
cn: 让我们来看看 `main.cairo` 文件：
jp: 「main.cairo」を見てみましょう。
lt: Videamus `main.cairo`:
vi: Hãy xem file `main.cairo`:

source: // dojo data models
cn: 模型数据道场
jp: // 道場データモデル
lt: modellos datarum dojensis
vi: mô hình dữ liệu của dojo

source: // primary key
cn: 主键
jp: // プライマリキー
lt: clavis primaria
vi: khóa chính

source: // regular cairo struct
cn: 正常开罗结构
jp: 通常のカイロ構造体
lt: structura regularis Cairensis
vi: cấu trúc cairo thông thường

source: // interface
cn: 界面
jp: // インターフェース (inta-fe-su)
lt: interfata
vi: giao diện

source: // contract
cn: 合同
jp: 契約
lt: contrahere
vi: hợp đồng

source: // // NOTICE: we pass the world dispatcher as an argument to every function. // This is how we interact with the world contract. //
cn: 注意：我们将世界调度器作为参数传递给每个功能。这是我们与世界合同进行交互的方式。
jp: // // 注意：すべての関数に対して、ワールドディスパッチャを引数として渡します。 // これがワールドコントラクトとのやりとり方法です。 //
lt: NOTA: Nos mundum dispatcher ut argumentum ad omnis function. Hoc est quomodo nos interagimur cum mundo contractus.
vi: LƯU Ý: chúng tôi truyền thế giới dispatcher như một đối số cho mọi hàm. Đây là cách chúng tôi tương tác với hợp đồng thế giới.

source: // Access the world dispatcher for reading.
cn: 访问世界调度程序进行阅读。
jp: // 世界のディスパッチャにアクセスして読み込みます。
lt: Aditus ad mundi praeconem ad legendum.
vi: Truy cập bộ phận điều phối thế giới để đọc.

source: // get player address
cn: 获取玩家地址
jp: // プレーヤーのアドレスを取得する
lt: obtinere ludens address
vi: lấy địa chỉ người chơi

source: // dojo command - get player position
cn: 道场指令 - 获取玩家位置
jp: // ドージョコマンド - プレイヤーの位置を取得
lt: Imperium dojo - accipe positionem luditoris
vi: lệnh dojo - lấy vị trí người chơi

source: // dojo command - set player position
cn: 道馆命令 - 设置玩家位置
jp: // 道場の命令 - プレイヤーの位置を設定する
lt: ordo imperatiōnis - locum lūdēns statuere
vi: lệnh dojo - đặt vị trí người chơi

source: Breakdown
cn: 故障
jp: ブレークダウン (Burēkudaun)
lt: Disruption
vi: Sự đổ vỡ

source: This just a regular Cairo contract, with some specifics.
cn: 这只是一个普通的开罗合同，带有一些具体条款。
jp: これはただのカイロの契約で、いくつかの具体的な要素が含まれています。
lt: Hoc tantum est Cairo solito contractu, cum quibusdam particularibus.
vi: Đây chỉ là một hợp đồng Cairo thông thường, với một số điểm cụ thể.

source: `Position` struct
cn: 位置结构
jp: `Position` の構造体
lt: Structura `Positionis`
vi: Cấu trúc `Vị trí`

source: In a Dojo world, state is defined using models. These are structs marked with the `#[derive(Model)]` attribute, functioning similarly to a keypair store. The primary key for a model is indicated using the `#[key]` attribute; for instance, the `player` field serves as the primary key in this context.
cn: 在道场世界中，状态是使用模型进行定义的。这些模型是用`#[derive(Model)]`属性标记的结构体，类似于键值对存储的功能。模型的主键使用`#[key]`属性来指示；例如，在这种情况下，`player`字段作为主键。
jp: 道場の世界では、状態はモデルを使用して定義されます。これらは `#[derive(Model)]` 属性でマークされた構造体であり、キーペアストアのように機能します。モデルの主キーは `#[key]` 属性を使用して示されます。たとえば、この文脈では `player` フィールドが主キーとして機能します。
lt: In mundus Dojo, status definitur usuducens modellis. Hae sunt structurae insignitae cum attributo `#[derive(Model)]`, fungeres simile ad repositorium de clavigeriis. Clavis primaria pro modello indicatur cum attributo `#[key]`; verbi causa, ager `player` servat ut clavis primaria in hoc contextu.
vi: Trong một thế giới Đojo, trạng thái được xác định bằng cách sử dụng các mô hình. Đây là các cấu trúc được đánh dấu với thuộc tính `#[derive(Model)]`, hoạt động tương tự như một cửa hàng keypair. Khóa chính cho một mô hình được chỉ định bằng cách sử dụng thuộc tính `#[key]`; ví dụ, trường `player` đóng vai trò là khóa chính trong ngữ cảnh này.

source: Read more about models [here](./models.md).
cn: 阅读更多关于模型的内容[在这里](./models.md)。
jp: こちらで、モデルに関してもっと読むことができます。[詳細はこちらをご覧ください](./models.md)。
lt: Legere amplius de modelis [hic](./models.md).
vi: Đọc thêm về các mô hình [tại đây](./models.md).

source: `spawn` function - a dojo system
cn: “生成”功能 - 道场系统
jp: スポーン（出現）関数 - ドージョーシステム
lt: Fungi fructificare - a disciplina dojo
vi: hàm `spawn` - một hệ thống dojo

source: In the `spawn` function, take note of the second parameter: the `IWorldDispatcher` interface. This provides a gateway to the world contract. By integrating it into the function, it enables the `get!` and `set!` macros to interface directly with the world contract.
cn: 在`spawn`函数中，注意第二个参数：`IWorldDispatcher`接口。这提供了与世界合同的网关。通过将其集成到函数中，使`get!`和`set!`宏能够直接与世界合同进行交互。
jp: `spawn`関数では、第二パラメータに注目してください。それが`IWorldDispatcher`インターフェースです。これは、ワールド契約へのゲートウェイを提供します。この関数に統合することで、`get!`および`set!`マクロをワールド契約と直接連携させることが可能になります。
lt: In `functione natalium`, notate secundos parametrum: interfaciem `IWorldDispatcher`. Hoc ostendit portam ad contractum mundi. Quod eam integrantem in functionem facit `get!` et `set!` macros interficiendum directe cum contractu mundo.
vi: Trong hàm `spawn`, hãy chú ý đến tham số thứ hai: giao diện `IWorldDispatcher`. Điều này cung cấp một cổng vào hợp đồng thế giới. Bằng cách tích hợp nó vào hàm, nó cho phép các macro `get!` và `set!` giao tiếp trực tiếp với hợp đồng thế giới.

source: Commands, a significant innovation in Dojo, are further explored [here](./commands.md).
cn: 指令，在道场中是一项重大创新，[在这里](./commands.md)进一步探讨。
jp: 『コマンド』は、道場における重要なイノベーションであり、[こちら](./commands.md)で更に詳しく探求されています。
lt: Præcepta, innovatio gravis in Dojone, hic ulterius investigantur.
vi: Lệnh, một đổi mới quan trọng trong Dojo, được khám phá sâu hơn [ở đây](./commands.md).

source: High level transaction flow of a world
cn: 一个世界的高级交易流程
jp: 世界の高次の取引フロー
lt: Alta fluxus transactio ex ordine mundi
vi: Luồng giao dịch cấp cao của một thế giới

source: To call a Dojo world you invoke a system, which then calls the [world](./world.md) and does the necessary state changes.
cn: 称呼道场世界时，您需要调用一个系统，该系统会调用[world](./world.md)并进行必要的状态变化。
jp: 道場を呼ぶには、システムを呼び出します。その後、[world](./world.md)を呼び出して必要な状態の変更を行います。
lt: Ad monendis Dojo mundum vos invocare systema, qui tunc appellat [mundum](./world.md) et facit necessaria mutationes status.
vi: Để gọi một Dojo thế giới, bạn triệu hồi một hệ thống, sau đó gọi [thế giới](./thegioi.md) và thực hiện các thay đổi trạng thái cần thiết.

source: ![Dojo World](../images/world_flow.png)
cn: 道场世界
jp: ! [道場ワールド](../images/world_flow.png)
lt: Mundus Dojo
vi: Thế giới Dojo

source: **To think about:** Consider Autonomous Worlds as sovereign blockchains residing within another blockchain - a nested blockchain, so to speak. Just as you can deploy contracts onto Ethereum to enhance its functionality, you can similarly introduce systems into the World contract to enrich its features. While anyone can contribute to the World, akin to Ethereum, authorization is required to interact with model state. There is a dedicated topic to [Authorisation](./authorization.md).
cn: **思考：** 将自治世界视为驻留在另一个区块链内部的主权区块链 - 可以说是嵌套区块链。正如您可以将合同部署到以太坊以增强其功能一样，您可以类似地引入系统到世界合同中以丰富其功能。尽管任何人都可以为世界做出贡献，类似于以太坊，但需要授权才能与模型状态进行交互。[授权](./authorization.md)有专门的主题。
jp: 考えること：Autonomous Worldsを別のブロックチェーン内に存在する主権ブロックチェーンとして考えてみてください-まさにネストされたブロックチェーンです。Ethereum上に契約を展開して機能を強化できるように、同様にWorld契約にシステムを導入して機能を豊かにすることもできます。誰でもEthereumと同様にWorldに貢献することができますが、モデルの状態に対話するためには認可が必要です。[認証](./authorization.md)には専用のトピックがあります。
lt: Cogitare: Considera Mundos Autonomos tanquam catenae autonomae residens intra alia catena - catena intrinseca, ut ita dicam. Sicut potes contractus in Ethereum deployare ad eius functionality augendam, similiter systemata in contractum Mundi introducere potes ut eius characteres ditares. Quamvis quilibet ad Mundo contribuere possit, simile ad Ethereum, auctorizatio ad interagendum cum statu modello requisita est. Est topica dedicata ad [Authorisation](./authorization.md).
vi: **Cần suy nghĩ về:** Xem xét Autonomous Worlds như là các chuỗi khối chủ quyền tự trị đặt trong một chuỗi khối khác - một chuỗi khối lồng nhau, để nói cách khác. Đúng như bạn có thể triển khai các hợp đồng lên Ethereum để tăng cường tính năng của nó, bạn cũng có thể giới thiệu các hệ thống tương tự vào hợp đồng Thế giới để làm phong phú tính năng của nó. Mặc dù bất kỳ ai cũng có thể đóng góp cho Thế giới, tương tự như Ethereum, quyền được yêu cầu để tương tác với trạng thái mô hình. Có một chủ đề dành riêng cho [Ủy quyền](./authorization.md).

source: The World Contract
cn: 世界契约
jp: 世界契約 (Sekai Keiyaku)
lt: Pactum Mundi
vi: Hợp đồng thế giới

source: The world contract functions as a central store for the world models and systems. Every contract that interacts with the world, must use the world contract address as the first parameter. This is how the world contract is able to manage the state of the world.
cn: 世界合同作为世界模型和系统的中央存储库。与世界交互的每个合同都必须将世界合同地址作为第一个参数使用。这就是世界合同如何能够管理世界的状态。
jp: 世界契約は、世界のモデルとシステムを保管する中央ストアとして機能します。世界とやり取りするすべての契約は、第1パラメータとして世界契約アドレスを使用する必要があります。これによって、世界契約は世界の状態を管理することができます。
lt: Mundus contractus fungitur ut repositorium centrale mundi modelorum et systematum. Omnis contractus qui cum mundo interagit, debet uti adjecto contractus mundi loco primo parametro. Hoc est quomodo contractus mundi potest statum mundi administrare.
vi: Hợp đồng thế giới hoạt động như một cửa hàng trung tâm cho các mô hình và hệ thống thế giới. Mọi hợp đồng tương tác với thế giới phải sử dụng địa chỉ hợp đồng thế giới làm tham số đầu tiên. Đây là cách mà hợp đồng thế giới có thể quản lý trạng thái của thế giới.

source: Although we suggest strongly to structure your world around an ECS pattern you are not required to do so. You can simply use the dojo-models as a keypair store along with the supporting infrastructure.
cn: 尽管我们强烈建议你围绕ECS模式构建你的世界，但你并不需要这样做。你可以简单地使用道场模型作为一个键值对存储，以及配套的基础设施。
jp: ECSパターンを中心に世界を構築することを強く提案しますが、必ずしもそのようにする必要はありません。単にdojo-modelsをキーペアストアとして使用し、それに対応するインフラストラクチャを利用することもできます。
lt: Etsi vehementer suademus ut orbem tuum exstruas secundum formatum ECS, non cogimur id facere. Simpliciter potes uti dojo-models ut aedem clavium cum firmitate sustentationis.
vi: Mặc dù chúng tôi đề xuất mạnh mẽ cấu trúc thế giới của bạn xung quanh mô hình ECS nhưng bạn không bắt buộc phải làm như vậy. Bạn có thể đơn giản sử dụng dojo-models như một cửa hàng keypair cùng với cơ sở hạ tầng hỗ trợ.

source: Dojo core abstracts the world contract away, you do not write it and it is not meant to be altered when building a world. However, it's important to understand how it works and how it interacts with the rest of the system.
cn: 道场核心将世界契约抽象化，您不需要编写它，也不应在构建世界时对其进行更改。然而，了解其工作原理及其与系统其余部分的交互方式是很重要的。
jp: 道場コアは世界の契約を抽象化してくれます。書く必要はなく、また世界を構築する際に変更することもありません。しかし、それがどのように機能し、システムの他の部分とどのように連携するのかを理解することは重要です。
lt: Dojo core abstracts mundum pactum abstrahit, non scribis eum et non est destinatus mutari dum mundum aedificas. Tamen, est magni momenti intellegere quomodo agit et quomodo interagat cum reliqua systematis.
vi: Dojo core trừu tượng hóa hợp đồng thế giới, bạn không viết nó và nó không được dự định để được thay đổi khi xây dựng một thế giới. Tuy nhiên, quan trọng là hiểu cách nó hoạt động và cách nó tương tác với phần còn lại của hệ thống.

source: The `uuid()` command
cn: `uuid()` 命令
jp: 「uuid()」コマンド
lt: The `uuid()` imperium
vi: Lệnh `uuid()`
