Repository: 0xAsten/book
Catalog: po/*.po
Languages: cn, jp, lt, vi

source: Performing a system execution requires sending a transaction, therefore, `execute` expects an account address as well as its respective private key in order to sign the transaction before sending it.
cn: 执行系统执行需要发送交易，因此，“执行”还需要账户地址以及其相应的私钥，以便在发送之前对交易进行签名。
jp: システムの実行を行うには、トランザクションを送信する必要があります。したがって、「実行」は、トランザクションを送信する前に、アカウントのアドレスとそれに対応する秘密鍵を指定する必要があります。
lt: Actionem exequi systematis necessarium est transactionem mittere, itaque `exsequi` requirit locum nominis acceptantis et ipsum clavem privatum ut transactionem signet antequam eam transmittere.
vi: Thực hiện một thực hiện hệ thống đòi hỏi gửi một giao dịch, do đó, `thực hiện` mong đợi một địa chỉ tài khoản cũng như khóa riêng tư tương ứng của nó để ký giao dịch trước khi gửi nó.

source: `--calldata` _CALLDATA_ The calldata to be passed to the system that you want to execute. Comma separated values e.g., 0x12345,0x69420.
cn: "--calldata" _CALLDATA_ 要传递给要执行的系统的 calldata。 逗号分隔的数值，例如 0x12345,0x69420。
jp: 「--calldata」 _CALLDATA_ 実行したいシステムに渡す calldata です。 カンマで区切られた値、例えば 0x12345,0x69420 です。
lt: --calldata _CALLDATA_ Calldata ad systema quod exsequi vis transmittenda est. Valores separati, ut puta, 0x12345,0x69420.
vi: --calldata _CALLDATA_ Dữ liệu gọi cần được chuyển đến hệ thống mà bạn muốn thực thi. Các giá trị được phân tách bằng dấu phẩy ví dụ, 0x12345,0x69420.

source: Executing the _position_ system which takes two values (_x_: 0x77 and _y_: 0x44)
cn: 执行_position_系统，它有两个值（_x_: 0x77 和 _y_: 0x44）
jp: ２つの値（_x_：0x77と_y_：0x44）を取る_ position _ systemを実行します。
lt: Exsecutio systematis ordinis quod accipit duos valores (x: 0x77 et y: 0x44)
vi: Thực hiện hệ thống _vị trí_ có hai giá trị (_x_: 0x77 và _y_: 0x44)

source: sozo register
cn: 所以注冊
jp: 創造登録
lt: registro sozo
vi: đăng ký sozo

source: `register` is used to register new systems and components.
cn: “register”用于注册新系统和组件。
jp: `登録する`は新たなシステムやコンポーネントを登録するために使用されます。
lt: `Registrare` utitur ut nova systemata et componentes regit.
vi: `đăng ký` được sử dụng để đăng ký hệ thống và các thành phần mới.

source: # example: component - register a component to a world # this will register the Moves component to the world
cn: # 例: 组件 - 将一个组件注册到世界 # 这将会把Moves组件注册到世界上
jp: 例：コンポーネント - コンポーネントをワールドに登録する これにより、Movesコンポーネントがワールドに登録されます。
lt: example: component - registra componentem ad mundum hoc registrabit componentem Moves ad mundum
vi: # ví dụ: thành phần - đăng ký một thành phần vào thế giới # điều này sẽ đăng ký thành phần Moves vào thế giới

source: # example: system - register a system to a world # this will register the spawn system to the world
cn: # 例子：系统 - 将一个系统注册到世界上 # 这将把出生系统注册到世界上
jp: ＃例：システム - システムをワールドに登録する ＃これにより、スポーンシステムがワールドに登録されます
lt: sistema - registra systema ad mundum hoc systema registrabit ad mundum
vi: Đăng ký hệ thống đến một thế giới Điều này sẽ đăng ký hệ thống sinh học vào thế giới

source: sozo system
cn: 所识系统
jp: 創造システム
lt: sistēma sozo
vi: hệ thống sozo

source: `system` is used to interact with a World's systems. It is useful for querying about a system's information.
cn: `系统`被用来与世界上的系统进行交互。它对于查询系统信息很有用。
jp: `システム`は世界のシステムと対話するために使用されます。システムの情報についてクエリするのに役立ちます。
lt: `System` ad interactionem cum systematibus Mundi utitur. Utile est ad interrogationem de informatione systematis.
vi: `Hệ thống` được sử dụng để tương tác với các hệ thống trên thế giới. Nó hữu ích để truy vấn thông tin về hệ thống.

source: SUBCOMMANDS
cn: 子命令
jp: サブコマンド
lt: SUBCOMMANDOS
vi: Lệnh con

source: `get`
cn: 得到
jp: 取得する (shutoku suru)
lt: acquirere
vi: Nhận

source: Get the class hash of a system
cn: 获取系统的类哈希值
jp: システムのクラスハッシュを取得する
lt: Obtine classem systematis hash
vi: "Nhận giá trị băm của một hệ thống lớp"

source: Arguments
cn: 争论
jp: 論争
lt: Disceptationes
vi: Đối lập

source: _`NAME`_ The name of the system
cn: 名称 系统的名称
jp: システムの名称
lt: Nomen Nomen systematis
vi: Tên Tên của hệ thống

source: `dependency`
cn: 依赖
jp: 依存性 (いそんせい) [izonsei]
lt: dependantia
vi: phụ thuộc

source: Retrieve the component dependencies of a system
cn: 获取系统的组件依赖关系
jp: システムのコンポーネント依存関係を取得します
lt: Reperire conplexus dependentiarum systematis
vi: Lấy các phụ thuộc thành phần của một hệ thống

source: Get the class hash of the _spawn_ system
cn: 获取_spawn_系统的类哈希码
jp: "_spawn_ システムのクラスハッシュを取得する"
lt: Obtinete classis hash _spawn_ systematis
vi: Nhận lớp hash của hệ thống _spawn_

source: Get the component dependencies of the _spawn_ system
cn: 获取_spawn_系统的组件依赖。
jp: _spawn_ システムのコンポーネント依存関係を取得する
lt: Obtine componentes inceptae _spawn_ systematis
vi: Nhận các phụ thuộc thành phần của hệ thống _spawn_

source: sozo component
cn: 救赎元素
jp: 創造コンポーネント
lt: component sozo
vi: Thành phần sozo

source: `component` is used to interact with a World's components. It is useful for querying about a component's information, or a component value of an entity.
cn: “组件”用于与世界的组件进行交互。它可用于查询组件的信息或实体的组件值。
jp: 「コンポーネント」は、ワールドのコンポーネントとのやり取りに使用されます。コンポーネントの情報について問い合わせたり、エンティティのコンポーネントの値について調べるのに役立ちます。
lt: `Component` utitur ad interagendum cum componentibus Mundi. Utile est ad interrogationem de informatione componentis, vel valore componentis entitatis.
vi: `component` được sử dụng để tương tác với các thành phần của Thế giới. Nó hữu ích để truy vấn về thông tin của một thành phần, hoặc giá trị của một thành phần của một thực thể.

source: Get the class hash of a component
cn: 获取组件的类哈希
jp: コンポーネントのクラスハッシュを取得する
lt: Obtine classis hash componentis
vi: Lấy mã hash của một thành phần lớp

source: _`NAME`_ The name of the component
cn: _`名称`_ 组件的名称
jp: _`NAME`_ コンポーネントの名前
lt: Nomen
vi: Tên mục Tên của thành phần

source: `schema`
cn: 图表
jp: スキーマ
vi: kế hoạch

source: Retrieve the schema for a component
cn: 检索组件的模式
jp: コンポーネントのスキーマを取得する
lt: Reperire schematis pro componendo
vi: Lấy lại cấu trúc cho một thành phần

source: `entity`
cn: 实体
jp: エンティティ
lt: entitas
vi: Thực thể

source: Get the component value for an entity
cn: 获取实体的组件值
jp: エンティティのコンポーネントの値を取得する
lt: Obtine valorum componentis pro entitate
vi: Lấy giá trị thành phần cho một thực thể

source: _`KEYS`_ The keys of the entity that you want to query. Comma separated values e.g., 0x12345,0x69420,...
cn: `钥匙` 您想查询的实体的密钥。 逗号分隔的值，例如0x12345,0x69420,...
jp: _`KEYS`_ クエリを実行したいエンティティのキー。 カンマで区切られた値、例: 0x12345,0x69420, ...
lt: CLAVES Claves entitatis quam interrogare vis. Valores virgulam separati, e.g., 0x12345,0x69420,...
vi: Các khóa của thực thể mà bạn muốn truy vấn. Các giá trị được phân tách bằng dấu phẩy ví dụ, 0x12345, 0x69420,...

source: sozo events
cn: 所左事件
jp: 創造イベント
lt: eventus salvare
vi: các sự kiện sozo

source: `events` is used to queries world events.
cn: “事件”用于查询世界事件。
jp: 「events（イベント）」は世界のイベントをクエリするために使用されます。
lt: `Eventus` ad interrogandos eventus mundi utitur.
vi: `events` được sử dụng để truy vấn các sự kiện trên thế giới.

source: sozo auth
cn: 所作之事
jp: 創造認証 (Sōzō nintei)
lt: Salve illos
vi: Tác phẩm của Sozo

source: `auth` is used to manage world authorization.
cn: `auth` 用于管理世界授权。
jp: `auth`は世界の認証を管理するために使用されます。
lt: `Auth` adhibetur ad gubernandam authorizationem mundi.
vi: `auth` được sử dụng để quản lý quyền truy cập thế giới.

source: # example: writer - auth a system with the given calldata # This will auth the spawn system with the writer role for Position component
cn: # 示例：写作者 - 使用给定的调用数据认证系统 # 这将为Position组件的生成系统授予写作者角色
jp: 例：ライター - 指定された calldata でシステムを認証します この処理は、ポジションコンポーネントのライターロールでスポーンシステムを認証します
lt: auth a system with the given calldata Hoc auctenticabit systema auctorem systematis ad locum componentis
vi: # ví dụ: writer - auth hệ thống với dữ liệu gọi được cung cấp # Điều này sẽ xác thực hệ thống sinh với vai trò người viết cho thành phần Vị trí

source: Katana is a _blazingly fast_ sequencer, designed to support both local development as well as production deployments.
cn: Katana是一个飞快的顺序器，旨在支持本地开发和生产部署。
jp: カタナは、非常に高速なシーケンサーであり、ローカル開発とプロダクション展開の両方をサポートするために設計されています。
lt: Katana est sequencer _celerissimus_, adiutorem utrobique auctum, developmentum locale pariter ac deploymenta productiva.
vi: "Katana là một bộ trình tự _vô cùng nhanh chóng_, được thiết kế để hỗ trợ cả phát triển cục bộ cũng như triển khai sản xuất."

source: In development mode, Katana provides the tool necessary for rapid iteration, including custom development RPCs for manipulating the execution context.
cn: 开发模式下，Katana提供了必需的工具，用于快速迭代，包括用于操纵执行环境的自定义开发RPC。
jp: 開発モードでは、カタナは実行環境を操作するためのカスタム開発RPCを含む、迅速な反復作業に必要なツールを提供します。
lt: In modo evolutivo, Katana praebet instrumentum necessarium ad iterationem celerem, inclusis RPC's developmentis consuetis ad contextum exequentiae manipulandum.
vi: Trong chế độ phát triển, Katana cung cấp công cụ cần thiết để lặp lại nhanh chóng, bao gồm RPC phát triển tùy chỉnh để thay đổi ngữ cảnh thực thi.

source: In produciton mode, Katana provides a high performance sequencer optimized for gaming workloads, with support for settlment and cross layer communication.
cn: 在生产模式下，Katana提供了一个针对游戏工作负载进行优化的高性能顺序执行器，具有支持结算和跨层通信的功能。
jp: 製造モードでは、Katanaはゲームのワークロードに最適化された高性能シーケンサーを提供し、決済およびクロスレイヤーの通信をサポートします。
lt: In produciton modo, Katana praestat sequenti altam efficientiam, optime accommodatam ad labores ludicos, cum supportu ad communicationem ad transactiones et inter strata.
vi: Trong chế độ sản xuất, Katana cung cấp một bộ ghi mạnh mẽ được tối ưu hóa cho các công việc game, với sự hỗ trợ cho quá trình định cư và giao tiếp bên lớp.

source: [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) support
cn: Starknet JSON-RPC v0.3.0 支持 (https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)
jp: [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) のサポート
lt: Sustinere [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)
vi: Hỗ trợ Starknet JSON-RPC v0.3.0 (https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)

source: Cross layer communication (L1 \<\> L2, LN \<\> LN+1)
cn: 跨层通信（L1 \<\> L2, LN \<\> LN+1）
jp: クロスレイヤーコミュニケーション（L1 \<\> L2、LN \<\> LN+1）
lt: Communicatio inter stratum crucem (L1\<\> L2, LN\<\> LN+1)
vi: Giao tiếp giữa các lớp (L1 \<\> L2, LN \<\> LN+1)

source: Custom methods for manipulating the blockchain states
cn: 定制方法来操纵区块链状态
jp: ブロックチェーンの状態を操作するためのカスタムメソッド
lt: Custom methodi ad statum blockchain manipulandum
vi: Phương pháp tùy chỉnh để thao tác trạng thái blockchain

source: `katana` binary is available via [`dojoup`](../../getting-started/quick-start.md).
cn: 刀二进制文件可以通过[`dojoup`](../../getting-started/quick-start.md)获得。
jp: `katana`バイナリは[`dojoup`](../../getting-started/quick-start.md)を通じて入手できます。
lt: 'katana' binarius per [`dojoup`](../../getting-started/quick-start.md) disponitur.
vi: `katana` binary có sẵn qua [`dojoup`](../../getting-started/quick-start.md).

source: Installing from source
cn: 从源代码安装
jp: ソースからのインストール
lt: Praesertim ab satione installandi
vi: Cài đặt từ nguồn

source: ```console ██╗ ██╗ █████╗ ████████╗ █████╗ ███╗ ██╗ █████╗ ██║ ██╔╝██╔══██╗╚══██╔══╝██╔══██╗████╗ ██║██╔══██╗ █████╔╝ ███████║ ██║ ███████║██╔██╗ ██║███████║ ██╔═██╗ ██╔══██║ ██║ ██╔══██║██║╚██╗██║██╔══██║ ██║ ██╗██║ ██║ ██║ ██║ ██║██║ ╚████║██║ ██║ ╚═╝ ╚═╝╚═╝ ╚═╝ ╚═╝ ╚═╝ ╚═╝╚═╝ ╚═══╝╚═╝ ╚═╝ PREFUNDED ACCOUNTS ================== | Account address | 0x3ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 | Private key | 0x300001800000000300000180000000000030000000000003006001800006600 | Public key | 0x1b7b37a580d91bc3ad4f9933ed61f3a395e0e51c9dd5553323b8ca3942bb44e | Account address | 0x33c627a3e5213790e246a917770ce23d7e562baa5b4d2917c23b1be6d91961c | Private key | 0x333803103001800039980190300d206608b0070db0012135bd1fb5f6282170b | Public key | 0x4486e2308ef3513531042acb8ead377b887af16bd4cdd8149812dfef1ba924d ACCOUNTS SEED ============= 0 🚀 JSON-RPC server started: http://0.0.0.0:5050 ```
cn: ```console ██╗ ██╗ █████╗ ████████╗ █████╗ ███╗ ██╗ █████╗ ██║ ██╔╝██╔══██╗╚══██╔══╝██╔══██╗████╗ ██║██╔══██╗ █████╔╝ ███████║ ██║ ███████║██╔██╗ ██║███████║ ██╔═██╗ ██╔══██║ ██║ ██╔══██║██║╚██╗██║██╔══██║ ██║ ██╗██║ ██║ ██║ ██║ ██║██║ ╚████║██║ ██║ ╚═╝ ╚═╝╚═╝ ╚═╝ ╚═╝ ╚═╝ ╚═╝╚═╝ ╚═══╝╚═╝ ╚═╝ PREFUNDED ACCOUNTS ================== | 帐户地址 | 0x3ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 | 私钥 | 0x300001800000000300000180000000000030000000000003006001800006600 | 公钥 | 0x1b7b37a580d91bc3ad4f9933ed61f3a395e0e51c9dd5553323b8ca3942bb44e | 帐户地址 | 0x33c627a3e5213790e246a917770ce23d7e562baa5b4d2917c23b1be6d91961c | 私钥 | 0x333803103001800039980190300d206608b0070db0012135bd1fb5f6282170b | 公钥 | 0x4486e2308ef3513531042acb8ead377b887af16bd4cdd8149812dfef1ba924d 帐户种子 ============= 0 🚀 JSON-RPC 服务器已启动：http://0.0.0.0:5050 ```
jp: ```japanese ██╗ ██╗ █████╗ ████████╗ █████╗ ███╗ ██╗ █████╗ ██║ ██╔╝██╔══██╗╚══██╔══╝██╔══██╗████╗ ██║██╔══██╗ █████╔╝ ███████║ ██║ ███████║██╔██╗ ██║███████║ ██╔═██╗ ██╔══██║ ██║ ██╔══██║██║╚██╗██║██╔══██║ ██║ ██╗██║ ██║ ██║ ██║ ██║██║ ╚████║██║ ██║ ╚═╝ ╚═╝╚═╝ ╚═╝ ╚═╝ ╚═╝ ╚═╝╚═╝ ╚═══╝╚═╝ ╚═╝ PREFUNDED ACCOUNTS ================== | Account address | 0x3ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 | Private key | 0x300001800000000300000180000000000030000000000003006001800006600 | Public key | 0x1b7b37a580d91bc3ad4f9933ed61f3a395e0e51c9dd5553323b8ca3942bb44e | Account address | 0x33c627a3e5213790e246a917770ce23d7e562baa5b4d2917c23b1be6d91961c | Private key | 0x333803103001800039980190300d206608b0070db0012135bd1fb5f6282170b | Public key | 0x4486e2308ef3513531042acb8ead377b887af16bd4cdd8149812dfef1ba924d ACCOUNTS SEED ============= 0 🚀 JSON-RPCサーバーが開始されました：http://0.0.0.0:5050 ```
vi: ```console ██╗ ██╗ █████╗ ████████╗ █████╗ ███╗ ██╗ █████╗ ██║ ██╔╝██╔══██╗╚══██╔══╝██╔══██╗████╗ ██║██╔══██╗ █████╔╝ ███████║ ██║ ███████║██╔██╗ ██║███████║ ██╔═██╗ ██╔══██║ ██║ ██╔══██║██║╚██╗██║██╔══██║ ██║ ██╗██║ ██║ ██║ ██║ ██║██║ ╚████║██║ ██║ ╚═╝ ╚═╝╚═╝ ╚═╝ ╚═╝ ╚═╝ ╚═╝╚═╝ ╚═══╝╚═╝ ╚═╝ TÀI KHOẢN ĐƯỢC HOÀN TIỀN TRƯỚC ================== | Địa chỉ tài khoản | 0x3ee9e18edc71a6df30ac3aca2e0b02a198fbce19b7480a63a0d71cbd76652e0 | Khóa cá nhân | 0x300001800000000300000180000000000030000000000003006001800006600 | Khóa công khai | 0x1b7b37a580d91bc3ad4f9933ed61f3a395e0e51c9dd5553323b8ca3942bb44e | Địa chỉ tài khoản | 0x33c627a3e5213790e246a917770ce23d7e562baa5b4d2917c23b1be6d91961c | Khóa cá nhân | 0x333803103001800039980190300d206608b0070db0012135bd1fb5f6282170b | Khóa công khai | 0x4486e2308ef3513531042acb8ead377b887af16bd4cdd8149812dfef1ba924d HẠT GIỐNG TÀI KHOẢN ============= 0 🚀 Máy chủ JSON-RPC đã được khởi động: http://0.0.0.0:5050 ```

source: To enable development features, run using the `--dev` flag.
cn: 启用开发功能，使用 `--dev` 标志来运行。
jp: 開発機能を有効にするためには、`--dev`フラグを使用して実行してください。
lt: Ad committendum progressiones, currite uti `--dev` vexillum.
vi: Để kích hoạt các tính năng phát triển, chạy bằng cờ `--dev`.

source: See the [`katana` Reference](./reference.md) for an in depth reference and documentation on Katana.
cn: 请查看关于Katana的深度参考和文档的[`katana`参考](./reference.md)。
jp: かたなの詳細な参照およびドキュメンテーションについては、[`katana` リファレンス](./reference.md)を参照してください。
lt: Vide [`katana` Remissio](./reference.md) pro profunda commissio et monumentationem in Katana.
vi: Xem [Tham khảo `katana`](./reference.md) để có thông tin chi tiết và tài liệu về Katana.

source: katana reference
cn: 刀的参考
jp: "刀の参照" (Katana no sanshō)
lt: referentia ad katana
vi: tham khảo katana

source: NAME
cn: 姓名
jp: 名前 (Namae)
lt: NOMEN
vi: TÊN

source: katana - Create a local testnet node for deploying and testing Starknet smart contracts.
cn: 刀 - 为部署和测试Starknet智能合约创建本地测试网节点。
jp: katana - スタークネットのスマートコントラクトを展開してテストするためのローカルテストネットノードを作成します。
lt: gladius - Locum testnet nodum creare ad Starknet contractus sagaces deployendos et testandos.
vi: katana - Tạo một nút mạng thử nghiệm cục bộ để triển khai và kiểm thử hợp đồng thông minh Starknet.

source: DESCRIPTION
cn: 描述
jp: 説明
lt: DESCRIPTIO
vi: Mô tả

source: Create a local testnet node for deploying and testing Starknet smart contracts. Katana supports deployment and execution of the **new** as well as the **legacy** (Cairo 0) Cairo contracts.
cn: 创建一个本地的测试网节点，用于部署和测试Starknet智能合约。Katana支持部署和执行**新**以及**旧**（Cairo 0）版本的Cairo合约。
jp: スタークネットのスマートコントラクトをデプロイしてテストするためのローカルテストネットノードを作成してください。「刀」は、**新しい**カイロ契約と**従来の**（カイロ0）カイロ契約のデプロイと実行をサポートしています。
lt: Creare nodum testnet localis ad dispendendum et probandum contrahenda sapientia Starknet. Katana deploymentem et executionem novorum et veterum (Cairo 0) contractuum Cairo sustentat.
vi: Tạo một nút mạng thử nghiệm địa phương để triển khai và kiểm thử hợp đồng thông minh Starknet. Katana hỗ trợ triển khai và thực thi các hợp đồng Cairo **mới** cũng như **cũ** (Cairo 0).

source: This section covers an extensive list of information about Mining Modes, Supported RPC Methods, Katana flags and their usages. You can run multiple flags at the same time.
cn: 这一部分涵盖了有关采矿模式、支持的RPC方法、Katana标志及其用法的大量信息。您可以同时运行多个标志。
jp: このセクションでは、マイニングモード、サポートされているRPCメソッド、カタナフラグ及びその使用方法についての詳細な情報が網羅されています。同時に複数のフラグを実行することが可能です。
lt: Hic pars continet amplam tabulam informationis de modis excavationis, methodis RPC supportatis, signis Katana et eorum usu. Potestis signa multa simul currere.
vi: Phần này bao gồm một danh sách chi tiết về thông tin về Chế độ Khai thác, Các phương pháp RPC được hỗ trợ, Cờ Katana và cách sử dụng chúng. Bạn có thể chạy nhiều cờ cùng một lúc.

source: Mining Modes
cn: 采矿模式
jp: マイニングモード
lt: Modi Minerari
vi: Chế độ khai thác mỏ

source: In Katana, mining modes determine how frequent blocks are mined. By default, a new block is automatically mined as soon as a transaction is submitted.
cn: 在Katana中，挖掘模式决定了区块被挖掘的频率。默认情况下，一旦提交了一个交易，新的区块就会被自动挖掘出来。
jp: カタナでは、マイニングモードによってブロックの採掘頻度が決まります。デフォルトでは、トランザクションが送信されるとすぐに新しいブロックが自動的に採掘されます。
lt: In Katana, modi excitationis determinant, quam crebro aedificia exciduntur. Ex defaulto, novum aedificium automatice exciditur, quotiens transactio submissa est.
vi: Trong Katana, các chế độ khai thác xác định tần suất khai thác khối. Theo mặc định, một khối mới được khai thác tự động ngay khi giao dịch được gửi đi.

source: You can switch from the default mining behaviour to interval mining, where a new block is created at a fixed time interval selected by the user. To enable this mode of mining, use the `--block-time <MILLISECONDS>` flag, as demonstrated in the following example.
cn: 您可以从默认的挖矿行为切换到间隔挖矿，用户可以选择固定时间间隔创建新的区块。要启用这种挖矿模式，请使用`--block-time <毫秒>`标志，如下面的示例所示。
jp: デフォルトのマイニング動作からインターバルマイニングに切り替えることができます。ユーザーが選択した固定時間間隔で新しいブロックが作成されます。このマイニングモードを有効にするには、以下の例に示すように `--block-time <ミリ秒>` フラグを使用してください。
lt: Potes mutare a solito comportamento excavationis ad intervallum excavationis, ubi novum cuneus creatus est tempore certo interiecto a usuarius. Ut hunc modum excavationis efficere, utere vexillo `--block-time <MILLISECONDS>`, sicut demonstratum est in sequenti exemplo.
vi: Bạn có thể chuyển từ hành vi khai thác mặc định sang khai thác theo khoảng thời gian, nơi một khối mới được tạo ra tại một khoảng thời gian cố định do người dùng chọn. Để kích hoạt chế độ khai thác này, sử dụng cờ `--block-time <MILLISECONDS>`, như được minh họa trong ví dụ sau.

source: # Produces a new block every 10 seconds
cn: 每10秒生成一个新的区块
jp: # 10秒ごとに新しいブロックを生成します。
lt: # Omnes decem secundo novo bloco producuntur
vi: Sản xuất một khối mới mỗi 10 giây

source: Forking
cn: 叉道
jp: フォーキング
lt: Bifurcans
vi: Nghé, nắm nghé

source: Katana supports forking from a Starknet RPC provider. You can configure your node to enable the forking feature by providing a valid RPC provider using the `--rpc-url <URL>` flag., which would initiate Katana to fork the latest block of the provided network. If you would like to fork from a specific block, you can do so using `--fork-block-number <BLOCK_NUMBER>`.
cn: Katana支持从Starknet RPC提供商进行分叉。您可以通过使用`--rpc-url <URL>`标志来配置您的节点，以启用分叉功能，从而提供有效的RPC提供商。这将启动Katana分叉所提供网络的最新区块。如果您想从特定区块进行分叉，可以使用`--fork-block-number <BLOCK_NUMBER>`来实现。
jp: KatanaはStarknet RPCプロバイダーからのフォークをサポートしています。`--rpc-url <URL>`フラグを使用して有効なRPCプロバイダーを提供することで、ノードをフォーキング機能を有効にすることができます。これにより、Katanaは提供されたネットワークの最新のブロックをフォークします。特定のブロックからフォークする場合は、`--fork-block-number <BLOCK_NUMBER>`を使用することもできます。
lt: Katana sustinet bifurcandum ab praebebatore Starknet RPC. Tu potes configurare nodum tuum ut funcionalitatem bifurcandi faciat, praeberens praebebatorem RPC validum per vexillum `--rpc-url <URL>`, quod initiaret Katanam ad bifurcandum ultimum bloccum network praebebatum. Si vis bifurcare ab blocco specifico, potes facere per `--fork-block-number <BLOCK_NUMBER>`.
vi: Katana hỗ trợ forking từ một nhà cung cấp RPC của Starknet. Bạn có thể cấu hình node của mình để kích hoạt tính năng forking bằng cách cung cấp một nhà cung cấp RPC hợp lệ bằng cách sử dụng cờ `--rpc-url <URL>`, điều này sẽ khởi động Katana để forking khối mới nhất của mạng được cung cấp. Nếu bạn muốn forking từ một khối cụ thể, bạn có thể làm điều đó bằng cách sử dụng `--fork-block-number <BLOCK_NUMBER>`.

source: NOTE: This does not allow fetching of historical blocks but only blocks that are mined by Katana. However, support for fetching historical blocks will be added in the future.
cn: 注意：这不允许获取历史区块，而只能获取由Katana挖掘的区块。但是，将来将会添加获取历史区块的支持。
jp: 注意：これによって、Katanaによって採掘されたブロックのみが取得できます。ただし、将来的には履歴ブロックの取得にも対応する予定です。
lt: NOTA: Hoc non permittere extractionem blocorum historicorum sed tantum blocos a Katana minitos. Tamen, in futuro adiuncta erit auxilium ad extractionem blocorum historicorum.
vi: LƯU Ý: Điều này không cho phép lấy các khối lịch sử mà chỉ cho phép lấy các khối được đào bởi Katana. Tuy nhiên, hỗ trợ cho việc lấy các khối lịch sử sẽ được thêm vào trong tương lai.

source: # Forks the network at block 1200
cn: # 在块1200处分叉网络
jp: ブロック1200でネットワークを分岐させます。
lt: Bifurcat in rete ad bloccum duodecimcentesimum
vi: # Phân nhánh mạng tại khối 1200

source: Messaging
cn: 信息传递
jp: メッセージ
lt: Nuntiandi
vi: Gửi tin nhắn

source: Katana also allows users to perform L1 \<\-> L2 integration using the messaging feature. There are two types of messaging service supported by Katana:
cn: Katana还允许用户使用消息功能执行L1<->L2集成。 Katana支持两种类型的消息服务：
jp: カタナは、ユーザーがメッセージ機能を使用してL1 \<\-> L2の統合も行うことができます。カタナでサポートされているメッセージングサービスには2つのタイプがあります。
lt: Katana etiam utentibus permittit integrationem L1 \<\-> L2 per caracterem mittere. Sunt duo genera servitii nuntiorum quod sustinetur ab Katana:
vi: Katana cũng cho phép người dùng thực hiện tích hợp L1 \<\-> L2 bằng cách sử dụng tính năng nhắn tin. Có hai loại dịch vụ nhắn tin được hỗ trợ bởi Katana:

source: _Ethereum_
cn: 以太坊
jp: イーサリアム
lt: _Æthereum_

source: _Starknet_ (**experimental**)
cn: 星际网络（试验性）
jp: スタークネット（実験的）
vi: Starknet (thử nghiệm)
